{
  "video_id": "0J0Tjqc4efY",
  "transcription": " Christmas Song  What's going on guys I want to walk you through my full body workouts So I've been doing a lot of full body workouts recently Just because my diet's kind of been slacking and full body workouts are great for like fat loss and to burn body fat quickly So I always like to include some like HIIT workouts into my full body workouts so you can see here I'm doing some jump squats, and I love doing jump squats or burpees or jump lunges  I like to incorporate like two jumping movements into my full body workouts Then I always like to include some arm workouts so you can see I'm doing the alternating bicep curls For these curls you want to make sure that you're gonna do the same amount on the each arm So I know that can sound like common sense, but I've gotten questions about like muscle imbalances and stuff like that So I did 24 reps so make sure you're doing an even number So you're doing the same amount on each arm, so you don't have that muscle imbalance and so your biceps are the same  Same size on each arm For this whole workout. I just like set down my weights and I jumped right into the next exercise For this style training. You don't want to take breaks. You want to just go in right after the other Obviously if you're like out of breath and you're dying then don't do that like just take like a second break But I typically don't like to take any break. I like to just jump right into the next movement That's why I didn't want to cut up this footage so you guys can really see That I jump right back into the next exercise right after I finished  the previous one. So this one I really like to do because this is like full body 101 I feel like this workout because you're gonna squat down so you're gonna be working out your legs and then you're gonna push up into a press with medicine balls and you're gonna be working like your shoulders. I felt this one a little bit of my biceps too and this one's a great movement because it gets your heart rate up because you're just constantly like one steady movement squatting and then pushing up. So I really like doing that one on full body circuits because it gets my heart rate up beating really fast and you girls going crazy and burning  all those calories. Then I also always like to include some ab workouts. So for my full body, when I write up my workouts, I kind of like to incorporate two jumping movements, like two arm movements and two ab work movements. And that's usually about like six. Sometimes I'll throw in some legs. So like the squat and press was kind of like legs and arms. And then jumping jacks was my second jumping movement. Jumping jacks are no joke. I know they are seem easy, but if you push yourself and you go fast enough and if you do enough, they suck.  So that was the end of my workout video. That's all I have for this video. So I hope you guys liked it. If you did like this video and you want to see more workout content with voiceovers, then give this video a big thumbs up. And I will see you guys all back on my channel tomorrow. Happy Vlogmas day three. I'm excited. This has been fun so far. So love you guys. Thank you so much for your support. If you are not already subscribed, hit the subscribe button so you never miss workouts and meals and just a bunch of good content.  So, love you guys. I think I already said that. I'm a crazy person. Love me, okay, bye."
}