{
  "video_id": "19hfQm5-3Mo",
  "transcription": " Hello and welcome to another episode of On the Water. Today we're going to be on a 2019 Sea Hunt 225 Ultra. This is one of the smaller models that they make, but it's still got the same hull design as all the other bigger boats. So as you can probably see, Long Island Sound today has decided to be a mill pond, so I can't talk too much about the rough water handling, but it'll allow me to do a good VMAX run and tell you honestly how fast you will go wide open throttle.  Right now I'm just in gear. It idles at about 600 RPM and does about three miles an hour. We're burning 0.4 of a gallon an hour. So I'm gonna bring it through the RPM ranges, tell you about how fast we're going, how much fuel we're burning. And then once we're up at speed, we'll zip around a little bit and just kind of give you a good overview of the boat out on the water. So first thing I'm gonna do is I'm gonna bump it up to what I would consider to be harbor cruising RPM, which is about 1400, 1500 RPM.  and that will give you about 6 miles an hour and you're also not creating a ton of weight to piss off anybody at the marinas. So at 1500 RPM you're doing 7 miles an hour and you're still only burning 1.2 gallons an hour. So let's start bumping it up and see what she'll do. So at 2000 RPM we're doing 8 miles an hour and burning about 2 gallons an hour. Let's bump it up to  RPM that should start to get us up on plane or damn near. This boat doesn't have a wrap around windshield so if it gets a little windy forgive the wind noise. So at 3,000 RPM we're doing 15 miles an hour. We're kind of just sort of planing but we're only burning 4.1 gallons an hour. Again this boat has a 200 horsepower Yamaha and so let's bump it up to 4 that'll definitely get us up on plane.  And so all these Sea Hunts I typically cruise them at around 4,000 to 4,200. I find that to be the best cruising RPM for this boat. So right now we are at 4,000 RPM and we're doing 28 miles an hour very comfortably and still only burning just over 7 gallons an hour. Let's bump it up to 4,500.  giving us 33 miles an hour and an 8.5 gallon an hour or yeah gallons per hour cruise. Let's open her up all the way and see what she'll do.  is 17.7 to 18 gallons an hour. And as you can see, it's flat calm, so it's perfectly comfortable. And I'll do a little bit of a turn in. And you can see she tracks very well, very comfortably. Swing it back the other way. Never feels like the back end is gonna kick out on ya, even though I'm at almost full lock, doing a nice tight turn. We are losing a little bit of speed, but it never feels dangerous.  And so these boats are just really, really great all-around boats. And I'm going to drop it back down to cruise. That's 4,000 RPM. And so, you know, this boat at 30 miles an hour, you can cruise it all day long, totally comfortably. If you need to, you can drop it into high gear, do 40, 42, get places. But overall, this is just a really well-rounded, small little boat for doing anything you want to do, getting out with the family, going on some adventures, going fishing, obviously.  But I guess that's it for this boat and until next time, I'll see you guys out on the water."
}