{
  "video_id": "1PP7MkW3kkI",
  "transcription": " Tuesday morning, Catherine and the baby are at story time. I'm getting ready to record a couple episodes of the inside real estate show. We actually have a fairly manageable schedule today, meaning we have  two to three hours in our day that doesn't have anything scheduled and we don't necessarily need to be working on anything specific. So we're just trying to figure out what to do with that time. One of the things I wanted to talk about today is I made reference in yesterday's video to something along the lines, we did our 20 miles today. And I know that that probably has no context  to what's going on here. So I thought I'd share with you today what that really means.  All right, I'm just getting ready to record some episodes of Inside Real Estate Show. If you've not watched any of those shows, they're on the same channel. So just check out the channel. We have a whole playlist of those or go to insiderealestateshow.com. But Tuesday mornings is when I try to fit these in if I can. Otherwise, we just squeeze them in wherever we can, but getting ready to record these episodes right now.  Okay, we're done recording episodes of Inside Real Estate Show. Lots of tasks. Lots of tasks that I want to check off the list today and it's Tuesday, which means  we would really like to do Taco Tuesday. Okay, let's have a money meeting about that. Morgan, I see a butt. Alright, obviously Catherine is back home. I'm done with filming a video.  I'm done with recording inside Real Estate Show, doing some editing on that. What time is it? It's about two o'clock. We're gonna go have a late lunch, early dinner. I'm not sure what it is, but we're gonna go do our Taco Tuesday at Kaei.  foreign  So what does the 20 miles  miles mean.  Their expedition would be about 1,400 miles to get to where the South Pole was and back to safety where it wasn't just death and cold. 1,400 miles, think about that. I think it's just under 2,000 miles from Seattle to Madison, Wisconsin.  what 1400 miles is, imagine trying to walk that in the South Pole. With no cell phones, satellite, nothing. This is 1911. These two explorers, two team leaders, whatever we want to call them, took very different approaches. Scott's approach was, on good days, we're gonna go as far and as fast as we can, and then on days when it's cold,  and the weather sucks, let's just hang out. We'll let the weather pass over us. Munson, on the other hand, his objective was to do 20 miles every day, no matter what, whether the weather was good, whether the weather was bad, whether the troops felt like they could do more, or if they didn't feel like doing anything, 20 miles every day, no matter what.  So, ah So who do you think? Did better who do you think made it home before the other one? Well a month's in the 20-mile March every day they got back first and actually only Scott's team ended up dying on their journey back That didn't work out so well for them. So that's what the 20-mile March means in  and how I look at it with business, health, wealth building, whatever, consistent action, regular action, benefits, just doing something when you feel like it or when you have the inspiration. The consistent is always better. Otherwise you could end up dying like Scott's team. A good quote to go along with that idea of the 20 mile march is from an author,  Maxwell he wrote all of these books right here. You will never change your life until you change something you do daily. The secret of your success is found in your daily routine. Another one of my thoughts on this is what you do sometimes neither harms nor benefits you.  you"
}