{
  "video_id": "1Qx9GypQlb0",
  "transcription": " Gosh darn it. Alright, we've been up all night trying to get this fucking episode together. The run return. Our internet sucks. It is so slow. So we're gonna go for a drive and try and find some fast internet. How's it going? We're here to steal some free Wi-Fi. Are we actually ordering something? No, we'll probably park outside and use some Wi-Fi. Thank you though. It's a 30 minute parking and just follow this strip upwards to the drive-thru. Yes, it's done. It's uploading. It's processing. Literally the video was up for one minute.  And it's got limited ads I put on it straight away 7% of our views were monetized in the last quarter on YouTube. It's terrible. But McDonald's Wi-Fi is pretty quick. It's so funny because we're actually banned from every single McDonald's in Australia. Hey, they sent an email. Cheers!  Everyone's curious Michael what's wrong like on set? Ron just threw the fucking ball at the window even though that wasn't the shot  Runs about to do a pretty dangerous stunt. He's about to go through this glass We don't know if it's safety glass or we don't know what sort of glass it is at all Any last words J  Dude that looks savage as fuck. As I smacked it I saw the hole like it went in slow-mo and I just looked up bro and I was like fuck. We thought it might have been safety glass so when he hits it the whole thing shatters and the muck goes through but that didn't happen. The muck will literally break that glass with his body. Bro that was the most intense shit I've ever done G.  Oh, this is my store, this is my store. They didn't want to give you order of bullshit  What the fuck was going on this morning with Sam? We got home at like 4 a.m. And like since Sam's final day today, so it was going on fucking weird like weird So like three chicks on his bed and two with some random lesbian some Ireland. I like hook it up on his bed He was with Marilyn Marilyn is Clive's wife and then randomly Clive walked in on everything started beating the shit out of Sam pulling his hair  Why the fuck did you try to choke out Sam this morning simple bro, I hate fat people feel fat Do you realize how quiet the house is gonna be without Sam or the boys it's gonna be quiet  Granddad's cooler jumper coolest thing I've ever seen in the whole fucking planet automatically not cool Mark would be looking for the keys for about an hour and he found them inside his car You guys are geniuses when it comes to filmmaking But you guys are completely neglectful and retarded for every other aspect point your life the fact that you guys are still breathing It baffles me don't put it back on don't do it. Don't know God you got a problem with it 2008 Justin Bieber wants his pants  This one's curious, that's amazing  Hey, it's not for you mate. This is probably the most important game of the season. Now, I know what they're all saying. You've already lost. If you band together and you play as one, not only will you win the game, you will win the season. In we go. He's not interested. Here is another kangaroo whisperer, Danny Philippou. Another thing Danny Philippou will do is, oh God.  Oh my god  I'm still going and I want a reminder of that.  reminder on my leg and that's what that reminder is gonna be and also I said I was gonna get real son I said I was gonna get real I've had more fun with these guys in the last like three weeks than I've had in a long time being in Japan and I feel that the least I could do is put their fucking name on my body because I feel like I need to do a lot more and that's just the first part  I think I'm ready to have you on my body Danny.  There's the saying be a maverick and then there's the saying be a fat ass and that's Tokyo Sam you need to do this you need to stand on that Pleasure to get to know you sir  I'm gonna miss all you guys honestly Yeah, all right yeah, yeah, that's my friend Sam everyone my friend Sam That's my friend everyone on this flight is gonna be with my friend Sam cut the queue You just cut the queue He was gone  SOOOOOOONNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNNN  You is ready to jump!"
}