{
  "video_id": "1SwvQVV5fug",
  "transcription": " a  be  to  really  and move it and it would make it so that when you'd shift the shifter would feel all shaky and movie and it wasn't nice. So in order to combat that I bought four washers and put them in between the screws and the shifter and I felt like it was not right for me to have to go out and buy additional parts for this kit when it should be a kit that comes with all the pieces. Because also these didn't tighten completely the shifter fell apart while I was racing. I talked about this in the original review that I have with the RP short shifter but I was midway through a race and because these had to have washers in between and there was not like a good amount of grip  for the screws. As I was racing, the shifter just started feeling all weird like I was shifting through soup and not like solid shifts like it originally felt like. And I looked down and the base had completely become detached from the base of the short shifter. And it was bad. So I decided to make a review of the short shifter and talk about all my grievances of it. And after I made that review, IRP, the company that makes the short shifter, went out and contacted me asking for help to make sure that their new shifter would solve all of the issues that I had with the old one.  on  the  so much smoother to press in now and there's no noise. And after I drove it at the track, there was no rattle to be found. So after I installed the shifter, I went for a drive around and like I said, still no rattle noise. And then I'll play you guys a clip right now of my last track day. Even in high RPMs at like the hardest I could be driving the car, still no rattle.  So aside from that, the other grievance that I was talking about is the fact that this base and this base of the shifter, there was a distance between them, even when you screw the screws in completely. And after I installed the new shifter, I screwed these in and there was no need for any additional washers, no need for any additional pieces. It held in really tight and it held in really well. Also at my track day, it did not fall apart or even come loose. Overall, gigantic thumbs up for IRP. This new version of the shifter has solved every problem that I had.  I  and I'm super happy with it. Shout out to IRP for their amazing customer service. But yeah, that's gonna do it for this video. Thank you guys so much for watching. Make sure you guys subscribe. Follow me on Instagram, Snapchat, and Twitter, and I'll see you guys next time.  you"
}