{
  "video_id": "1yIth_rknTo",
  "transcription": " Hey what's going on guys, welcome back to another video. This is a little update video for the Balenciaga Speedrunners. If you remember a while back, that video did really well of my review on these. So I just want to give an update on how they look like after a decent amount of time, let's say about a month straight of wear. Because these are pretty beat now and I just want to show you. So from my understanding, there are two different batch runs of this style of speedrunner.  So I believe mine is the second one because mine wasn't getting like paint cracks and I saw a lot of posts on Facebook groups of their pairs cracking after like the first or second wear and I'm fortunate enough that this one they just started fading not cracking. So I will show you guys some b-roll so you can see closely on how faded my midsoles are and the outsoles as well but that's just from general wear. Also another good thing that's for my pair my actual  Yaga font writing right here isn't isn't peeling off So I remember some people were having a lot of I don't know the be falling off or whatever So look like it fake weird and just not a happy customer. I'm surprisingly Impressed with the upper they haven't stretched as much as I thought they would they actually, you know still hug my foot pretty well considering how much I stretch them when I try to get them on and Take them off. Like I beat these up like I don't even care  Other than that, after a month of straight wear, it's done pretty well. So I will continue to beat these. Don't know if I'll do another update video, but I will show you another on feet video of these, just so you see how they look on my feet beat up, but you might not even tell the difference because they've actually held up pretty well. Let's go.  That wraps it up for the video guys. Thank you for watching. If you have any questions or comments, leave them down below.  Follow me on Instagram, Facebook if I still have that there. Whatever, you know, just chillin'. Hopefully you guys are enjoying these more uploads because I really need to get back into the YouTube game. I've been bloody hassled every day of my life so I'mma get back to you guys. Thank you again and I'll see you on the next video. Peace.  you"
}