{
  "video_id": "29KEdICX5MM",
  "transcription": " Well, hello there ladies Sorry about that guys. I have to say hello to my mom my wife and my sisters, right? The only females watching anyways, I'm in a rental. This is a 2017 2018 I think the 2018 Jeep renegade if you are a new subscriber, thank you. I appreciate it. Thanks for your support  I have more of the what to look for videos coming up soon. Those are very time-consuming videos There's a lot of production that goes into those a lot of research writing the script editing In the meantime, I want to share some my experiences with different vehicles that I either rent or drive or whatever And this is one of those this is the Jeep Renegade Latitude 2018  Pretty interesting vehicle, you know coming into it right right away. It kind of felt like really big like there was a lot of space from you and the windshield So it was a little bit, you know interesting to feel that Also, the cars is full. It's a very quirky vehicle and I'll show you a couple things around One of the interesting things is you know an Easter Egg right on the windshield and a lot of manufacturers are actually  doing that nowadays to actually make money. And you're probably wondering what the hell you're talking about to make money? Why are they spending more money into designing these little logos and these little things to make more money? How is that working? Well, I'll tell you how. When this windshield cracks sometime in the near future, somebody who appreciates the vehicle is not going to want this windshield replaced with an aftermarket windshield. They're going to want the original  manufacturer windshield just to get that little Jeep on the logo that Easter egg and by doing that the manufacturers are then making a profit on selling OEM parts so that's their goal there's a lot of little things if you look at the tachometer there's actually what the red line will be there's there's dirt there's mud there which I thought you know when I first looked at it I thought that the dash was actually damaged and and and scratch or the or the paint faded away  And I have to look you know take a second look and notice that it's actually dirt. I thought that was great That's hilarious how they did that I? Also like the the speaker pods right right on the door panels they actually have the Jeep grille Right on them, which is a great touch I'm having a blast was just looking for different things to find on this on this car Which is it's pretty interesting the wind is absolutely insane today  and it's really, really cold. So that's why I'm doing all the talking from inside and I think I'm gonna stay inside. So let's go for a drive and I'll tell you a little bit more about this car.  Every business exists to make a profit. You have to make money, otherwise you will eventually go out of business. And that almost happened to Dodge, Jeep, Chrysler, the whole company during the great recession of 2008. Shortly after that, that's when Fiat came in and took over Chrysler. I think they bought very cheap from them.  about six billion or so I forget the actual amount but it was a it was pretty cheap and then they started making a lot of changes and in order to make the company profitable again you have to come up with vehicles that people can have you know usability out of it they can you can kind of dilute the brand a little bit but actually make a profit this I think is probably one of those cars inside this does  remind me a lot of the Honda Element or the Mini Cooper just because well not the Mini Cooper in terms of how far the windshield sits away from you it is very boxy and at first when you get in it's kind of weird you feel like wow this is interesting but then you get used to it as you drive it more and more and now I've been driving it for about you know almost a day and I kind of like it  Now driving around town it does feel agile and sporty but as soon as you get on the highway that that That something that makes it feel sporty turns into nervousness at high speeds The interior layout is nice. I wish the the seat had more adjustability Especially at the front part of the seat  Now this is supposed to be exactly the same chassis I believe as the Fiat 500L which that one I drove across Italy for like over 1,200 miles and that was actually surprisingly comfortable. It was a five-speed manual but you know I had a blast with that car and it was fun. We had five people in the car and you know all of our luggage.  and it drove nice.  watching everybody I'll see you in the next video please don't forget to subscribe"
}