{
  "video_id": "2F8K0WQaioo",
  "transcription": " ♪  ♪  So  Now that that's done, let's go back inside and talk, because it's cold. All right. What's going on, guys?  As you know, I did the Ancestry DNA. It's been about six months already. I got my results two days ago, but I did not get a chance to film it until now and I haven't looked at them. So let's go ahead and take a look. Well, before we take a look, my mom said that I am part Native American. She said that for years and sometimes in her skin tone anyway.  I could see it, but I have never really seen any of those characteristics of Native American in me, so we'll see. So let's go ahead and take a look here. Oh wow! I actually don't see it on here. So it says I'm 71% Great Britain. I'm not really surprised because I mean technically everybody that was born  Born and like born and raised and actually from America is from Great Britain's At some point, but I'm kind of surprised to see 71% That's pretty That's pretty high. I wasn't expecting that I'm 13% Europe West Why only the West I guess other parts of Europe are a little different, but That's pretty cool. I am 7% Scandinavian that  I don't know anything about the Scandinavian people though, but it's kind of cool that I'm scattered like I'm from over there as well. I got 5% Ireland, Scotland and Wales. Hmm, so I'm mostly British apparently. Okay, it's got a few low ones. 3% from Finland or Northwest Russia or I don't know.  I guess that's an and and a greater than 1% um now I've got some like migrations and migrated to North Alabama settlers and just southern state settlers from regions all of the above Okay, and then it's got like well migration time here, so My people probably came over here between it looks like 1700 1750 that's actually a pretty small number  I was kind of expecting it to be later than that, not in the 1700s. So there really isn't... Oh, oh, actually, it shows where my people migrated within the United States. So they mostly, it seems like they mostly showed up in North and South Carolina and then just moved into Georgia. I don't have that many relatives in Georgia.  I guess we'll find out but yeah, we kind of like Wow Scattered everywhere at that point It's pretty cool. It says I have it. I have a few matches. It shows that I got two Second cousins. I think that's like what you're the cousin of your parent or something But then they lose me at the third cousin. Holy crap. How many is that? Like one two, three, four, five six, seven eight nine  10 11 12 jeez Look at all the friggin third cousins That's ridiculous fourth cousins Wow, I have no idea who any of these people are Okay. Well, those are my results. I am actually quite surprised that Did not see any Native American in there I'm wondering how far back exactly that goes  or if it wasn't like a big enough thing for it to make a difference, you know, like it was really just one person that married a Native American person and you know, that's not really enough to actually get that in the gene cycle, I would assume. I don't know, I've only taken like one biology class. So don't quote me on that. But yeah guys,  That's gonna be it. I'm gonna leave a link in the description below if you would like to go check this out For me it was only about $80 But I also did get it when they were having like a 20% off sale, so it's about $100 you can pay a little extra if you want to to do the like extended family tree and You know a bunch of other things, but I didn't feel like spending it, but it's definitely worth  it if you want to know more. That said, in the first part of this video I made it clear, in the next part, right now, I will say it again, I am not sponsored by them, this is just something that I wanted to try out. So, that's gonna be it. I'll talk to you guys later.  you"
}