{
  "video_id": "2jDPnGYiVXo",
  "transcription": " Look at these guys. They always have their phones near and super fast access. Guess what helps them? The phone belt clip. No, not those old ones your parents wore. Introducing PlaceOn. Reinvented phone belt clip that provides fast and comfortable access to your phone anywhere. You can only detach the phone by turning it out.  at an angle of 90 degrees. Due to this, Playson will hold your phone in every situation. With Playson, you will forget about bulging pockets, missed calls, broken screens, and phone loss. Playson will solve those problems. Now it's time for the reinvention of smart and comfortable solutions. Fast access outdoors and your own place for your phone indoors. Playson is the best way to keep your phone near.  Please support us on KS and get a place on 4 Your Phone.  I  Eyeglasses over 61% of us wear them every single day Over the years they've adapted from magnifying spectacles to key fashion accessories However, one thing has always remained constant. They're just glasses until now The high temperature for today will be 75 degrees introducing let glass  Turn off the lights.  without having to touch their mobile phone and can customize control settings. How's traffic to my office? The traffic was light, so I'm estimating 23 minutes. Our patented bone conduction technology allows you to hear stereo music without blocking your ears. It transmits music through your bones directly to your inner ear, so you can still hear everything around you. With Letglass, you can hear music and notifications and make  hands-free phone calls. Call Mary. Using the built-in microphone. Hey Mary, I'll be in the office in 15 minutes. Integrated with Amazon Alexa and connectable to Siri Google Voice Assistant from your phone. Play Live Free by Tim White. Let Glass allows you to interact with your home technology wherever you are on the go. I've copied of my grocery list. Okay, I added it. Add items to your grocery list, lock your doors, or set reminders all with a touch of a finger.  At 80 feet, the destination is on your right. Let Glass is designed for people who wear glasses every day, so fashion was a key priority. Each pair of Let Glasses comes in three colors and designs. And while these glasses offer corrective vision that you can rely on, the additional features add value to your daily routine at a level unlike ever before. So change the way you wear glasses. Change the way you live. Get Let Glass now and open your eyes to a whole new world of style and convenience.  Hello everyone, my name is Humberto, I'm from Brooklyn. I'm here today to introduce to you a product that I've been working on for the last past few months and I finally decided to bring it to the market with your support. My product, Shark Tooth Drywall Clip. It's a quick and easy solution for repairing hold in the walls without the use of any tools or any screws. It's perfect for homeowners, renters, do-it-yourselfers, painters, plasterers,  plumbers, electrician and even for the HVAC guys. With my product, now anyone can patch a hole in a wall. It's that simple. Take a look at the video as I illustrate step by step on how simple it is to repair a hole in a wall without any screws or any tools.  amount of pressure to get the piece in place, holding it from falling back. Remember, one clip for every corner. A small amount of plastic compound. Insert, a little bit of pressure, get your piece in place. Now, before you put your new piece of rock in place, again, you apply a small amount of plastic compound on each clip. Plastering compound can be bought at any hardware store, any Home Depot stores.  Put your new piece in place. There you go. Now, an opening has been left around the new piece, an eighth of an inch opening. This way you can apply plastic compound all around the opening. Plastic compound dries hard, dries quick, expands, holding your new piece in place. Patch a hole, no screws, no tools.  You  Hey! It worked!  The outstanding pin pad not only condenses your 10 digit code into 4 buttons, but it also reshuffles after each use. It shuffles the numbers like right after you put it in. Isn't that cool? The Pin Genie Smart Lock makes it virtually impossible for unwelcome visitors to enter your home. After 3 failed attempts to enter your home, the pin pad will be disabled for 1 hour.  If an attempted break-in occurs, Pin Genie Smart Lock's alarm will be triggered. Whether you use the Magic Pin Pad, traditional key, or use your mobile device to unlock your Pin Genie Smart Lock, accessing your home is always convenient.  Clocks are a thing of the past."
}