{
  "video_id": "2mo2OQCFlfY",
  "transcription": " I may get one or two people last minute before the train comes. Usually I got my headphones in and ignore everybody. I watch news a lot or Netflix or yeah. Well, I work for Subway. I manage one store.  I work in two other different stores. I work in three stores total. Anywhere from 50 to 80 hours in about five days. It's Wednesday, I get up, get to work at 5.30, get off around 2, get home around 3, 3.30, hopefully asleep by 5, wake back up at 8 p.m., go back to work by 11, get off at 7, go back to work at 8 in the morning and do the same thing again. Two days in a row.  So I average about six hours sleep in two days. Hectic sometimes. Kids, you can tell that they miss me. They don't see me that often, but now I was working seven days a week. Now I'm working five days a week during the same amount of hours, getting two days at home with the kids. So it's gotten better. Like last two Wednesdays, I've actually lost  the three, four hours sleep, stayed awake with the kids, and stayed awake for 48 hours before I went back to sleep. Just, I come home and they're in a good mood, they wanna play, and it's like... You get used to it. I don't drink much coffee, so that doesn't really work. I do drink some energy drinks every now and then, but other than that, you just get used to it. The only reason that they're able to  offer me that many hours is because they have several different companies. And so one company I do salary of 100 hours and then if I work hard and I get more than the 100 hours I get paid separately and get hourly so it's more of a bonus for me to work more hours. I'd still work the same amount of hours but my checks would definitely, you'd be able to tell. There'd be more money for my family.  more income. Start saving more money so we can move to a one level place because my wife's condition. Get out of the two-story town home we're in. To me it's a challenge. It's always been a challenge. That's why when I did 22 hours I've done like three of those in the last probably month, month and a half. It's just, okay, how far can I push myself? I worked 22 hours, slept for six and then went ahead and did another 16.  Monday I started out working one shift. Tuesday I ended up working I think about 16 hours that day. Then yesterday I ended up going into work, working like nine hours, went home, slept like three hours, came back, worked another nine hours. I have an hour, then I go back and work another eight hours, then go home, sleep three more hours, then do the 16 hour cycle again.  I do it for my kids, because ain't nobody else gonna support them. They don't give me no state assistance or anything like that. It's either I do it or they go without. My kids can't go without food, anything. I don't go to work, then where's the money coming from for the roof over their head?"
}