{
  "video_id": "2nuCU7AeR_o",
  "transcription": " What's good homies, it's your boy K-Spot. You know what I'm saying? Hey yo, I got the homie Mickey Mouse, you know what I'm saying? We just shot a video on the main channel.  Link is in the description but yo It's been a minute a Hot minute since I checked out some kabib videos. You know I'm saying It's been like about two three months Is it's been a while? You know I'm saying so I decided to get back to check out a kabib video today this is a Was the title of this video could be the eagle  Nurmagomedov  I want the UFC UFC videos  I'm looking forward to those. But that's besides the point. Khabib highlights. Skrrr. The dude's a beast though. What was that on his head?  I'll probably get copyrighted for this music, bro. Hmm. Khabib is a really good wrestler, right? Like that's where his strength is at, from what I've heard.  But when it comes to that ground shit, he's a monster. Bruh, getting slammed on the ground like that would've knocked me out, immediately. I would've been out, the fight would've ended right there. That knee would've made me pass out, bruh.  Like I'm not fragile or anything, but if I'm in that ring, I'm fragile see that punch yeah, I'd have woken up next week, bro Look at that knee I'd have been dead I'd die right there It's not that I'm fragile it's just that these niggas are monsters  Nigga ate knuckles, bro What a monster, bro Yeah, uh, right falls on the ground game push like that no, please oh  Nigga damn the fight is over bro, bro that ref ended it too late, bro The nigga ate all kinds of shit to the face, bro I Want to get into fighting Myself, but I'm not doing UFC. I'd rather just do  I'm not saying boxing is easy, because it's definitely not. But UFC is just scary, bro. Look, look, look. Look, out of diet right there. Dead. Gone. Look at that. Look, look, look. Because boxing is just scary, bro.  Fists with those thick-ass gloves You see they got small ass gloves. They be hitting niggas with elbows knees You got submissions broad that shit too scary for me, bro If you do you see I'm messing with you bro, we allies Best friends fucking me  I feel like to be in the UFC you must have been a mean ass dude growing up. You must have had a hard life to be in the UFC.  be the UFC bruh. Boy I'mma hop in that octagon. Smiling and shit. Get the teeth knocked out of my mouth. What's that he has on his head? Is that like his thing or? Let me know. Alright so that was Khabib highlights. Clearly he's a monster. You know what I'm saying. If y'all need  I'll add it to the list  to an hour long video that's that's impossible bro you know I'm saying I can't do that that's why I decided let me check out Khabib highlights instead yeah yeah so yeah recommend fighters don't forget to subscribe February just started I'm like 260 subscribers you know I'm saying let's get 300 subscribers by the end of this month no actually no that's only 40  Subscribers await, let's get through let's get 350 subscribers by the end of this month. You know I'm saying I know we can do that easy You know I'm saying I believe in y'all modify. I'm gonna watch you subscribe right now Don't look at me subscribe hit the subscribe like down there hit the like button while you add it to you know I'm saying Don't forget to comment leave your comments  You know I'm saying let me know who I should react to you know more USC fighters And yeah, I know I said that before more USC fighters More could be videos. I should check out not an hour long video. You know I'm saying I think the longest video I do is like 30 minutes You know saying 30 minutes anyways It's been your boy case, but you know  Ma!"
}