{
  "video_id": "369Dl6q3NUo",
  "transcription": " All righty guys today, oh welcome to the vlog Look how pretty it's about 930 about 915 mountains Sun we are headed out to We'll see when we get there This is gonna be fun. This flea market is really cool. It's big  So we'll see just how it turns out.  around you'll see I'll show you  guys what's the name of this strobe city led accents look if you have a motorcycle or a car and you want lights look at that anything they got the things that you put on your house it's a cool car sells all kinds of memorabilia and car fast and the furious  How much are those $20 that's a good deal actually, you know a lot of vloggers can use those because  He's alone. I'm not alone that much, but he's alone. These places here, this is what we call the dollar boxes. Look, see them? See on the side there where it says $3, $1. Get stuff all day long for dollars. Yeah, see? My wife loves it. She buys these all the time and she keeps them for eons for the prices. Pretty cool. This flea market's really cool.  I will I have found the craziest riding lawnmower You've ever seen are you ready? Richards relics, it's the lawnmower for me This Disney's film star film strip mug Is really cool that I found here do you see?  That's cool, I like that I may come back and get that I'm not sure but it is cool I Was looking at all this cool stuff right here, and I was like man this stuff's cool And then I look up and it's my friend mark right there. He runs this place All these lighters right here  This time it's Really nice somebody need some Volvo wheels and tires Holsters awesomeness look at this guys Somebody needs a pink Sanya Phone okay guys. I'm getting some glasses from right here  five dollars a pair, you buy three pair, you get the fourth pair free. Do you mind if I introduce you? Okay, I have a YouTube channel, people are going to see you. Is that okay? Oh, I will, I'm going to, yeah. K-U-N-T-R-Y chicks. K-U-N-T-R-Y chicks. Okay, this place is called Country Chicks, here they are. Say hi. Hi guys. It's K-U-N-T-R-Y chicks and we're on Facebook. On Facebook, great selection of girls.  glasses they do a secret word they're going to do soon and You guys just need to come here and check it out great selection of glasses very nice ladies Charms sweet and sour do you remember I? Remember these charms pops as being like when you were in school Valentine's Day didn't they sell like charms pops back in the day I don't know if they still do that anymore, but so I've been us  Look at all the stuff you can get. I'm gonna get some of them irritable Has anybody tried the squash? Wonder how much what's going on with the squash Adam? Is that you Adam? Three for a dollar six for a dollar Two for a dollar dollar boxes so you go down And you pick  Or whatever you want hmm Not have any of those there's so much good stuff see Goodness knows goodness knows how much goodness is here look at all that Just box after box then you can go right here and get Candy bars, which I'm about to do somebody left their clothes here  Bring that up front. But really, really cool place. Two for a buck. This is where I'm headed, right here. Protein bars, Cliff bars, Met RX, big 100s back there. Here, look. Power bar, detours. This is what I'm getting for my bike riding. I saw something really cool I wanna see. Look. Look at those big...  dogs, the horsies, big horsies. Look at them. Beautiful ice cream truck, balloon. Okay, that was our trip. Nice rugs right here. But that was our trip to the flea market and they sell all kinds of good stuff here.  I"
}