{
  "video_id": "3HIvIoG-P1s",
  "transcription": " What's up everyone, it's your girl Jae and welcome to Daily Dose, the show where I talk about the hottest topics in K-pop, or today. So let's get straight into the first story. Looks like actress and queen of Instagram, Sulli has got a new man.  On May 10th Sulli's company SM Entertainment confirmed that she's dating director Kim Min Joon stating Director Kim Min Joon and Sulli recently began dating.  Now this is beautiful y'all. I love seeing new relationships being born, people falling in love. But of course y'all, this did not go down without drama. Because upon this news being revealed, people were like, hmm, I wonder what, uh, I wonder how Choiza feels about this. Sully's, uh, ex, ex-boyfriend. Which led to people digging through his Instagram and finding a post that was uploaded on April 2nd that people are now claiming may have insinuated that Sully cheated.  The post in question is a picture of a lamb leg with the caption, which can be translated as, so this is a lamb leg? But the catch is that sentence can also be seen as a slang term for cheating or two-timing. Now if you look at it from a timeline perspective, it was officially announced that Sulli and Choiza broke up on March 6th. And like I said, reports have been saying that Sulli has been dating Kim Min-joon for about two months, which means that they've been dating since sometime around March. So there could have been some overlap over there.  However, while all that is true, it's important to know just because we're finding out about things or we're being told certain things doesn't necessarily mean we're being told the truth and that they happen when they're announced. Just because it was reported that they broke up on March 6th doesn't necessarily mean that they actually broke up on that day. I highly doubt in situations like this companies break the stories as soon as it happens because one, there's a chance they could always get back together and two, it's not really our business. And honestly, I was thinking about it kind of  make sense that the news that they broke up was announced around the same time Sulli and Kim Min-joon, her new boyfriend, got together. Because at that point it would be super super important that they announced that Sulli and Choi Za broke up because if Sulli was seen with her new boyfriend people would automatically assume they were dating. But it's important to note that all this analysis is under the idea that Choi Za's post was indeed hinting at cheating and not just him talking about a thick juicy lamb leg. Either way we'll never really know intimate details  as well as about what went into the two's breakup. All we really can do is assume with the little information we have and I don't feel comfortable with attacking somebody or accusing somebody of something without concrete facts. Moving on. Rookie girl group, Bonus Baby has people shook for all the wrong reasons. So Bonus Baby is a girl group that debuted in January of 2017 and recently have been making headlines for stage outfits that they wore during a performance of their song, If I Become an Adult. Now, it was like,  It was pretty regular. I mean, they weren't really wearing anything outlandish. Oh, yeah, wait, they were wearing bibs. Now, this is more than a situation where people are wondering why these not these not babies are wearing bibs. A lot of people have seen this as their company in the group selling Lolita. Now, for those of you who are wondering what Lolita is, I'm a read it from the dictionary. A young girl who has a very sexual appearance or behaves in a very sexual way. But often when it's  I think it's being talked about with concepts in K-pop I think it's more of the idea of trying to sell obvious youth and really hitting home with the fact that these people are young but also selling sex at the same time So you can see why people are very very concerned Anyway, as much as these bonus baby bibs are weird I don't really think you can call it lolita because I don't really see any sexualization in it Now the fact that you're making people who, like I said, are not toddlers  wearing bibs as the ages of the bonus baby members range from 16 to 20. That's really weird within itself, but I don't think you can really say it's lolita. It just turned out really, really weird. It just, it didn't look cute at all. Like, woo, stylists on these, let's get it together. Come on, let's do this. But overall, this is just a super WTF moment, and moving on. So last but not least, this is a highly requested topic that I wanted to talk about for a long time, and a lot of you were waiting for my opinion,  BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS, BTS,  everywhere we're tweeting different people involved in the show and we finally got a confirmation that they were indeed invited when a fan on Twitter asked the head of Dick Clark Productions, the production company in charge of the Billboard Music Awards, if they were invited and they confirmed they had been. Now after that a couple outlets did report that they were going but a lot of people were holding out for like an official confirmation from Big Hit or Billboard that they were indeed attending and we finally got one when Billboard  The group would be coming and walking the red carpet. This was later then tweeted by Big Hit's official account. So everyone is super super excited. But I was really surprised to see I saw a lot of ARMY who were like expressing their concerns and nervousness over this event, over this whole thing. Like I saw a lot of people saying, you know, I'm so happy that they're getting this opportunity, but I'm really nervous that they might not be well received, that they might not be well received.  might experience racism, that they might be made fun of. A lot of people referencing the incident that happened with girl group EXID and pop culture news outlet TMZ when member Junghwa was mocked for her accent by one of their employees.  And I was like thinking I was like I could see how that was a concern because like America has like this weird Dichotomy where it's a very like open society and you'll see a lot of different things different places But then there's always this side of people who see you know seven Asian boys and think I got a clown them or have like a prejudice against them or just not be open to accepting them because they speak a different language, but I feel like you know don't  let that dampen the fact that this is like a really cool achievement for them and it's going to be a really nice opportunity with every type of exposure there is a chance to get more fans and there's also a chance unfortunately to be hated more but I feel like we should focus on the positive rather than the negative. Okay so now um this is a part of the video where we're gonna get real um for the stylist nunas that are in charge of styling them for this event um  I don't want to see no coconuts. Coconuts are for trees, not for heads. Okay, let's um, let's let those four heads breathe. All right? Just a little. No coconuts. Promise? Pinky promise.  Do you think there's a chance that Tully cheated on Toysa?  at the BBMAs. Are you a little nervous or apprehensive of what might go down? Make sure to let me know below. And as always guys, if you like the video, make sure to like the video. If you love the video, make sure to share the video. That's it for today and see you next time on Daily Dose. Bye!  you"
}