{
  "video_id": "3iVPx4lsw_0",
  "transcription": " Catherine Walters here from the Purple Raven Boutique. This morning I want to show you what we consider to be a basic wire working skill and that's making the wire wrapped loop. So for demonstration purposes here this morning I've got two pieces of 20 gauge copper wire. To make a wire wrapped loop  You start by making a 90 degree bend in your wire so you can grab your wire with your chain nose pliers and push it away from you. So now you've created a 90 degree bend as you can see. Then taking your round nose or mandrel pliers, you want to grab the wire as close to the bend as you can. Once you've got it in the plier,  Using your non-dominant hand and your index finger push the wire all the way around the plier till it runs into the piece that's hanging down below. Now you reposition your plier by flipping them up, grabbing a hold again, and then you continue the wrap till the wire is sticking out the other side like so. Now the key to making a wire wrapped loop neatly is to ensure that the  loop is centered right over the lower wire. So we'll reposition the pliers again and just give it a little gentle tweak. Grab it like this, pull the wire down a little bit to recreate your 90 degree angle. Now we're halfway there. This 90 degree angle is important because it helps you make a much neater wrap.  To make the wrap without distorting your loop, you need to hold your loop in the chain nose pliers like so and using your non-dominant hand and your index finger, start to wrap. Now you'll notice I've seated that first wrap right at the bottom of the loop and that's where you want to begin. And I'm going to come around again and I tend to favor three wraps. So I'll come around again  till the wire is sticking out the other side. Now I'm ready to come in with my cutters and I want to get in as close to that as I can. And now I've got a little tiny end sticking out right here. So grasp the loop  And use your chain nose pliers to push that in Well, there you have it you have created a wire wrapped loop with a nice neat wrap This is a basic I guess building block skill that you need as a wire worker or if you're going to do Viking wire knitting because you need this skill to help finish your knitting so by all means get yourself wire and practice practice practice  practice because practice does make perfect. You'll get a sense of where you need to grasp your wire and how far down or how much wire you need to do a neat wrap. Now I obviously have more there than I need but that's partly to make it easier for you folks to see what I'm doing as the tail sticks out. And I'm going to do another wrap.  and I'm going to turn this off again. Now, you've created two wire wrapped loops. One of the things I will point out is that wherever you've grabbed your wire with your pliers, by all means do so gently because dead soft metal,  Frequently what is used when you're wire knitting and when you're doing wire work generally speaking will mar easily so it helps to take a look at your To take a look at where you've grabbed it with the pliers and if necessary Look for flea bites along the top edges And along the flat part here, but all it usually takes  is a few passes with some sandpaper and you're good to go. Anyway that's wire working 101 how to make a wire wrap loop. Catherine Walter signing off."
}