{
  "video_id": "3RIylbiEDsU",
  "transcription": " Hello and welcome to Special Report. The world is a circus, it is said. Today we trapeze into the life of people for whom the circus is their world. Who are walking the tightrope, constantly living on the edge because the show must go on.  In the men's tent, Antony and Suresh have just enough time for a last game before they get ready for the show. Like everyone else here, life is measured from one performance to the next one, one location to the other. Once every few months, they get to go home to their families.  and you say that nothing will happen today. I feel that kind of fear. When we go to the theatre, we pray to God that nothing like this should happen.  Shambhala continues their legacy as an accomplished acrobat and flying trapeze artist. Shambhala entered the circus as a 5 year old through an agent from a village in Kerala. Those days, 25 years ago, if a circus agent came to a village asking for 5 girls, he would get 50.  conditions and other options, there are few takers for a job that involves a lot of travel, risk and hard work. Others say the stigma associated with girls in the circus and rumours of being sexually abused by employers has kept away new recruits. We meet Shyamala the next day at her living quarters in the circus camp.  husband Raghavpady Gupta, who plays one of the clowns, is from a village near Gorakhpur in Uttar Pradesh. They met in the circus. The couple doesn't want their 4-year-old daughter Vaishnavi to become a circus artist and are looking for a boarding school to admit her.  Raghav came to Delhi looking for a job to support himself, his mother and sister when he ended up watching a circus show. That was over 30 years ago.  There are challenges and difficulties in that too. If the public doesn't laugh at the Joker, then there is no point in him going in.  The only legacy left is his 58-year-old cycle. Antony hopes his children will not have to ride the same cycle to make a living.  I am not studying."
}