{
  "video_id": "498OYClQe-8",
  "transcription": " Winner of our first The Audit Innovation Challenge is... The Audit Innovation Campus Challenge is a challenge we pose to students to really demonstrate what their understanding of audit is as well as audit analytics and how they vision the audit of the future. The Audit Innovation Challenge originally was very challenging  for us as a group because we knew nothing about audits but with the help of everyone from Deloitte and our faculty advisors we came together with a great idea and it's been a wonderful experience for everyone involved. And I think it opened up all of our eyes and even made considered it as a potential career. Students came in and had great ideas some things that we even never thought about. It feels really great. This is something that we've been working on really diligently for the past few weeks and it was a great chance to be able to share that idea with the judges. My favorite part of today was really listening to the students and their passion  for what they were talking about. Having two of my passions, business and technology, come together, it was something that I could only dream of and I'm really glad that I was a part of it. Definitely what most impressed me is that a lot of these students were underclassmen and it was great to see that students were really helping to lay out a roadmap for their own future when they come into public accounting and being auditors. We found the recent graduate panel very informative. It was cool to hear their experiences and why they enjoy working here.  so much. It got me excited. We got to meet some amazing students that will hopefully join us on this journey to innovate the audit. Like for me personally, it's just a really just unique way to see what the future of my career path is going to be like. I'm so excited for these new folks are going to be joining our firm and helping us to innovate and evolve us to the next step and next generation of what an audit can be. It's just fantastic. I'm excited about the audit of the future and I think we're in good hands with the talent of tomorrow. I think the audit of the future is going to be awesome. You have a very long road ahead of you  keep the momentum, keep your passion, most importantly that's why you're here and that's something that's in your heart and will never go away. So the runner-up today, University of Connecticut. The overall winner is Baruch College.  you"
}