{
  "video_id": "4hpYqQRepp4",
  "transcription": " When Melissa Wicks was looking to substitute in an early childhood center, she already had a place in mind. Here is the Early Childhood Center in Castle Rock, Colorado, where Melissa's children spent their preschool days.  So we live a good 10, 15 minutes away. But I wasn't going to send her to my home school because I knew this is where she needed to be. Wow, it sounds like your garden's a garden to me then. And here, as it turned out, was the same woman who inspired her daughter to learn and inspired Melissa to get into this line of work. But watching her work, which she's a special education assistant with Spec Ed, has actually motivated me to look for a full time job.  but to specialize in that because she's so personal with the kids. It worked! Dee St. John has been a staple in Douglas County early education for more than 20 years. And in that time, she's become a well-known commodity with many DCSD families. Over the last 10 years, I have a 13-year-old, a 10-year-old, an 8-year-old, and a 3-year-old. And they've all had Miss Dee. It's all been fantastic. She's a steady, very, very, I like to say that she's a zen sort of teacher.  Dee works with severe needs kids at the center and part of what makes her so special is her ability to reach students that may not always communicate by traditional means. You know what's interesting is even though they may not speak or do a lot of things they know who you are and I really feel that it's the the feeling that they might get from you is where you get the connection.  and bringing them into the fold in a classroom isn't something just anyone can do. And her team is quick to let you know why she's good at it. She's really the embodiment of wisdom, kindness, and generosity, and the humor piece. Really, everyone needs a D on their team. Is that your favorite color? No. Is that your mom's favorite color? Yeah. I thought so. Pink. And of course, a little patience doesn't hurt either. Yeah, I hear that all the time.  and I don't know if I have that or I've developed it. I know, look it swings, zippy. Dee says enjoying the work for so long hasn't been difficult, especially when your day involves. You get to sing, you get to dance, you get to be silly, you get to paint, you get to play, you know, you get to do all those things and I don't think you can do that in a lot of jobs. Her peers and the parents she serves just hopes that she sticks around for another 20 years of continued inspiration for our kids and our employees.  here in Douglas County.  Thanks for watching!  you"
}