{
  "video_id": "55Ijvvme2kg",
  "transcription": " Hello and welcome to another feature story here on Electric TV, your online source for what's happening in the electrical industry, sponsored by the NECA IBEW team. As always, I'm your host, Dominic Girotano. It's certainly true that no one really pays much attention at all to the electricity that powers our cities, towns, and neighborhoods. That is, until it goes out. And it's also true that no one really pays much attention to the electricity that powers our cities, towns, and neighborhoods. That is, until it goes out.  that it stays on the vast majority of the time, thanks in large part to the efforts of the line men and women of the IBEW, who along with their NECA employers, are the best in the world at what they do, and training is at the heart of that effort. With that in mind, let's check in on the 44th annual Outside Line Conference recently held in Fort Myers, Florida.  with new technologies, new techniques. We have to find a way to collaboratively work together because one area has already solved the problem, another area is going to have to address next week to save time. We're so far flung in the outs, particularly in the outside. We're all over the country, all over Canada. And it's meetings like this that kind of bring the camaraderie back together. And we talk about common issues and specific issues in areas where we need to know what everybody else is doing.  The team's answer to this situation, as it has been for generations, is developing a standardized training curriculum. As the industry changes, so too does the material that is taught to the men and women of the trade. On the agenda for this year's meeting was a new rigging textbook for linemen, an updated textbook on personal protective grounding, materials concerning medium voltage cable splicing, and the soon to be implemented crane certification course.  is just changing it at such a fast rate. And that's one of our biggest challenges, to stay on top of it, to make sure all of our members, the people that use our curriculum, have the most up-to-date material possible so they can be more productive out on the job. We're spending over $100 million a year in training in this industry, and it's all supported. No government funds are involved. This is all done within the industry. So we're not out there looking for the handouts. We're out there taking care of our own. While training was a major agenda item at this year's  conference was by no means the only one. The necessity of growing the number of skilled IBEW journeymen and apprentices also shared the spotlight. That amount of work in the years ahead and bringing in the people that will be needed to do it is a front burner priority. We've got a lot of work and not enough people to do the work. So we've got to organize and when we organize, we organize people at different levels. Not just apprentices getting in our program,  do we have to train? We have organized workers coming into our industry. Those industries that may have several thousand hours on the job experience outside industry or inside industry want to come into our industry and we have to find a pathway to get them incorporated into our apprenticeship training model. Growing a larger workforce, training a more highly skilled workforce, both central to this year's conference. Whatever training is the subject of the NECA IBEW difference, safety  safety is item number one. Being safe is an easy thing to say, but there are also advancements in keeping our workers safe during their routine day-to-day duties. There's been a lot of change in technology, OSHA standards and equipment. And to hand a guy a box load of equipment that he's never seen before can be challenging at best. So what we do is we show up on the job site, we show up at the JTCs, and we provide training  You can consider product orientation to get these guys up and running to keep it so it's not such an intimidating process when they're handed a bunch of gear, trying to keep it simple. State of the art training, growing the workforce and industry support. It's the combination that keeps the NECA IBEW team as the best choice for the customer. And the evidence is easy to see. At a conference like this, you see it firsthand. You see it real time. We are working at this every day, every hour, all the time. And you meet the people that are active.  both from the industry side and then also those on the inside that are doing the training and developing the curriculum and all that, and you get an opportunity to see it live and in action. We have to sell our product and that's what we're doing. We have the qualified people, we have the education process, and we can produce a skilled workforce. That's the one nice thing about standardized curriculum and training is that the person that's trained in Washington, D.C.  in Baltimore, Maryland and happens to be working out in Denver, Colorado, you know exactly what this person is capable of doing, what he's been trained in. And so the customer, no matter where they're at, when they go through and use an IBEW NECA contractor, that they're going to get the best skilled, the best trained individuals possible. In any organization, it's the individual that makes up the team. And in electrical construction, the best team is NECA and the IBEW. Thanks for tuning in to this edition of Life's Biggest Questions.  For some behind the scenes extras and more, see you next time."
}