{
  "video_id": "5_LRMz5WxUk",
  "transcription": " What is up YouTube? Killa Kam back on the side of the R6 and we got handed a beautiful day today 75 degrees the jacket is not coming on Florida boy needs this beautiful weather I'm excited to tell you guys that the R6 will not look the same Coming next video. I ordered some parts  Hopefully they all fit correctly. I'm very excited to see what happens. She's going to get a new front tire because right now she is all over the place in the turns. I have this one flat spot on the left side. I'm glad it's not raining because it basically turns into a track slick. But other than that, she's not happy with this front tire. Parts are coming and I still want to do that exhaust mod. I need to go get an estimate for that. So let's go ride, man. Excited.  The majority of you guys should know this but I decided to keep her just a little bit longer I still have some mods planned. I'm really excited for these parts to come. I think you really are going to enjoy her So we'll see. I'm still excited. What a limo How you doing? Actually probably going to get my sweat on today to be able to sweat again on the  sport bike I didn't think I'd be asking for that this soon but I'm not complaining about it leave it down in the comments what mods you think I've ordered and what mods you want to see on this bike because he's sticking around for a little bit I'm excited to say that I still had that thousand CC debate in my head but I'm gonna push it back just a little bit longer and see what happens with this bike for those of you that don't know the importance of a newer front  tire come ride this bike and you'll be able to tell the difference instantly. That CBR review I did I think that's what I was really enjoying was that new front tire that yeah those tires were like brand new barely even used so compared to my one in the front I think I think my front is way older in my back because when I did the second time I didn't get the set I just did one at a time because the rear went out before the front did. Your fronts normally last a little bit longer than the rear so  This front's been here for probably I'm gonna say at least 10,000 miles And it did it did well Now it's just time to go time to move on time to upgrade and it's she's gonna look bad with Michelin Pilot Road fours everywhere I appreciate the road three in the front right now Road four in the rear You never want your tires to slip out obviously while you're on a motorcycle since you only have two and if you lose one you're almost guaranteed to fail but you especially  don't want your front one to slip out so if it was raining and I was leaning left on that bald spot and the front gives out I don't even think you can save the front sliding out if you're actually at a lean I know the rear the rear can actually get traction back up but the front that momentum in the force the weight behind it you lose the front you're on the ground Yamaha R6 first speed trap  Didn't even pick me up. That was anti-climatic. You know those moments when you ride a sport bike and you make the block hot? I'm pretty sure back there this old lady was already on her phone. So I'm not coming back this way. I'm on my way home. It's one of those times where you probably need to get off this road, but you're stuck behind a CR-V and you gotta do this.  Always gotta get that tunnel time in. Tunnel time daily in the hundreds.  neon yellow sport bike as soon as someone calls you in at least out of blue in every Yamaha R6 is basically blue that's sarcasm by the way but you know what I mean there's a lot more blue sport bikes than there is neon yellow so if I had a neon yellow one back there FHP would be on me in probably about two seconds as you guys know you do not want to mess with Florida Highway Patrol my bike's so dirty man as soon as I put these parts  on she's getting a wax down a spit shine can't wait for it well I just want to say thank you guys for watching make sure you hit that subscribe button if you guys are newer add killacam r6 on Instagram killacam on Facebook hopefully you guys enjoy the rest of your day she will look good my next video hopefully you guys take it easy killacam out  you"
}