{
  "video_id": "5WTOiYp-uPM",
  "transcription": " Oh, no. No, it's dark down there! It's dark, you mantel!  businesses of yesteryear. Not anymore. Walmart moves into town, competitively prices things way too low, and crushes competition. Found a bar. How about this you big turkey? Nice cock, Corby. This is a great pillow for like next to the fucking bunk and the wall. Where is it at? $12.88? Bitch, this is mine. My pillow. These are my favorite kind of underwear.  They're all I wear and the only place that sells them is Walmart. And when you're at Walmart and you look at the prices and you think, wow, how did this get so cheap? Remember, if you didn't pay for it, somebody did. Probably with their life. You know what, Alaska? You make me feel lower than a rattlesnake's asshole. I love it. I'm getting it. There's a whole bunch of sheet in this aisle. Twin.  How do you describe how small our beds are? What size bed is that? You're gonna be too big anyway, no matter what you got. These colors are transcending. Wow. Shall we go to the beauty department? So we can look more beautiful? I don't think that's possible. Oh my god, look! We're friends! Because mom lied. Friend! Right? Flexing our mom. I appreciate that. He's 5'8 tall.  I love that you booked this gig. I don't do the dark hats. Courtney, it's time for home firm. That's so Aussie. Did you know that Aussie is not Australian? Do you feel like you've been sold a lie?  First degree.  Right for the plug-in oh my god  Nothing.  Aww. You can only put this on two hours because it's a culture, not a costume. And the hat also comes with a matching outfit. Wigs by Vanity are shook right now. They're shook. And it fits in this tiny bag. There's gotta be two wefts in this wig. How'd that purchase? Got my Bilby mask. It went very well. Yeah. I'm not usually that girl. However, I don't know what happened over the course of the evening, but my  like underwear that I have on right now need to be like thrown out. Like they're injured. Did you shit your pants as well? I've never had that happen before. Is that poop in them? What's in them? Go to Onlyfans.com if you want to see more of this conversation. Thanks for watching this episode of the Kawaii Ni Chronicles.  Comment below and let me know. Dread count? At least ten. Welcome back to the Bilby Chronicles. Watch now as the Bilby, in its traditional environment, morrows to create a nest for its family. Night.  Hide your dick in the sun"
}