{
  "video_id": "6bElihFrX9A",
  "transcription": " Hey everybody! Today I am heading down to the Lower East Side, specifically some place that I've wanted to go to for a very long time and that's the Tenement Museum. In case you aren't familiar with what a tenement is, tenements were a specific style of apartment building that were really popular during the immigration boom, the mid-1800s.  the 1900s through the turn of the century. Basically, they would take a normal apartment building, usually down here on the Lower East Side, and divide the rooms into four or five, and fit whole families or multiple families into those tiny, tiny rooms. There were horrible living conditions. That's where the word slumlord came from, the landlords of these buildings, and they were just, they were not good places. But they're a huge part of our history, specifically here in New York City. Down here on the Lower East Side, in the heart  where these tenements were, they've taken one of these old tenement buildings and basically recreated what existed back during this boom of immigration.  So that tour as I mentioned was specifically about the Moore family an Irish family that lived there from 1868 to 1869 But the cool thing about that museum is that they on each floor have stories  about different families that lived there at different times that were from different countries and they tell you the story about that family, how they lived, where they moved from and where they moved to. It's very cool. So the one important thing to know about that is that those tours are limited. They're about an hour each and they're limited each day. So check their website, check out, see which tour you want to take and make sure you buy tickets ahead of time because they do sell out. In the spirit of immigration and people from other countries, let's check out this Greek Jewish festival.  I love how you can just wander around on the weekend and stumble upon those little street festivals. Some of them very specific like that. So cool.  I knew that bike polo existed but I had never seen it played before. That was awesome. To finish off today's video I came to another place I've been meaning to go for a long time. Just a few blocks north of where we are.  were it's the Elizabeth Street Sculpture Garden. It's a beautiful garden between Elizabeth Street and Mott Street that's just filled with these amazing old sculptures.  I think it was pretty good if I do say so myself. If you're curious about the Tenement Museum, if you want more information, I've left a link to the website down below where you can check it out. And also information about Elizabeth Street Sculpture Garden and the other places I visited today. Thank you as always very much for watching. If you're not subscribed yet, please consider subscribing by clicking or tapping in the middle of the screen. And if you want to check out yesterday's vlog, you can click or tap there. And once it's uploaded, you can click or tap there to watch tomorrow's vlog.  I'll see you next video. Bye."
}