{
  "video_id": "6NBjm9jQVHI",
  "transcription": " Hey Church, it is good to check back in with you. We have come to Corinth today, Athens tomorrow.  We're leaving tomorrow, Corinth today, our last two days. The first part of our trip, cold, a little bit rainy, and now we are being blessed having departed the cruise ship this morning. We are blessed with a beautiful day. It's in the 60's. We're just finishing up under a little tree here in the Corinthian Agora, the marketplace, the open space. And we've had our teaching there in the book of Acts,  Paul's visit to Corinth, Priscilla and Aquila, him working here in this location as a tent maker sharing the good news of Jesus Christ with the Corinthians and also in the synagogues. And so we are here. The group is encouraged. We apologize for not getting more video to you because the internet has been very spotty for us. And on the cruise ship we didn't have any internet access.  We're going to take a couple of hours to get a lot more video uploaded to you. We'll be giving you this video from Corinth and then maybe some video later on today from Athens. And then of course tomorrow will be our day to visit Athens. So, you know, what to say about this? I think the truth that the Lord reminded us of was that Paul told the Corinthians that there's no other foundation that can be laid except that which has been laid by Him which is Christ Jesus.  around at a city that had been destroyed a number of times in a number of different ways. And yet as they uncover things, they find the foundation still in place. And so I don't know about your life. We challenged our group here. Maybe in your life there's some things that have become broken, have been torn apart, torn down. I pray that you have a foundation that maybe you can start building again on and that foundation  That would be Jesus Christ. After all, what other foundation can you really build on? What else is there that can give stability to a life? We don't want to build on shifting sand, but really on a solid foundation to undergird everything else we do in our lives. And that foundation that is unshakable, that is certain and true, is Jesus Christ. So, with the Acrocorinth, the old Temple of Aphrodite over, actually in front of me, which you can't see now because the sun is there,  snow-capped mountains of southern Greece in the background. I'm going to say goodbye from ancient Corinth and we'll check back in with you later."
}