{
  "video_id": "6toId2MsGrI",
  "transcription": " Hey y'all so I'm back at it again with another video with POPPIN WITH GUCCI So today as you guys can see by the title I'm going to be doing the no volume musical.ly challenge So no one did this challenge before on YouTube except for my one person Sofia my one cousin Sofia Borno So she's right there Sofia Borno over here She says no stealing and if you search it up by yourself you take your sweet time to look no  I'm basically going to be the second one to do this.  So also, I'm giving her her credits. Sophia Borno, go subscribe. I'm giving her her credits because she says no stealing. And if you steal, she has permission to delete it because if you guys don't know, if you're the first person to invent a YouTube video and if someone doesn't give you your credit, you can delete it. But she sometimes steals my videos. She doesn't give me credit because a lot of people do it already.  So I think you guys are wondering why you still up at this time. I don't know why I'm not tired So first basically all you do is go on musically Go on musically And that's I'm doing the slow-mo and if you don't know what this is is basically me turning my value volume all the way down and Doing the musically basically so I have three tries to do it without sound and  and I have like I need to show you guys an example of of it with volume up and usually guys an example of like how it's supposed to look like with the volume turned up so I'm doing this sound so I already tried it and it turned out horribly wrong so let's see how it turns  I love this bag. So basically I'm just turning my volume all the way down and doing it. I have three tries. Okay, let's go. I hate this phone.  No, so annoying Now I just basically ruined it  So that was bad. I have two more tries y'all  Even if that seemed good to you guys, you know, I still have too much fries. I could do better. So turn my volume all the way down.  So I'll put that one private so my last try So put the volume low  I don't know what I just did but...  So All three of those were horrible, but the one that I like I think was the second one I think like that was the best one But now I'm gonna be showing you guys it with Out shaking and not volume So this I'm gonna show you guys how it's supposed to be  I hate this phone. It's so annoying. I hate when that happens  I  So I'll put that private because I don't really like it as much but that's basically it for this video y'all I hope you guys enjoyed it The no volume music video and I am trying to hurry up to post this thing before I meet a third person to do it so peace y'all"
}