{
  "video_id": "6TxSg4vsFFY",
  "transcription": " Star Wars The Last Jedi has finally touched down in cinemas to the delight of millions of fans across the world. But did you know that the history of Star Wars actually goes way back to the very first film in 1977, when lots of your parents probably weren't even born?  Over the last four decades, Star Wars has grown into one of the world's most popular and celebrated film series. But how did it all begin? The story of Star Wars began a long time ago, with a man called George Lucas, the creator of the epic saga series. The very first Star Wars, later retitled Star Wars Episode IV A New Hope, opened in just 32 cinemas in America in May 1977. It quickly became a pop culture hit.  The film launched the careers of Hollywood A-listers Mark Hamill, Harrison Ford and the late Carrie Fisher. It had become such a success following its American release that by December 1977, when the film arrived in UK cinemas, people queued for hours outside cinemas just to watch it on release day. It cost around £8 million to make the first Star Wars film, which is a very low budget by Hollywood standards, and it went on to make hundreds of millions of dollars.  of pounds. Safe to say, its success is pretty out of this world. It's actually one of America's highest grossing films of all time, alongside Gone With The Wind and Avatar. George Lucas went on to release two sequels, The Empire Strikes Back in 1980 and The Return of the Jedi in 1983. Both took the world by storm. Over the next two decades or so, Star Wars' popularity only grew.  The first trilogy, now considered one of the biggest film trilogies of all time, spawned new generations of fans, toys, merchandise, games, you name it. Fun fact, Chewbacca even won a Lifetime Achievement Award at the MTV Movie Awards in 1997. Well deserved if you ask us. In 1993, the world found out that George Lucas would be releasing Star Wars prequels, which were stories set before the original trilogy.  In 1999, fans new and old were introduced to The Phantom Menace, the first film in the prequel trilogy. The film introduced a new generation of stars to film audiences, including Ewan McGregor, Liam Neeson and Natalie Portman. In 2002 came Attack of the Clones, starring a young Hayden Christensen, followed by Revenge of the Sith in 2005. Although the films did pretty well at the box office, and we're talking hundreds of millions of pounds here,  generally they were criticized by both critics and fans alike. Fast forward to 2012 and Star Wars is reborn once again. A smallish company by the name of Disney, you may have heard of them, bought the rights to Star Wars from 20th Century Fox for 4.06 billion dollars. That's 3.04 billion pounds! They had big plans for the brand. You'll see what we mean if you  you go to any Disneyland park in the near distant future. Now, this should all begin to sound a bit more familiar. At the end of 2015, Disney released the seventh episode in the film series, The Force Awakens. Buzz around the film was huge. In fact, it was one of the biggest talking points of 2015. The film was directed by legendary Hollywood director J.J. Abrams and starred many of the actors made famous by the 1970s  originals, like Harrison Ford and Carrie Fisher, a recipe for the film's success in the end. Now Star Wars is back, and Britain, let's face it, the galaxy is abuzz with Jedi fever once again. The Last Jedi stars many of the same faces introduced in The Force Awakens, including Daisy Ridley and John Boyega. It also features some of Carrie Fisher's last filmed scenes as an actress. Carrie sadly died at the end of 2016.  Today, Star Wars is a multi-billion dollar media brand. In fact, it's the second highest grossing media franchise in the world, just behind Pokemon. Apart from a third film in this trilogy, set for release in December 2019, there are a bunch of other film and television spin-offs in the works, like a Han Solo spin-off film called Solo, A Star Wars Story, which comes out next year.  historical trip down a galactic memory lane, we think it's fair to say that the skies are very much the limit for the future of Star Wars."
}