{
  "video_id": "78FcjhTSeXY",
  "transcription": " I'm kind of a big deal Now this video is gonna be interesting in many ways because it's a duo of fragrance video But it's not a clone. What? Yeah, I know so when I first started getting duo shit back Maybe three years ago. They did original blends and they did clones, but mostly clones the original blends I guess didn't take off or they were still finding themselves  Who fucking knows they started dropping original blends again, and I'm like you do clones dope Can you do original blends dope let's roll my motherfucking music and find out cuz today's video is an original blend  I know, I'm confused as fuck too. What's more confusing is how this fragrance made me feel when I wore it. I went into this original blend with a complete closed mind. Because you do clones dope. We all know that the Dua fans know what time it is. The ones who hate, hate and it is what it is. In this particular case, I haven't smelled an original blend in like three years. So I'm like, mmm. And the fragrance that they send me is none other than Dua's original creation, Soulmate. This isn't the first time I've worn this fragrance.  This is actually the third time I've worn this fragrance and the dual power is still there. But this is such an interesting fragrance. I'm going to start off by saying this is not a mass appealing fragrance. This isn't a super crowd pleasing fragrance. However, for the snobby crowd or for the eclectic crowd that like different shit, this might really interest you. This wasn't one that I just smelled and I was like, Oh, creamy all over the face, pearl necklace.  But what it did have me do, and I counted after a certain amount of times, I smelled my arm and hand 25 times throughout the day because it kept changing and I kept finding different nuances and levels and just different interesting factors that just had me confused and intrigued and just all these fucking emotions that made me feel kind of bipolar and wanted to talk to a therapist and take a pill. So let's start off by reading the notes on this shit because even those notes are interesting.  Talking about coffee, tiramisu, Cuban tobacco, you smart because you know I was going to get my hands on it so I give anything Cuban props, right? Whipped cream, okay. Turkish rose, patchouli, caramel or carmel, whatever, and smoke. For me it has some very minor resemblances. Salvatore Fatigama-Walma, tiramisu, and Juliette et Cigarette from Etat Libre de Orange. The smoke here is the superstar.  Unfortunately, it smells like a tiramisu cake that's in a glass colander that you took a big hit of a nice, good Cuban cigar and you shotgun that smoke into the glass colander of the tiramisu and closed it shut. The smoke here is super prominent and it's really the star. It may throw some people off. Some people may be like, yo, this is kind of cigarette or cigar-ish, but the tiramisu sweetness and that whipped cream vanilla really shines. You have a top-heavy smoke.  Drizzled by coffee on top of the tiramisu with the whipped cream vanilla in that glass colander with the smoke wrapped around it and the base is just sitting on a plate of patchouli. That's what I'm getting from this. The rose isn't too crazy for me. What really stands out is the tiramisu, coffee, whipped cream and the Cuban tobacco with the smoke essence. It's just so interesting, but again, if you don't like a really smoky fragrance or you've never encountered a smoky fragrance, this might not be something that may turn you on.  I think they did a bang up job with creativity. This is very avant-garde-ish. This is something like the Met. You know what I'm saying? That there's some pieces of art that are straightforward and to the point and you get it. There's some that are just Warsaw test, that are just blots of shit all over the place, but some people interpret it some type of way. This is that kind of fragrance. I want to give this a full ball spray just based on creativity and you taking that extra step, maybe to pull away from the clone for a little bit and just make something creative.  of your own. I'm getting that factor of wanting to smell it again. It's a very, very unique, interesting fragrance. Doesn't smell like anything that I have in my stash. The combinations do work together, but there's some notes that stand out more than another. This is a full ball spray for me, and my balls are gonna smell a little fucking smoky. If you're looking for finally something creative, different, a little unique, maybe weird, this might be something you fuck with. I'm really interested in wearing this fragrance, and I haven't had wifey tell me she hates it. On the contrary, she was like,  Interesting and I'm like that's the shit that I've been saying all day. I like it. I really fucking like this shit So full ball spray it is people smoke vanilla tiramisu sweet That's what I'm getting right now. Oh, it's just it's really weird in a cool way. I like this fragrance I hope do it does more original creations because if this is the route that you're going with as far as creativity is concerned and Maybe you're on to something. I don't know. I love y'all motherfuckers from the heart I don't know how balls are you are to try something different  that isn't a clone that you don't know what to expect, it's up to you. But Soulmate is kinda crazy. I'll see y'all bitches next time. You know who it is, it's the biggest in the fucking game. Smooches.  Tell em, who am I?"
}