{
  "video_id": "8cv_g1oYF3M",
  "transcription": " Hey guys, I was in Porter Ranch, California earlier today and I found the Metallic Megaforce Rangers. Also got a Metallic Red Ranger, as well as regular Robo Knight. Here's a better look at the Rangers.  so  Haven't found any evil space aliens yet. How about you guys? I did find Leatherhead though, for Ninja Turtles. He could do a really bad fight with Red Ranger and Robo Knight. Who will win? I got you now, Red Ranger.  I'm gonna get you Red Ranger! I am Mega Robo Knight and I'm mega angry at what you mega did to Mega Red Ranger Mega! Stop saying Mega! That's a Mega no can do! Mega villain! Mega take blast Mega! Thanks Robo Knight! I'll take it from here! Power sword! Alright! And now the finisher!  You got me. Yeah!  I'm  You need plaster strips, plaster. Nobody taught me how to do this. I just figure it out as I go along. So there's probably any number of other ways you could do this. This is just how I do it. And as I go along, I kind of figure things out. I had been using a foam knife, a hot knife, to cut the foam. But this time, I just used scissors because I couldn't stand the fumes. And the scissors do a pretty good job. And usually, I just put the plaster directly on the foam that I keep in my bag.  place using pins but this time I used a hot glue gun to keep the foam together. That worked really well. So I'm just using a box cutter to carve the foam and scissors to cut it and my fingers to peel things away and kind of sculpt the foam.  So for my SPD set, I kind of wanted to make really pointy, jagged rocks like you sometimes see in the Sentai commercials.  I'm working on Ninja Storm. I want to have each power sphere sitting on a cliff or a ledge or something. It's going to be a mountain, sort of.  So I guess I'm making Power Sphere Mountain here.  So once I'm done with that, then we go into the bathroom for the slightly messier part. These are the plaster strips. These are very easy to use. You just cut the strip to the size you need it, you put it in a tray of water, and once it's wet, you can apply it.  Just use your fingers to kind of smooth it out and mold it, shape it. So this is step one with the plaster. Once the strips are dry, then I have to go outside for the next step and actually use the powdered plaster and use rock molds or make my own rocks and make it look more like, you know, make the scenery look nicer.  Alright, I'm gonna end here. Hope you guys enjoyed my making of. All the materials I used come from Home Depot, Lowe's, Orchard Supply Hardware, Michael's, the craft store, you know, stuff like that. It's a huge pain, it's really messy, it's very expensive, but it looks really good once it's done. Alright, it's my bedtime. Thank you guys for watching, and I'll see you again soon.  in my next video. Good night."
}