{
  "video_id": "8ujblRmdlUc",
  "transcription": " Hey y'all this is Jaimie, welcome back to my channel and welcome back to another tutorial Tuesday. Now this is where every Tuesday I do a new tutorial using an eyeshadow palette that I already have in my collection. So today I am going to be creating a look using the Colourpop I Love Sade through my eyes eyeshadow palette. But before we get into that make sure that you subscribe to my channel and hit that thumbs up button if you like Tutorial Tuesday. So without further ado, let's go ahead and get into it.  be  I did go ahead and do the rest of my makeup. I am familiar with this palette and I know it doesn't really have any fallout. But if you're ever using a palette for the first time or if it's a palette that you know is going to have fallout, I would definitely recommend doing your eyes first and then moving on to the rest of the face. To prep my eyes, I'm going to be using the Femme Couture Get Covered Maximum Coverage Concealer. I tried this out in my full face of Sally Beauty makeup and it was a little too light to be used as an under eye concealer. But I actually really like to use it  using it as an eyeshadow primer. Alright, so then to set my concealer, I'm going to go ahead into the ColourPop palette and I'm going to use the shade In A Wink right here. Alright, so then the first shade that I'm going to go into is the shade Miss Baby.  the  And I'm going to put that in the outer corners. Alright, so next I'm going to go into a shade that really has interested me since I got this palette, but I've never really used it much.  It's this right here. It's kind of a pewter, shimmery shade. So I'm just going to grab that with my finger and I'm going to put that all over the lid.  of Vina and I'm going to darken up that outer edge just a little bit more. So then I'm going to take the shade Misbehave and I'm going to run that along my lower lash line. Then I'm going to go into that darker shade of Vina and I'm going to  and I'm going to put that just along the outer half really close to my waterline. I'm going to go into the shade Lucido right here and I'm going to put that along the inner half there. I'm also going to take that same shade Lucido and I'm going to highlight  the brow bone with that as well. Alright, so then we're moving on to mascara. I'm going to use the Pat McGrath Labs Fetish Eyes Mascara. Alright, so here we go. This is the final eye look. So I'll scoot you back a little bit and we will do the last  lips. Alright so for the lips I'm going to go ahead and use the Ulta Beauty Marvel Avengers Matte Liquid Lipstick. This is in the shade Out of This World. Alright so that is it for today's video and this tutorial Tuesday. Thank you so much for watching. If you haven't already, remember to subscribe to my channel and hit that thumbs up button if you like this video and like Tutorial Tuesdays. Thank you so much for watching.  and I will see you in my next video. Bye y'all."
}