{
  "video_id": "9PrAJGLXUuM",
  "transcription": " San Pasqual Academy is a four-year residential high school for foster teens. It's the first of its kind in the nation. Nothing like this has ever been done before. San Pasqual is a licensed group home.  but it is not run as a group home, it is a boarding school and as such is a significant departure from existing group homes that we run in this country for foster kids. Judge Milliken is an absolutely remarkable man. He saw the true need of the foster teens. He saw what he felt was so critical to the future of our foster teens and he went for it.  The average foster care student has lived in at least a half a dozen different placements. Many who we interview for San Pasqual have been in 15 or 20. And as a result, every time they take a chance on somebody and form a relationship, they end up losing it. So the academy represents a place where they can stay home, make solid relationships with adults who care, whether they be teachers in the classroom, house parents  This is in the cottages. We've got an entire community here that spans all ages. So this place represents a home like no other place has been able to represent a home. I've been in the system for probably eight years now. And I've been in probably seven different foster homes and two different group homes. And it's just nice to know that once I got here, I knew that I was going to be here for a while. It makes it easier to be friends. And I don't think that, oh, they're not going to be here next week.  have any relationships and I'm able to make relationships knowing that I'm going to be here for two more years and be able to have those friendships, keep going and keep going, and that makes me feel stronger too. The comprehensive focus addresses the need of the whole child because it allows each member, collaborative member, to make sure that we're meeting the necessary needs to prepare these youth for adulthood. The partnerships that we have on campus is New Alternatives Incorporated, Health and Human Services,  which is called HHSA, the County Board of Education. And then the fourth partnership on the campus is called Workforce Partnership. And because nothing like this has really been done before, they want to make sure that it's done right. And in doing that, you've got to meet the needs of the students. The wonderful donors giving their financial support, giving their time and energy and their mentoring support is  absolutely crucial to the success of this whole campus. The Friends of San Francisco Academy have just been a remarkable team that has truly put their arms around the kids. We'd like to think that what we provide for our own child, we want to provide the same or much more for each and every one of these students. We've done a number of things from providing college scholarships to normal high school  experiences, proms, dances, we've done clothing. They do shop to-do drops. They helped with our sports banquets. They pay for our Letterman's jackets. They take us on outings. They help us go to games. They do so much for us. It's amazing that we know that people out there like that care about us. The kids were so excited because Quentin Jammer invited our eight-man football team.  team to the Charger training camp. On TV when we watch him play he doesn't look that big but he's big. He's a big dude. We were treated like VIPs. Sat in a little tent and stuff. Had the water given to you. We got to see all of the greatest athletes play. Saw what it was for the pros and how they do it when they're practicing.  have heard everything I have to say five times over. They've heard everything their teachers have to say five times over. And the same with the house parents. And it's really wonderful when we can have a recognizable outside voice that represents high integrity and high character come and share with our kids. Between the students, the partners that run the academy, the volunteers from the outside that support the academy,  The sense of community here is more than I have felt at any other school that I have worked at. If you're a foster kid, this is the best place to go. I don't feel this is like a group home. I feel this is my house. And like all of my friends here are like family. Walk to me, this is home sweet home. San Francisco is an opportunity for foster youth to reach their dreams. For some kids, it's a home.  Some kids it's a way to college. Some kids it's the ability to play sports. And that's what it is. It's a place where foster youth have opportunities they would never have allotted to them anywhere else. My last day here I'm probably going to cry. I'm not going to have all that support basically. It's like on me so I have to take in from what I see from the adults and bring it into my own life of how to work. The primary factor  that makes San Pasquale special is that it's a placement where kids know that they can stay for their entire high school experience. So it's consistency. Consistency is the key that makes San Pasquale special. And that kind of a vision that Judge Milliken had was just absolutely remarkable and it's just proven so much that this is the right thing. Thank you.  It's a whole new experience for me and they've made that possible that I'm able to grow and be even a greater teen. The theme of the Academy is a bridge to knowledge, support, and hope. And I feel that the most important of this is hope. You give a child hope and you give them life. I'm eternally grateful for everything they've done.  There's nothing better than to know that people care about you. And I'll always be in debt to them for what they've done for me.  you  you"
}