{
  "video_id": "_A8Ra5DXbUY",
  "transcription": " Hi, Lucy and Darren. I got a great workout for you. All you need is a towel. It's a really good way to get your heart pumping. It's efficient and it works. All you do is open the towel all the way up to the side. You come into upper push-up position. You take one foot, put it on the outside, come into upper push-up and back. You come right here, you pull your stomach all the way and you're going to keep your elbows off and you're going to run like this, back and forth.  works. As you're going to see, it's going to burn. You want to do a hundred of those in a row. So go 100, 99, 98, 97. If you have to stop, take a little bit of breaks, keep going in that same spot and really breathe. If that gets boring for you, you can give me the alphabet backwards. A lot of people have bad knees and they want to get a really good workout. And here's a really good one for you. You want them to come to all fours with your knees one inch off the ground, and you're just going to bounce right here and really breathe the whole time. My elbows are soft. My stomach is pulled all the way in and I want to straighten  from the top of my head to my tailbone. And I just bounce right here. Do as many as you can. When that gets easy for you, you can sway side to side. If you have any sort of knee discomfort at that point when you're doing the exercise, then that means that this exercise is not right for you. Hi D, I have a great way to strengthen your hamstrings. You wanna come all the way down onto your elbows. You wanna pull your stomach all the way in. You wanna lift this all the way up. You wanna leave your leg in a right angle and drop it all the way back down. You wanna go 25, 24,  23, 22. After you get to one, you want to hold all the way up and you want to pulse for 25, 24, 23, 22, 21. Just like that, you want to straighten for 25, 24, 23. Then you want to hold all the way up there and give me 25 pulses. You want to do those four in a row on one leg and then you want to switch and do the other leg. I'm Joel Harper. Thanks for joining us at Mondays with Marlo."
}