{
  "video_id": "_e5kdmrcEDU",
  "transcription": " We're going to cut this section of the tunnel out. Graft in the Mustang one.  I've got no f***ing idea. Yeehaw! It's alright. It's really easy when you get somebody else to do it.  So this is our dipped body shell, 1970 Ford Maverick. Whenever you're doing an engine conversion on a lightweight monocoque body like this, it's very important to consider its structural integrity, whether it's an XK to XP Falcon, Falcon Sprint, early Comet, Cyclone, 65, 66 Mustang. It's very, very important when you're putting a modern power plant into a vehicle like this that everything is done in a professional  So we're going to show you the process of doing that and how we add certain reinforcements into this vehicle. We'll be putting subframe reinforcements inside the sill, grafting in the original Mustang transmission tunnel onto our original Maverick tunnel. Then we're going to put a reinforcement across the back to put some additional chassis stiffness in. So it's really important that we're putting the reinforcement in the right place.  that structural members are either replaced or reinforced. We're going to cut this section of the tunnel out, graft in the Mustang one. We're also going to put a back support frame to tie side to side. Our three link front cross member and gearbox mount is going to replace the factory pressed member in the middle, so it'll be stronger than original. Also, we're retaining all the original seat  Anchor mounting points and seat belt mounting points. That way there's no loss of chassis integrity for those key parts. The last thing we want to be doing is hitting the throttle on a powerful coyote motor and the seat falling back or the seat belt's tearing out. So all of these things are really important when you go for a roadworthy as well. So let's cut it apart. Okay, so we're just going to put our Mustang tunnel in place.  to mark out our preliminary cut. So you may be wondering how we're going to get the motor and gearbox and all of this to line up correctly. What we're going to do is do a preliminary cut on the transmission tunnel, then we're going to fit the motor and gearbox to the vehicle. Double check all the clearances and line up points. So if there's any additional trimming, we can do that. Any other tweaking and we'll go again.  you through it. First I'm going to mark my cut line. This tunnel is going to go down a lot further than the line that I'm putting here. This is purely a preliminary cut. Okay Ben, so we're going to do a preliminary cut. So we'll cut it along this line here, leaving enough excess material so we can do an overlap.  We'll get the first part out, sit the tunnel back in and then we'll start to refine our cut. Okay, let's do it.  It's really easy when you get somebody else to do it.  Okay, so we've still got a bit more trimming. We've got to take out some of the factory crossmember. But, as you can see, there we are. It's starting to go into place.  So, there's the first part of making a coyote fit into a Maverick, or a Mustang, or an early Falcon.  you"
}