{
  "video_id": "_snYLAkee0g",
  "transcription": " So  Yeah.  so  so  so  You  Just pour all the water there.  6 inches, please. One on the brake.  Hey everybody, we got my 1968 Charger Hemi here and You know you may have seen this car before I've had it muscle car nationals twice November of 2017 it was there again and our goal that year was to bring the score up and You know what we do is we've had this car judged twice and it scored concourse gold both times one in 2013  scoring a 970. In 2017 the car scored at 982. So we accomplished the goal. We brought the score up. The car is better than before and since the cars come back from the nationals in November we've even improved the car doing some of the things that the judges said that we needed to improve. So the car is even better and you know that Muscle Car Nationals is a show that you want to go to. There was 570 plus cars there.  I don't know how many were judged, there were a lot of awards given out. Some of the best cars in the world are there.  quality of restoration. And it's one of the best cars out there. To score the 982 out of a thousand points is one of those things that you strive for. And we were able to pull that off. And again, it's better than it was even back in November, a little over a month ago. This car has got all the history with it, all the documentation. I've got tons of pictures, all the cert cards, window stickers,  a  We are fortunate enough to get that spot. I think the car is going to do well. Whoever ends up with this car is going to be extremely happy. It's going to add to their collection as it has to mine. I've had the car a little over four years. Again, done just about the top of everything you can do in taking concourse gold. I'm pleased with it. We're fortunate enough we've got a few other cars in our collection. We're building one for the Nationals next year. So you'll be able to see that coming.  videotape build process of that car and you'll get to see it debuted in November of next year in 2018. But this car here is one of the rarest out there so check it out. You know there's other videos out there on the car and you want to be watching it in January 20th at Barrett Jackson as it crosses the block and you may be one of the bidders because I know there's going to be a few out there bidding on this car."
}