{
  "video_id": "A0KzWsrZg4c",
  "transcription": " No matter good or bad, when we walk together, we will receive our blessings.  What is the olive tree?  into Israel. Spiritually Israel. Amen? This is the basic. If we don't understand this, we cannot begin to talk about the bride. But look what we read in Romans 11 23 says that the Israelites are grafted back into the olive tree.  And what does that mean? When a Jew rejects Yeshua as the Messiah, he is out of the olive tree. And it's only when he has that Damascus Road experience like Paul did,  Only then is he grafted back into the olive tree.  The Torah is from Genesis to Revelation.  The whole Bible from Genesis to Revelation is a love story between Yeshua and His bride. The Bible says that everything that was will happen again. The Bible says not to judge, right? Don't judge.  in the book of Ephesians. And I want you to turn your Bible to the book of Ephesians. Chapter 5 verse 11. It says that we are to expose false doctrine.  Blessed are those who wash their robes, that they may have a ride to the tree of life, and may go through the gates to the city.  Let's go back to the Torah again. She is a tree of life to those who embrace her. Those who lay hold of her shall be blessed. Sounds to me like an enormous blessing to have access to the tree of life in the New Jerusalem.  It is a long journey for the bride. But it could be a short journey. I want you to think about this for a moment. If Jesus returns tomorrow, are you ready?  Are you the victorious bride? Do you have access to the tree of life? Are you grounded in His Word? Are you following the Torah or are you canceling the Torah? Brothers and sisters, we don't have time.  Because we don't know when Yeshua is coming back. And therefore the journey of the bride is long spiritually, but it could be very, very short physically.  Yeshua asks Peter, who do you say I am? And Peter answers him, you are the Son of the Living God.  And what does Yeshua answer him? Blessed are you, Peter, for flesh and blood has not revealed this to you. But my Father in heaven, the only one that can reveal to you the truth of the Word of God is the Holy Spirit. But let me tell you something.  matter what I say doesn't matter what I say really doesn't matter what people say it matters only what God says and God says I did not come to abolish abolish means cancel the Torah but to fulfill it  Yeshua Hamashiach  Hallelujah!"
}