{
  "video_id": "AaFgCVBkv3E",
  "transcription": " Good morning from Tianyu everybody. Today is a very special day and one that I've been looking forward to basically for the entirety of this trip. We're going out to Milford Sound to explore that whole area. We were there briefly yesterday but the weather was just really really gnarly and I'm not sure today will be much different but we really have no other option because it's our last day here and we actually have a cruise booked through Juicy onto the Milford Sound. We're actually going to be going out on the water and a lot of the people we've been talking to say once it rains, after the rains, Milford Sound is  It's actually truly spectacular just because of the sheer power and all the waterfalls that are around the sound. So we're definitely looking forward to it. It's pretty early right now so we're going to head out there and try to hit an 11 o'clock cruise. And if the weather doesn't look all too good for that one we might postpone and go for the 1 o'clock. But today is completely reserved for exploring the Milford Sound before we head out to Queenstown and Glenarchy and the other areas more north from here. So let's just get right into it and head out to Milford Sound. It's quite a ways out there and especially with  weather like this the road is really slow so it takes a little while to get out there so let's go. We're trying to go find our terminal to hop on the boat. Certainly not a clear day by any means but I think it should still be absolutely just brilliant.  We've noticed that here the weather can change literally in a matter of a second. So just going with the flow. We kind of have a lot of rain protection bags over our cameras. I took my external mic off like I did the other day just because it exposes the ports and then the camera really is a waterproof and to me it's just not worth risking it for that. So I apologize if the audio isn't as good as it usually is but this is merely just for protection. So super super stoked for this. Currently walking down a boardwalk.  Oh, we got upgraded? We have to pay extra? Perfect, cool. Premium cruise. So what's the difference? Tell the people. Okay. That's where we're going? And we get coffee?  So will you like announce boarding or like how does the whole thing? No, you have to be at 1115 at gate number 5. 1115 gate number 5. We get coffee and snacks on here and we got upgraded to the premium cruise which is just so sick. So looks like it's about like what like an hour and like a half cruise and we're going all the way on this. Thank you. Here you go Liv. Thanks Mike. Boarding pass.  keep these forever and ever? No, you can't. Of course you do. You have to give it to the state. Thank you, sir. Thank you. I currently get on the boat right now. Juicy cruise. Weather is absolutely gnarly.  56, I'm going up. How you doing? Up top? We're going up to the top of the boat here. Good morning! How are you? Starting our departure here from the terminal. It's pretty spectacular out here. This is going to be awesome.  so  This has been absolutely incredible. The wind here is like nothing I've ever experienced. It's so incredibly wet. The movement of the boat makes it so hard to shoot anything. It's absolutely fascinating. The waterfalls that you see all along here are something that I truly have never ever seen before. I'm super glad we decided to do something like this because it's been absolutely magnificent. I'm really speechless in terms of what else to say with an experience like this. If you're ever down here in Milford Sound, I highly, highly recommend it.  I highly recommend you doing a cruise, getting out on the water, it's a whole new experience than seeing it from the shoreline. It truly is remarkable.  Free coffee, I'm always about that.  Don't mind if I do. Pretty good.  The cruise is ending we're coming back into the harbor right now. It was just an absolutely incredible experience. I almost didn't have anything to say while it was going on. I was just too busy talking to the crew.  taking it all in and trying to capture the moments all these waterfalls just absolutely incredible experience and like I said highly highly recommend something like this the sky seems to be kind of opening up and just just speechless you know I don't even know what to say with something like that and it's literally like a fairyland and I'm almost glad that isn't in such a remote part of the world because something like this deserves to have its raw nature and beauty just preserved because this  is just truly amazing. I'm completely soaking wet, my body is just tired from fighting the cold the whole time so hats off to Juicy for putting on an amazing experience. And this is just one of a kind here, it really is. So let's go get warm. My life has actually changed. Yeah? Yeah, I just, I don't even know what to say, just, I mean I said it in my camera, like, that just was such a humbling experience to see and feel and experience how powerful the  earth is and to see its beauty firsthand and I just can't even seeing that I just can't imagine the parts of the world that aren't explored yet that we don't know about yet and how just seeing that pure beauty was just untouched with no human pollution was just incredible  you"
}