{
  "video_id": "aAFUEHWZ_D8",
  "transcription": " You  Come on! Come on! Come on!  GOD! You'll get my dog, Harvey! GOD! I am the wheel of deal, the kiss deal, Jeff Flynn, Lindsey Ryan, son of a gun, Mike Farnham! Well, can we confess? Confess who loved me?  Welcome to my fun reality show!  I  I'm done. I shot her for a quick second.  We're Mexicans but we like beans.  Where am I? Are we in Philly's basement? Stop! Bon Jovi, son. Bon Jovi. My ear got pumped over my head. I'm world famous! I'm world famous! I look like I'm 26 years old. And I'm getting abused. I'm getting absolutely abused here.  I  Oh, oh, no! Oh, oh, no! Oh, damn! Do you have a hero in you? Yeah, Ho-Bag! We're all just drinking! I feel so good, I can't even move my arms! Ah! Ah! Oh, shit!  This is what happens at Cudfest 2008! You wake up, shirt dropped to a chair! Wake up, you- Stay in there, mother fucker. Let's go, Buffalo! Look at Jessie! Give me your wallet! Give me your money! I'm Steve after Friday night! It's Steve! It's Steve! Get him!  It's Sting! He's on the police! What's he do? He sprays some... Fast forward 4 and a half. I got your legs! Show my ass!  I'm not into water sports. I hate water sports.  I have no fucking idea what the fuck you're talking about. You go to fucking GunFest 2008 and this is what happens. Oh yeah! I thought I saw... Alright you guys! Who fucked my loaf of bread? Yo, I didn't fuck your piece of bread, man. Nick Carter, who is Nick Carter anymore? When's the last time you saw Nick Carter? Right, you fucking punk. She said she doesn't want him.  Yeah, keep looking keep fucking laughing at me. I'll smack you right in your mouth. You fucking jerk Don't worry, don't let it get to you man. You got him, you got him. You can wear him down. You got him right now. This is all you, baby. This is all you, man. Yeah! Get up, jerk it up. I'm gonna fucking punch you right in your fucking mouth. Jesse, this is a bad- The arm is gonna pop off. I'm gonna punch him right in his mouth. Whose gun's bigger?  Oh, yeah, what yes, that's right kids and job action Charlie is back, and he's ready to go This is a fucking bullshit bullshit bullshit bullshit bullshit  This is fucking bullshit!"
}