{
  "video_id": "AgsTYCe9czA",
  "transcription": " Alright everyone, pay attention here. So what are we going to do this afternoon?  Isn't it fun? You all have to tell me what you want to be when you guys grow up. So we're ready for it?  we'll be able to prepare them for the new and exciting possibilities of the future. Hi, my name is Nysa. I want to be an actress. So sweet. Oh, you want to be a doctor. You're a really cool doctor. I want to be a choreographer. I love to dance. Dance is my passion. Maan Gandhi. Football player, Ronaldo. That's a fantastic drawing.  Oh so sweet! What have you made? Neher? Scientist. Scientist! I have some very interesting people who want to meet you. You have to guess what they do, what their profession is. You want to meet them? Yes! Yes? But before that, I must tell you that they have travelled in time from the year 2030 to meet you. Their jobs are perfect examples of how human-machine partnerships  will evolve roles. Let's see who they are and what they are doing in the future.  And my last friend over here? Software engineer. Writer. Gamer. Writer. You all are so smart and almost right. Do you want to know what they really do? Yes. I am a commercial space pilot. I have been trained to command and fly privately funded spacecraft. I will be flying people to space soon. Maybe some of you, when you grow up that is.  In the near future, we will be able to alter weather patterns to avoid any climate disasters. And my job will be to ensure that we comply with the global laws. Imagine making it rain in a drought-hit area or making the rain stop in a flooded area.  upgrading the storage space of a human brain. I'm the chief of collaboration. In the future, I'll help humans and machines become colleagues by using gaming techniques like augmented reality, virtual reality, and artificial intelligence. Basically, I'll make sure that humans and machines are the best of friends. Let's help our kids look beyond the horizon. Let them explore opportunities and use their imagination for their own future.  Because their jobs, they don't even exist yet."
}