{
  "video_id": "AnBixRgkIGY",
  "transcription": " By bringing together all of our business partners, our teacher representatives, and most importantly, our student voices, we were looking for work-based learning and how can we close the opportunity gap. I think when we talk about pathways to a livable wage, pathway to a career, a lot of our schools have used  to trades as an alternative. I don't see that as an alternative, I see that we have options. And since I took the automotive programs and I'm in the trades, I can get a job right out of high school. They are doing things that we need in our community. It helps yourself, it helps the community on the whole if you can do a hands-on job. Thank you all for making this an important part of the work that we do with our community. Thank you to all the community partners  that are here and gathered with us today. Well, Right Track is important for the St. Paul Public Schools students because it helps expose them to a variety of career options. It helps young people understand what they do and what they don't like and they can envision what their future might look like. We have over a hundred different employer partners and so we have jobs in almost every industry that's possible in the city of St. Paul. Some experiences that I have gained is a big one is networking. So being able to get yourself out there and knowing that you have people to talk to in different career branches that can help you get  those interviews or get you those job positions or get you those internships. We got to drive booms and we also got to operate excavators and jackhammers. So every place we went we got to operate just like it was a day on the job. There's a lot of work to do in this country and there's less people getting involved in the trades. They can come here and make a good wage while they get their education and they'll be set for life. So I see Minnesota Trades as kind of bridging that gap. When we talk about the wage disparity,  opportunity disparity. We're giving these kids options."
}