{
  "video_id": "B9t_NybAytA",
  "transcription": " Hey guys! So we're just happy that... We're just happy that it's Friday. We're both just coming out of work, that's why we're like this.  those work blues. So we're in the what section? Midtown West. We're headed to get some food at a place called Pepper Lunch. Ironically it's dinner. Ah yeah. And what's funny actually is that when Dumpling told me about Pepper Lunch, for some reason I thought Pepper Pop, which is actually a Caribbean, I think it's a Jamaican dish or something like that. Pepper Pop.  What's in it? A shrimp? I forgot. Shrimp and... I think pepper is it. It's one of those stories that go nowhere. One time there was a joke about this guy and yeah, I forgot. And those are how my jokes go. It's very popular in the Philippines. It's in a bunch of walls. I've had it before. You haven't had it before? I have not had it before. So from what I hear, it's like a steak thing? I have had ikinari.  before. Actually we both have had ikinari in Japan. We'll see how this pepper lunch is. It's like food on a sizzling plate and in the Philippines ever since I was growing up that was like a big big thing. So if you go to like a food court there's always like a hamburger steak with gravy or steak on a sizzling plate. Yeah. So we're gonna have some sizzling steak.  Okay, so what do you think you're gonna get? Oh boy, I don't even know. There's a lot to choose from. I don't know. I'm looking at...oh yeah. I think there's happy hour. Oh maybe. Alright, so like I see there's like a bacon and cheese pepper rice? What? Well, I'm not gonna do that one but... That looks more like breakfast. Oh, there's eel. I love eel. Maybe the classic? Or there's a kimchi. What is a sambal?  I have no idea. And these are like the pricier steaks. This is more like a canari steak. The Angus Chuck steak? Yeah. Oh, I see. Oh, and there's hamburg steak also down here. Yup. Let me try that. So, one is hamburg. I'm gonna do spicy. Okay.  Oh, does that come with rice or anything? Oh, it does smell good in here. So we have some steak knives. And also garlic soy sauce and sweet garlic sauce and garlic and wasabi. Are you excited? Yeah, I'm hungry too.  Can't wait! Oh! Excellent! I like the splash guard thing. So this is the one with the spicy sauce for our abalone? Uh huh. It comes kind of like partly already cooked or something? Should just cook the rest of the way. Ah yeah.  Oh this looks great! Look at that steam! Oh a beautiful sky! Alright! Oh look at all that cheese! A lot of cheese. My dish almost reminds me of like Bibimbap too. Bibimbap? Yeah.  Oh, this is like full of cheesy goodness  I would say it's close to a challenge. Maybe a little mild. And then you can just add whatever. Mmm! Yeah, that is really tender. Really tender beef. I like that. I was gonna say, yours looks more interesting. Yeah, because it has cheese.  That's very cheesy. That does look cheesy. Cheese and corn is a good combination. Yeah, that's a lot of cheese. I'm kind of jealous.  Yeah, and how's the beef? I forgot to ask. No, it's tender. It's very tender. I like sukiyaki. I like those gyudon noodles. Yeah. Japanese meatballs. That looks good. You should try it, bro. Okay. Oh, this is for you. Okay. I'm rear-breaking myself.  It is really tender and cheesy. You want to switch? No, this was good. Very tasty. I mean, we should have a little bit more beef because the beef is so tender. But it's very tasty.  I think it's pretty solid. This is, I mean, pepper lunch is more casual. Like a casual fast food. So, I think this works. I agree. Let's see you take that last bite. Should be in slow motion. Cause it's so good. I wouldn't come out of my way if I'm not in the area to eat here. But, it's solid. It's a good solid meal. Oh, that was alright.  It was a quick eat. Honestly, it's like a fast food so you can't expect too much from it. But I was wishing that it wasn't as pricey for 13 bucks. You know, it was a lot of rice, you could have more. The flavor was good. Yeah, I agree. It was a lot of rice. Like I had rice left over and I think for like the classic one you definitely have to put like all the sauces on it. Yeah, well I did. Maybe you won't. No, it was tasty. It was just a bit of rice and you know.  I'm like, we're in America, we should have more beef! Yeah, I wish they had more beef. But the beef was tender. And the kimchi one was really good too. I think you'd be happy if you ordered pineapple. For you guys, if you do like pepper lunch, tell us why you like it. And what are the prices like in the Philippines? And wherever pepper lunch is for those who are not in the Philippines.  I guess until we... I wonder if they have Ikinari Do you guys have Ikinari? Let us know! Until next time! Bye!"
}