{
  "video_id": "BCKpVVtJexc",
  "transcription": " So my brother just caught a big one right now, I don't know what it is. How's it going guys? We're at the water fishing club with my brother in Christ, Michael. We're about to come fishing to this lot that is private, but we're going to try it. Hopefully they don't tell us nothing for crossing the, for being parked right here too, okay? So stay tuned.  First pad right now. There it goes. First pad guys. Padded too.  beautiful bass guys oh he's so beautiful look at this my little bass guys this little lake that we just found right here lost lake well not lost there's people working in the back of us man he got hooked good  catch and release guys third one of the day guys really good guys Mike was over there caught another one right here with the bait he was using another one guys  I'm still catching them. Second one in front of Mikey. Well, it's the fourth one already in this lake. Catch and release guys. How's it going guys? Look, I came under the tunnel, Washburn tunnel. Caught myself a little bass already with this little bait. So.  Hey, we're fishing right here behind the Washburn tunnel. Say hi Joe. What's up Carla? So guys we just started fishing already caught my first bass in this bayou Washburn tunnel and Pepe just caught another one but he caught a big one guys. Nice fatty. He's fat. He's as fat as sin. Check it out. It's actually this bass bait because right behind my girlfriend's bait it was coming and then mine was right behind it and boom it's out of the mine but  Y'all know what we do, catch and release. Hope y'all like this fish. Check it out. And let's do this. Keep on catching some more. Take me that one, bro. This is good. Dude, that is like a fake bag, bro. Look at these guys. They call it in Spanish, besugo. In English, I have no idea. It's like a drum, a freshwater drum. Please, if y'all know how you call it in English, let me know.  I have no idea. It's a beautiful fish. I just caught it right now. Nice. I think it's the one I had. That's a fat big one right there. Look at that. Baby, not too close. Look at that. Nice little single worm. That's a big one, guys. That's a big one. That looks awesome, bro. Guys, I just caught a snakehead, guys. That's the biggest snakehead I've ever caught. I caught some monster ones. Look at this snakehead, guys. That's a crazy fish, man.  Can't grab him bro. His tongue. These ain't no snakehead guys. I don't know what is this? No, it's another rare animal. Look at his face. Not a snakehead bro. That's what a snakehead looks like. It's been years since I've caught a snakehead.  I'm not sure you look like a crazy fish, but Could be I was gonna catch a release by the way my brother just caught a little bass too So we're about to catch a release let it go first  Listen to him. Fight him, fight him. As if you're going to try it.  don't go too much down I told you don't go down don't go down stay right there fighting from there fighting from there ah yes haha guys I want to fish a club stay tuned for some more videos like this alright"
}