{
  "video_id": "BhLok31gMF8",
  "transcription": " Hey guys, Jen of Fun Toys and More here. Look what I have. This is Play-Doh Disney Minnie Mouse. We're going to try to make bows for Minnie Mouse. Like this one right here at the back. Comes with stamp. We can cut and decorate Minnie Mouse with it.  bow, pink bow. And we're gonna try to play tea party with Minnie Mouse. She got some good stuff here for tea party. Alright guys, which one do you think we can open first? Let's do this one.  and then we can make Minnie Mouse bows after. Got some plates. Look at the colorful plates with Minnie Mouse picture on it. Some teacups. This is a teapot.  Some more tea cups, pink. And look at this, how cute is that? Got some more here. And some spoon. So there you have it. Hey, anybody wanna join Minnie Mouse for tea party? Now we can open this one.  to make some bows for Minnie Mouse. You will need this other clay that I was forgetting to use. Purple and pink. A Mickey Mouse bow. A bow cutter.  with a mold for a bow and this is a mold for Mickey Mouse right here this is a mold for Minnie Mouse  That's Minnie Mouse. And we can try to make a bow for Minnie Mouse. Look at that. That's awesome.  I'm gonna make a purple for Minnie Mouse also. Look at that! This is Minnie Mouse in pink and Minnie Mouse in purple.  Now I'm gonna try to make a big bow for Minnie Mouse  And now a purple bow.  It's cute. And one more bow.  There it is. Minnie Mouse. Cute bow that we made today. Now we can have some tea party. We can share for a while.  For everyone, there's another one. One more. And another one.  Let's join Minnie Mouse for a tea party. She is right there. She's the star. Anything we can eat with our tea party? How about we make some fruits, guys? Some grapes would be good.  There's our grapes How about strawberries? Sure! Some strawberries Oh look, that's perfect  for a strawberry some bananas would be great too perfect mold for bananas remember guys play-doh is fun to play but not  There you go guys. We got grapes, strawberries and bananas. How about a cookie? There's our cookie. And another cookie.  with our cookies. One more.  Well, there you go you guys. These are the food that we can share and some fruits. Thank you for sharing your time with me. This is Jen. Fun toys and more. Thanks for watching my video and please subscribe for more."
}