{
  "video_id": "BI0cHWofUck",
  "transcription": " Today I'm here with Jeremy. Jeremy not only works here part-time, he's a full-time police officer, works part-time here both selling and in our armory. Jeremy you recently picked up a Glock 34 and today we're going to talk a little bit about the pros and the cons of a 34 MOS. What's good about it, what's bad about it, and what's different about shooting a gun with an optic on top. Jeremy we're going to approach this from two different angles.  One, we're going to talk about what's different about shooting a gun with an MOS, and then second, we're going to look at what are the pros and the cons about mounting an MOS to a firearm, and what could be done a little bit better and more efficiently. For starters, when we're looking at shooting a firearm with an optic on top, how does that change for us? Well, with the optic on top, to me, it's a little harder to see at first. My first round is slower, but at the end of the day,  additional follow-up shots are much quicker. Okay, I know when we were testing it out a little bit, you and I both found that when we went for our first shot it was quicker for us to grab that front sight because for so many years we've done it that way it was quicker. But then by grabbing the front sight we subsequently found the dot a little bit quicker as a result. Absolutely, just through training muscle memory makes you focus on the sights more. And as we do it more perhaps that'll change a little bit.  Correct. All right. Tell me a little bit about the difficulties you had in mounting this Why did you have those difficulties and what can be done to make it a little bit easier? Well the Glock MOS system the mount that it comes with the fasteners just don't have enough thread engagement They should have put longer fasteners in it To get past that I just went to the hardware store got longer ones of the appropriate length. All right So as a result we have seen back in the armory we've seen some of these come back where  the optic had flown off while somebody was shooting it because again there's not enough thread there to reach in and grab. Without the thread engagement a lot of people are over torquing them, stripping them out and that's caused them to fly off. Now we've seen some other issues with the mounting plates that come with it. One of which is that they're not fully covering the bottom of the trigger arm RMR. And as a result  That can allow some moisture to get up in there depending on what type of environment you're in. If you were to drop it in a mud puddle, then obviously with the sides allowing water to get in, it would spell a bad day for the electronics. All right. Having said that, the likelihood of us dropping this in water is probably slim, so it may not be a big deal, but I do know we have other folks here in the shop that have MOS, in fact, a Glock MOS, and a couple of those guys have  ordered an aftermarket plate that covers the whole bottom so that there's no exposure on that battery. There's a lot of aftermarket options that are much better than the gold-plated one.  Obviously he held a nice tight group. I have a couple questions for you. One, were you using the dot or were you using the sights? On the first round I used the sights and then all the additional rounds I used the red dot. Okay, obviously you were taking your time going a little more for accuracy versus speed. So we'll do a couple rounds like that and then we'll do a couple of rounds maybe for speed and see what it does to our shooting. Neither Jeremy or I are used to shooting with the red dot so this is something new for both of us. I've done it a couple times for other videos  but other than that, I've really not shot with a dot system. So this is going to be an adjustment for both of us. Obviously a little quicker than what I would typically shoot if I'm shooting for precision, but I wanted to see a little bit about how easily and how quickly I could reacquire that red dot.  But now that I think about it, I really didn't pay attention on that first shot. I think I took the time to find the dot on the first shot as opposed to just going up and seeing whether or not I could find it. We're gonna do it again.  All right. So something we kind of knew in advance was at this distance, the dot does shoot a tad bit on the low side. Correct. All right. So do you anticipate you're going to leave it set a tad bit low at this distance?  or do you think you're going to end up raising it? I'll probably keep it the way it is. The red dot I think would be more beneficial at a farther distance from the iron sights. So I would rather just account for the low shot placement up close and have it be on at a farther distance. All right. So why don't you take the last few shots and you're going to do rapid or quick? Which one do you want me to do?  Your call. Or you want to do a five shot competition? Let's do the competition. Alright. Five shot tennis group? Sounds good. Alright, go for it.  I think I got him on this one. Maybe by a little, just a little. It's going to be tight, tight Carl. I'm pretty sure that's clear. All right, so I'm going to be honest, I cheated a little bit here. My holes looked like they were far apart.  And so rather than to continue shooting the tight group over there I went ahead and tried to join him which I got lucky and did so it made my Made my group look a little more impressive. He knows that's what I did No, actually that really is other than that one, but but I do believe it shoots low so That part but I did shoot it slightly to the right. Yeah, that part was me. What are your thoughts on? The MOS after having shot it  it  clear picture of what's going on down there. I'm actually looking forward to using this with multiple target engagement. So we can see how it is to transition from one to another. Transitioning should be quicker. But back to the original point was being able to focus on that red dot. I can focus on the threats down range, right? And I don't have to focus on that red dot. It's just there. Right, right. Which is why a lot of the competition guys have gone to the dot system. It's quicker for that. And once you, once you change your eyes to  focus on the right plane becomes a system to use. Correct. Of course, now you have to decide whether or not you want to use something that takes a battery or not and how easily if there is failure on the sights part, how easily can your eyes change back to the old system of using the dots. There's definitely training involved, especially when you're pulling the red dot on it. All right. We're going to see. Guys, let us know your opinion. If you've had an opportunity and some experience with red dot  sites let us know the pros and the cons what challenges did you face when you are mounting them what challenges have you faced since and how good or bad has it turned out to be for your shooting skills and and picking up the site acquisition for the site picture being able to grab that picture a little quicker and hopefully speed things up just a little bit as always we thank you for watching be sure and hit that little bell down at the bottom if you'd like to see more videos like this and we'll probably see Mace again here in the future on some other videos take care  Bye for now."
}