{
  "video_id": "bShcPJpUVfE",
  "transcription": " Mom, I'm home from school! Oh look, my magazine's here! What the heck is this?  your performing arts. Congratulations. Attached to the letter, there should be your child's schedule for all of her nine period classes starting September 14th, 2015. If you have any questions or concerns, you can reach the school office during business hours at 202-380-2939. We look forward to meeting both you and your child on orientation day. Sincerely, Sydney Huber,  MAPPA superintendent? MAPPA? Mom, what's this? What's what, sweetie? This letter from the Manhattan Academy of something or other. Is this some kind of joke? Oh dear. I was hoping to find this before you. Find this? Mom, what the heck are you talking about? Well, the location of my law firm has changed. We're moving to New York.  So  Oh yippity-da, home sweet home.  I have a choice. I can't control where my law firm goes. I know, I know. I've heard the speech a million times already. Well then you should know by now. You know that this isn't easy for me either. Mom, you have to know that moving away from home into a different state and having to make all new friends is not the easiest thing for a teenager. Well I did get you into this great performing arts school. You should feel lucky. It's like in the top ten in the entire state. Fine, then I'm going out to check out this oh so amazing school you picked out for me.  Kennedy wait, where do you think you're going? Oh, um, my mom's here. I gotta go. See you tomorrow. Okay. See ya. Oh, hi. Oh, um, hi. I'm Kennedy. I'm new here.  No kidding. You look lost. Hi, I'm Jen. Welcome to the Manhattan Academy of Performing Arts. Oh, right, MAPA. Right. So when's your first day? I start Monday. Oh, well, that must be exciting. Oh, hey Jen. Oh, hey Josh. What are you still doing here? Oh, I was finishing that math test for Soxman's class. Oh, yeah, that was really hard. Oh, by the way, this is Kennedy. Oh, hi. I'm new here.  I start on Monday. Oh, that's cool. I'm Josh. Oh, it's really nice to meet you. Well, it was nice talking to you guys, but I better get going. My mom doesn't like it when I'm late for dinner. Oh my god, what's that? Oh, yeah, Brynn was talking about that in English today. I guess Wicked's having an opening casting call. Oh, Wicked is my dream show. Um, by the way, who's Brynn? Oh, she's this girl who goes to our school. She really, really loves theater, but she is  She's a little headstrong. Oh, well, I hope I get to meet her. Oh, don't worry. You will. But seriously, Wicked is my dream show. Honestly, if I could be in any show in my entire life and never perform again, I'd want to be in Wicked. I'm so excited. Oh my gosh, then you should totally audition. You know what? You're right. I better go start preparing. I'll see you Monday. Okay, bye. See you later, girl. Bye.  Guess what, guess what, guess what? What is it, Kennedy? They're holding open auditions for Wicked. Oh my gosh, that's awesome. I knew that you would find something that you like. Aren't you glad we came here now? Yes. Wicked is like my dream show. That's great. When are the auditions? Are they soon? This Saturday, which is why I need to start working on finding a song now. All right, all right. I guess that's my cue to leave. But dinner will be soon, so make sure you listen out. Have fun.  Don't worry, I will. Alright, now for the hard part.  I got it!  you"
}