{
  "video_id": "bze7n_7Ntkw",
  "transcription": " Hello everybody, welcome to Lyon Explorer, I'm Marc and today is super cold, it's minus one, we are in December in Lyon and now we are on Les Jardins Suspendus, the holding gardens. They are gardens on the rooftop of Perrache  train station, one of the most important train stations of Lyon. Even though it's freezing, we are happy because it's Christmas. And as it is a tradition in Europe, here in Lyon, we have a fantastic Christmas market. So let's go down there, take a look and find a little bit of human warmth. So now we are in front of the Christmas market and as you can see, it's all surrounded with fences.  Security has been increased because last week there was some terrorist attacks in Strasbourg. So, we give all our support to the families. And why are they so common, the Christmas markets? Well, the first ever was in Germany in the 14th century. But then it was so popular that the tradition spread all over Europe. Here in France now we have around 65 Christmas markets  most important of all of them is in Strasbourg. This one being celebrated for first time in 1570, now it hosts every year more than 2 million people and during three weeks it generates 250 million euros. This one from Lyon was created in the 20th century, so way after, but it has nothing to envy to the others. Inside you are gonna find tens of stores filled with products, but which kind of products can you  find so let's go inside and check it out  and handmade potato fries, crepes, you are gonna find tartiflette that is a food from the mountain to fight back the cold made from cheese, potatoes and bacon. You are gonna find Christmas candies, hot malt wine and you are gonna find plenty of sweet things. So guys this is a lot of calories so you will have to do a lot of sport so this is the best opportunity to come to our tour and walk with us. And if you don't know what to give as a present  to your relatives or your friends, this is the best place to find a super nice gift, because you will find plenty of handcrafted wallets, scarves, wooden toys or even Christmas figurines. And if you don't have a Christmas tree at home, you can come here, there is some. So before saying goodbye to you, few technical informations. The market is gonna be running till the 24th of December. It's gonna be open from  from 10.30am to 8pm during the week and on the weekends it's until 10pm. So thank you, Merry Christmas and see you next year! Merry Christmas!"
}