{
  "video_id": "cFMHvAVKNa8",
  "transcription": " Windy, windy, windy  Okay  showing the end of the training here. We did all this. The steps without the forms, no forms again. Another set of steps. We did the rocks on the side, carved them. See the carving, the rocks up under here. Now this was done, how long did it take you guys to do this? Two days. Two days. And what's two o'clock? So it's a day and a half. Yeah, a day and a half. By the time we got going, actually, we talked until 10 o'clock on... Yesterday. Yesterday. And there was nothing here.  There's none of this. None of this. And in two days, the walls, all of this right here, waterfall, not bad. Not bad for two days. So, you know, I see a lot of people putting different things on their trainings and stuff like that, but it's pretty amazing what we're able to do in just a few days. Hi guys, pretty impressive. Are you guys pretty impressed by what we're doing? Oh yeah, absolutely. Good, good, good. So we, you know, the classes we have, we fill up every single month, two actually, two a month.  We got one coming in Tennessee coming up. But it's that we do things that are just pretty astounding. Do we actually need that many guys for you there? No, not at all. Because that's what everybody says. Well, you got 100 guys there. That's why you finished it, Dave. But you can get a small crew. I felt like we had too many of somebody. Right, right. You're right, because you're going to get in the way. So no, this is a whole different deal. So all right, man. You guys having fun? Absolutely. Tell me a little bit about what you do and what you've been doing.  My name is John. I own a contracting company in Walterboro, South Carolina. We're going to add this to what we can do and we're super excited about it. Nice, nice, nice. Well, now that you mention your name, you're a contractor, you've got to watch out for a guy named Bale Bibler, he'll call you. So anyway, John, when you can do it that good or better than you're at now, then you can come and train me, right? That's right.  Tell me a little bit. I'm Don from South Georgia, DHB Home Services. We do the same thing pretty much these guys do just out of South Carolina. We're gonna add this to it and just keep on going. It's a great thing. It's a blast. Way cool. The only thing stopping you is your imagination. You can do anything with it. Alright man, now we'll get a couple more quick ones. Yeah, how's it going? I'm Carl Dupree from Colorado Springs, Colorado. I do handyman construction out there with a co-worker of mine or a partner, I should say, Bryce McMahon.  He started up the company. I'm just out here to learn a new trade bring it to our company Hopefully expand it gets more guys interested in it. So I'm out here to this awesome training It's been phenomenal out here in New Hampshire. Never been out here never done any type of work like this but I mean they give you the tools and You know, they give you the tools to succeed so pretty stoked about that and I'm ready to take it home and do bigger and better things Cool, you know what but what all about all that bad stuff? He's running the internet, you know, I mean  You're always going to have skepticism and you're always going to have people out there who think that this is impossible. But I mean, honestly, from experience doing this, it's completely 100% possible. And you don't need a large crew to do it. Two or three guys at the most. That way you're not stumbling over each other. And it's super easy to do. It's up to you, right? Yeah, exactly. Exactly. You think there's a market for this type of stuff? Oh, absolutely.  It doesn't have to be this big and extravagant. I mean it can be you know, just something a little bit smaller but You know, there's I think there's always gonna be a need for something like this You know people are gonna want you know that backyard living and this is just a great thing So Felix says ignore the haters. What's up, Christopher Bruce?  Alright, we're going to go do a little vertical, some countertop stuff and see if we can get some more things done around here. But the crew is ready to go. And we're just about out of here. So we'll catch you back Facebook Live again when you see what we're doing here. Let's see what we can do. You guys ready to go see that vertical stuff? Absolutely. Alright, you having fun? Yes sir. Alright man, good job. Alright, well, Facebook Live, we're out of here."
}