{
  "video_id": "cnpdnEL2O3M",
  "transcription": " So  Welcome to my channel Metal Detecting in Bavaria in German and in English. I hope you do enjoy my video clips and if so please be so kind and subscribe.  Let's see where we were today and what we found.  The longest day of the year anyway. Mid-year, whatever you want to call it. The sun is starting to go down, thank God. We've had 33 degrees Celsius, which is very warm the whole day. And it's still about 32 degrees right now. And this area right, what I wanted to do a test run on, this yellowy part right here, is normally very swampy. And you can't get on it.  Welcome to a warm day. It's June 21st and it's about 33°C today.  They fly around. But okay. As I said, this area here, what I'm doing today, this is permit number 2. That's all number 2. Everything that is green right there is actually permission number 2 also. But this one I've never been on. So I haven't been on this permit yet. Only the yellow one. Back there a bit of a test run. Because this here is always so ... to the morass ...  rustic is and this is so dry that actually that is the is a so go and in content and it's from a mobile okay see on the first fine with some essence And we're starting off with tinfoil. Yeah, they asked the fund is aluminum. Oh, yeah great signal cause the technical signal our  Good signal, but trash. Okay, off to next. Nice heavy piece of brass, but modern. Okay, off to next. So, this gave a strange tone, and I had like a 50-odd going up into the 65 and iron at once. Normally that's a belt buckle.  that has an iron needle in it. This time it's the other way around. It's like an iron god knows lid or something like that but with the brass ring in it. So still got to dig them don't you?  Two different materials inside. He recognized it well. Still garbage. Some kind of lid. Let's go to the next one. Very nice. Very nice. Cufflinks. Yeah. Manchettenknöpfe. Very nice. Very nice indeed.  before but I think it was Sven that found some here in the area so or at his location not quite sure or Marcus one of the guests but very nice indeed complete too.  And just a little bit on. Button engraved but still very dirty of course.  Okay, on to the next.  I'm going to clean it too much right now.  It's almost 9 o'clock and it's time to go home. See you next time, if there is a next one.  Iron pieces, nearly an iron ring. A little bit of modern trash. And then the three finds today, only at one hour. It's actually the button with the lion on it. So you can see the lion right there. So that's a military button.  military button cufflinks cufflinks machete buttons and the other button and that was it  But hopefully in the morning it won't be too hot and then I can go detecting before I do the rest. So if everything goes well, we'll see you tomorrow morning. And if not, we'll see you another time. But until then, as always, take good care of yourself and remember, keep smiling. It doesn't help.  not you."
}