{
  "video_id": "CR55TVLjTzc",
  "transcription": " I  So we just  to this place now it's a it's a bit of a weird one really because we're done planning to go Amsterdam yeah and we've ended up in the red light district sick filter though hashtag not snapchat so this place we were trying to go to now it was used as a hospital for the wounded in world war two it's been used in a low budget horror movie and before you say about  I don't know how true it is but supposedly he died on the premises a couple of years later.  Difference and it's not just because we're in John's car Kyle Kyle Kyle Kyle Where is he? He's not here. So it's just two of us on this one. He's basically He's basically taking climbing lessons And if you want to see that we've got a video coming up of Kyle taking climbing lessons and how that went  Me, you, me, you.  better we kind of like the house we went to originally but this is if we can get in here gonna be really exciting so fingers crossed yeah it's massive massive so wish us luck and if somebody finds this video and we've not returned yeah love you all I'll take care now bye bye  After you, I say, pour me.  Stop.  Turn the other way.  I'm sorry.  I  What the fuck? No one's leaving that out though are they?  There's a dog boy there. Clearly guard dogs.  I don't think he's happening.  Watch your footing bro. Shit.  So We kind of got in and we kind of didn't we got out pretty quick though Basically Scouted the perimeter and We got into what we thought was gonna be the front entrance of it all there's still cars there allegedly this place has been sold and everything's been cleared out and it's  this is going to become some wedding function place. It's got a long, long time before that happens. So we come to this front door. I mean, what's the worst that can happen? Let's try this front door. Right by the front door is a dog's bowl with fresh water in it. Now there is warnings that there's guard dogs that patrol around. There's a man with a shotgun that takes pop shots at you if you're on his property because there's warning signs everywhere. Didn't see no warning signs for shotguns, must admit.  Anyway, so we well John tries the door And then a light on What would be a kind of a side window comes on and it sounds like the window sort of cracks completely open Belted it absolutely triggered gone you say Over the fence boom gone. I don't even know if my phone was recording at a time It was it was too dark for night vision. That's how bad it was  So it's an absolute fail. An absolute fail. But let's see what we got. But let's call this lads on fail. All right, sweet. Peace out. Till next time."
}