{
  "video_id": "cVsCAgSOHJw",
  "transcription": " My name is Stefan Daniel and I'm global director of the product division photo at Leica camera Wetzlar. Yeah, I started to get interested for photography because my cousin  She was an avid amateur photographer. So my first camera was a Loner camera from her. It was a Pentax K1000. And I had much fun with that camera and did the first steps, all manual, the camera and so on. And as I grew up here in the area of Wetzlar, it was only a natural move that I would apply for a job at Leica. So back in 84,  I started an apprenticeship in precision mechanics here at Leitz Wetzlar. And after that, three years, I started to work in the repair department. So that was a natural move because I was addicted to cameras all the time. But this time in the repair shop became a bit boring after a while. So I said, why should I not go  and have to go to school again and then to university. So that was my plan, but it came in a different way because I was asked whether I could train the repair technicians in Paris. And this was a nice offer. So I accepted and moved to Paris for three years. And back in Wetzlar then, or in Solms at that time,  I got another offer to be a product manager for slide projectors. And this again was a very tempting offer. And so I started with product management back in 1995. And then after that I took over the product management for the M-System. So the M6TTL was my first project. After a while I also headed the product management, which I basically  What is the Leica Leica Pro?  What is LHSA to you?  of Leica. It is one of the biggest and I always encounter LHSA as a gathering, the big gathering of people sharing the same mindset, being open, being friendly, having fun with the things they do.  So this is a relationship or a partnership, you could even name it, we have since 2001. And it all started by the exchange of optical technology of Leica to Panasonic and some help with the digital compact cameras in these early days. Since then, the corporation has been expanded to many more fields.  There was a technology exchange in autofocus, for example, in image stabilization, in other fields. So we're cooperating the usual way on the compact cameras, but it has been extended to various other levels. And so we can say Leica and Panasonic have a very tight relationship.  It's great to know that we have such loyal customers and being more than customers, we are all in a family. We are on the one side, you are on the other, but we share the same passion and this is something you probably don't find very often in other companies. Thank you to the LHSA.  you"
}