{
  "video_id": "cw9atTk4Ggc",
  "transcription": " The Santa House is a special place in Arbatum where the spirit of giving shines.  When the doors open, local parents pour in to select donated gifts for their children. They get to shop for presents they couldn't afford to buy. Volunteers unpack the donations. This is the room where we accept and get gifts ready to provide out into the space for parents. They stack the shelves.  And they help families find what they need. There are toy guitars, big kitchen play sets, board games, coloring books, crayons, clothing, sports equipment and stuffed animals. It's been hundreds of toys that have been donated with very generous people in the city of Arvada and other locations who've provided.  toys for the girls, toys for the boys, and toys for teenagers. You'll even find what you need to wrap the gifts. I'm also putting in wrapping paper, Christmas cards, name tags. And beautiful decorations to help you trim your tree. Enjoy yourself and find some gifts. Dwayne Yous helped create the Santa House after working for many years as executive director of the Arvada Community Food Bank.  is something about Christmas that brings joy and happiness to families and nothing makes a parent more proud than to see the smile on the face of a surprise opening of a gift, whether it be a doll or a fire truck. Those kinds of things are important to us to be able to have other families share this opportunity that they might not have if we weren't there to help them. Now in its eighth year, it's served more than 16,000 children in more than 5,000 homes.  families. It's a dynamic citywide collaboration that includes local service groups and organizations like the City of Arvada. The city holds drop-off sites and toy drives to collect items. Local elementary schools choose the families who get to participate based on their need.  keep track of what we're doing. It's been a big community effort and without community none of this is possible for our extended families. It's the result of months of work by people with helping hands and big hearts and everyone involved gets to take part in the magic of the holidays. You can bring new unwrapped gifts for infants through age 14 to the Apex Center.  Apex Fieldhouse, Community Recreation Center, the Racquetball and Fitness Center, or the Apex Sim Street Center. This year's Santa House is in the Arvada Plaza Shopping Center, 58th and Independence near the Santiago's Restaurant. It will be open for shoppers from noon to 4 p.m. Tuesday through Saturday, December 4th through the 21st.  you"
}