{
  "video_id": "CXHHlzlGEOg",
  "transcription": " Sparrows Pick Kit  unique multi-cam case. And this case is a little bit different because the picks don't fit in here. They fit down here. So when it's on your tactical vest, it flips down, the picks stick out here, and you're able to see what you're doing. Alternatively, it comes with a malice clip. So you can take the malice clip and slide it through here.  Clamp it down and now you can put this on your web belt. So very good tactical lock pick case. It's all heavily stitched. It's been melted off where it needed to be. Really nice Velcro. It doesn't look like it's gonna pull out on you anytime. It even has Velcro here to stick to your tactical vest.  So all in all, very heavy duty pick case. Real thick construction. So that being said, this is really nice. This malice clip isn't just going to pull apart on you. That tab locks in there good. So you can actually see some scratches on here just to be able to raise that tab to get this thing loose. I actually had to stick a flathead screwdriver in there  and pry it up. So it's not going to come loose on you. And I believe I actually stuck it on there upside down, but oh well. Let's go ahead and stick that back here. And let's go ahead and take a look at what we get in this kit. Okay, now what the Sparrows website says you get are these eight picks here. You get the, well, Snake Rake or Best Buster. You get a Worm, a Half-Dead  diamond, a, oh I think they call this a steep hook, then you got an offset hybrid, a normal hook, a city rake, and a high reach. These are all in 25 thousandths and fit and finish wise they're all pretty well done. There's no sharp edges and the edges are rounded off. If you want to do a little bit more finishing on the  you could, but these are ready to go right out of the package and I really like that. And take a look at the short hook. Very nice hook, well finished, nice and thinned down right here so you can reach into some really narrow keyways. And this is probably my personal favorite hook out of the entire Sparrows lineup. I've had several of them and I've broken several of them.  The kit also says it comes with three tension wrenches. You get a wide one, then a not as wide, and then a little bit skinnier one. But in my case when I ordered this, it also came with three Z-wrenches. So I didn't order these separate, and it just shipped with them. So it may be something new  shipping with these or they made a mistake on my part but it's not listed as the stuff that comes with the Sentry Kit. So, how do these picks perform? I've used Sparrows picks a lot and I don't need to test these by picking a lock for you. I can just tell you from my experience these picks are fairly strong.  They hold up pretty well. They're not the hardest stainless steel. They are slightly magnetic. But for the price point, you can't really go wrong. This pick kit on Sparrows webpage is... let me pull this one up real quick on my computer.  computer and scrolling down is a $49 Canadian and with the exchange rate it definitely did not cost me that much so well well worth the money a lot of people say that these picks aren't as good as Peterson picks and stuff like  like that, but in my opinion, I like Sparrows better than Peterson. That's mainly the type of picks I started with and I continue to use to this day. Now I've gone and I make my own homemade picks and I use those more than anything nowadays, but Sparrows picks, fantastic, second to none in my opinion. Now let's go ahead and show one other thing I picked up that they just recently started.  50 thousandths pry bars. It's been a long time waiting for these to come out by Sparrows. They've had three different thicknesses before and now they have a 50 thousandths to add a fourth thickness. So I'll throw all of these right here. These are the rounded edge with the serrations and this is the dog ear on one side and a short one with a serration on this side. So really, really nice.  this one's probably my favorite one out of them. I've already been using this one and I used this one probably about on 20 locks this weekend. Yeah, I was picking a bunch of stock locks and it fit in every single one of them. So very, very awesome. Anyway, guys, that's what we have with this pick kit. The good, it's Sparrows, so you're looking at  looking at high quality, you're looking at a very high quality kit. And the only thing that I would change in this entire kit, and I might just be picking nits here. The only thing I would change is I would swap out that City Rake for a Triple Peak. That's just me, I'm not a big fan of City Rakes, I don't really use them. That's about the only pick I would swap out.  The other thing that I'm not super fond of is the plain handles. Now these handles here, I think what I'm actually going to do is I'm going to epoxy on a hard rubbery plastic as scales, sand them down and make them some custom handles for these. And I'm probably going to keep this kit intact. The case, like I said, fantastic.  so that's another good and if they did indeed add these three that is also a huge bonus because these z-wrenches are my favorite tension wrenches for bottom of the keyway not a super big fan of these twists i find they flex a little bit too much but i love using these z-wrenches all right um i don't think i have anything else for you right now guys but uh what i recommend this  Hell yes, I would recommend this pick kit. I would recommend it to a beginner. I'd recommend it to an intermediate. I'd recommend it to any military member that would want a pick kit, especially for breaching. So there we go. Everyone, please stay safe. Don't do anything illegal. And as always, please like, comment, and subscribe.  Music"
}