{
  "video_id": "Cxwgop7XICY",
  "transcription": " What's the weather like today, Smith's crotch? Am I mad at the people who just come to the military to grab what they can and get out? What's up? I'm only mad at them if they do not want to do the job. You know what I mean? If they're just here so the army can fucking work their way through something, you know what I mean?  I mean help help them work the way through like paying for it strictly strictly paying for college not getting a different type of education all here You know what I mean like haven't you learned anything since you've been here? I have I didn't have a choice but I have to add to learn. Yeah, right. You didn't have a choice but to learn you could have said fuck it and went home So uh He shoves his tongue on our throat for about 15 minutes. Nothing serious. Can't you punch me while we're boxing?  If you could you would, what does that mean? What you just don't know how or you're a pussy?  Now tell the story!  How was your date? I've never been on a date before man. She was like, yeah it was great. Kiss me. Kiss me.  So I went to the beach, had dinner and everything, went to her house. I got laid. I don't believe it. He fucked me. He's like, no, you're my sister. No, hell no, that's too far. Pussy. Nobody calls me pussy. Then after it was done, she said to him, damn, you're better than that. Then he says, that's what mommy says.  We had just gotten done doing the classes on fucking walking in fucking rockets and everything else and two days later They're walking fucking rockets in on us I was so pissed I was fucking furious I was like these pieces of fucking shit I cannot get off that topic it bugs the shit out of me I want to punch you every time I think about it And I think about it a lot he's thinking about you Smith he's trying to take care of  Hooters  That should be a qualification we'd like. That's adequate. Nah, I'm thinking Carl's Jr. only because I like that saying, that slogo. If it doesn't get all over the place, it doesn't belong in your face. You know, you could say that about a couple girls out here. Dude, are you sure? I'm not sure I want to tell you that, but... Come on, tell me. I'm good. You can't start something and not finish it. Why not? Because that's not the way the Army works."
}