{
  "video_id": "D1DN3IH-Goc",
  "transcription": " This is Sparta!  I'm gonna beat Ramirez. Look at number 9. So this is the competition. No, I'm not hungry at all. Number 9.  Nick's food is here right now. Pierre's still waiting on his, nervous, having heart palpitations. But it's not that much, so... Hey, hey, why are you stealing my food? It's not that much, just four McDoubles and a fries, Pierre. You can do that, right? No, double doubles, not McDoubles. Four double double. What do you think, Pierre? I'm gonna kill this. You think so? Dude, no. Look, you can tell that he's shaking. Look at his hands. I'm shaking. So what about like this? Don't try and do this quick. Okay, whoever wins, brother. You don't have to do it quick. You can do it slow as a turtle.  No, no, no tying No, it isn't one two Here's taking his sweet time. He thinks is a joke. Oh look at the groom. Here's over there killing it, bro. Oh Come on. Well, I'm done with one. Come on Come on come on come up here come up here  There we go there we go come on all right, we're almost there come on Almost done come on six hours later Nick Nick I feel The the sorrows are coming man. That's sad music. They play at the funerals, man  Mr. Pierre, how you feeling over there? Don't man, come on Pierre! Hey, come on Pierre, don't do this to me. This is Revolution Fitness, bro. Come on man, come on. We're almost there. We're at 2 minutes and 48 seconds. I want this under 5 minutes. Come on.  It won't it will it will I believe in you Sean Rivers believes in you bro the most important person Hey, Nick tell the camera. How you feeling right now? That's me here, how you feeling over there? Come on baby one was done come up here show whose boss nice finish half of that at least come on one two one two one  There we go, there we go, there we go. Ooh, I like it. Come on, come on. We're almost done, baby, almost done. Oh, shit. You better look to your... Y'all still got these left, man. Come on, Pierre. Pierre, tell me how you feeling over there. Hey, Pierre, show the camera. How is it looking, man? Hey, flip your hat backwards, Pierre. Come on. That's for the lighting, Pierre. Flip it backwards.  Whoever taps out has one more All right, come on man, we're almost there come on Come on man people do this in six minutes y'all at 437 come on. I don't know but they're smaller than you dog. Come on  I don't feel anything  start slurping up them fries bro come on Pierre emotional support how do you feel that your boyfriend is winning right now come on Pierre he's about to start slurping up them fries can you do me a favor and get your brother water if you don't mind I appreciate it I'm sorry thank you so much  Hey, hey Pierre, look what he's doing man. Come on man, this would make Reza Kani unhappy with you. Come on Pierre, we're almost there. People do this in 15, people do this in 8 minutes. Y'all are already at 10.17. Oh shit, let's go. Like four at a time. Remember back at your house that one time with, what was his name? Omar Hernan, no, no, I don't remember his name. Come on. Don't do one by one, that's not gonna do you anything. He's already winning, look, Pierre's giving up.  Yeah, baby, that's what Yes, yes, yes, thank you go baby come on Yes Come up here don't laugh don't laugh come on come on. Here's water. Here's water come on come on come on come on  Oh, Nick Ramirez is almost there, Pierre. You're not looking any good. Come on, come on, come on, come on. We're almost there, baby. Come on. We're about to have another champion. Come here, world record. Oh, shit. Mr. Ramirez, I'm sorry to say that there's three more strikes before your funeral, dog. Yeah, you better get all... Oh, there's one more. There's one more. All right, time, time. That's it.  You finished first. He did. Nick Ramirez. That's one of my girlfriends who has. This one. You want to get green? Yeah. He brought emotional support. I didn't brought it. That is no excuse. What's your name for the camera? Oh wait, no. I'm not green. No, you're not ugly green. You're cute. What's your number? Alright, so Pierre, we're almost done baby. Come on. Come on Pierre, we're almost done. Get him out of here. We're almost done man. So tell me how you're feeling right now. You might as well finish it.  Another pleasure we saw who the winner was mr. Nick Ramirez over there suffering But it has been it has been an amazing experience Now they're both driving one of them is driving back in my car. I'm gonna be having a bag. It's a great experience Revolution Fitness, baby  Who let the dogs out?"
}