{
  "video_id": "dehlqfIR6tA",
  "transcription": " Hey there, it's Patrick again. Now if you have Parkinson's, there's a part of your body that is the most important part or location and you need to manage that area and you need to maintain it. And we're going to do that today using an umbrella. So if you like this, give me a thumbs up and click the subscribe button below to receive notifications of my new videos. So let's grab an umbrella and have some fun.  Okay, here we go. So when I developed this drill, I developed it using my brain and body bar, a product I developed that if you want to learn more about, you can visit my website, smartxpd.com, and it'll tell you all about it there. But this is actually a really perfect product to do this drill we're going to do. But if you don't have it, you can use a cane or in the case of this video, you can use an umbrella. You're like, what's he going to do with the umbrella?  the  is actually the area right here between the shoulder blades. Now, Parkinson's can affect structures and areas of the body that are really hard for us as humans to get in contact with kinesthetically or just sensory-wise. The posterior structures, the internal structures, the spine. You'll see someone with Parkinson's sometimes and they're drawn forward and they're tight. The muscles in the front are tight and the muscles behind here are stretched out and weak.  We want to not be drawn into this world down here We want to live up in this world here if we have Parkinson's and a real good way to do that is to get in touch with the structures that are behind us our posterior structures so we can stay steady and strong so this is a drill to help us get in touch with the area I call ground zero which is the area behind the shoulder blades right there As humans were very interior focus our eyes are on the front of our head and understanding stuff back here is tough So we have to find ways  to get in touch with that area. So what we're gonna do here is we're gonna take an umbrella and we're going to put your hands slightly wider than shoulder width and you're gonna bring it all the way up to the chest here. All right, almost against your chest and you're gonna try to bend the umbrella or the cane, whatever you're using now. So in other words, try to make a little, the bend here in the umbrella pushing upward. And as soon as you try to bend it, what you'll feel is the muscles behind you, behind your shoulder there, fire. And that's great.  Holding it here and trying to put a little bending force on the bar is great because when I just relax and I lower my hands, look at the position of my upper body. It's perfect. I'm nice, wide and open. And that's where we want you to be. And that's where we want you to stay. And this is a great drill at helping us get to that position and really maintain that area behind the shoulder blades that's so important. So we're going to hold it again about a little wider than your shoulders here. Hold it against your chest.  a little pressure on the bar, a little bending pressure, maintain that, and we're gonna press the umbrella forward and pull the umbrella back. Press forward and pull all the way back to ground zero and specifically right to this exact position, not out here, not here, right up against the chest there, out and back. And now we're gonna press upwards and pull down right past your nose to exactly ground zero. Press up and pull right back down.  Now we're going to press up to the right and pull back down. Again, press up to the right and pull all the way back down, rotating back to ground zero. And now to the left and pull back down. Don't forget to keep a little bit of a bending pressure on that umbrella up and press it back down. So now we're going to press forward and pull back to ground zero. Press upward, pull back to ground zero, up to the right and pull.  and pull back down, rotate forward, up to the left, and pull back down. Again, so we're pressing forward, we're pulling back, we're going through different planes of motion, but returning to the very specific ground zero position, up to the side, and back. We'll do it one more time. Press forward, pull it back, press upward, pull back down to ground zero, up to the right, pull and rotate back, up to the left,  and rotate back. Now put one more bending pressure on it with the arms and relax. Lower the umbrella and there we go. We got a beautiful open chest. It's not overly intensive to try this. You can do it during your workout for active rest but just getting yourself in touch with the area behind the body between the shoulder blades and maintaining that. People are going to notice you're standing taller, you're standing stronger. If you like this give me a thumbs  up, click the subscribe button below, keep moving my friends, I'll see you at the gym and the best part about it is if it rains, you're ready!  you"
}