{
  "video_id": "DHI_NLr_MQY",
  "transcription": " Hi, my name is Christina and I'm a Wig Store employee.  I'm Trenisa and I'm a WIC participant. Today we're going to a local citrus farm that provides fresh produce for our stores. We're going to find out from the farmer why we should eat seasonal local foods. Look at those cheese jams. Yeah, look, look. Hi. Hello. Hi, welcome to Ojai.  How big is your farm? We have five pieces of property and right here we have about 15 acres that are planted. Wow. We never spray the trees. The trees are totally chemical free. Okay, that's a good question. That's one of my personal concerns. Yeah, and we don't treat the fruit either when we pack it.  A lot of fruit is treated with waxes and fungicides so it has a longer shelf life. But our whole deal is that we want to pick it and get it off the shelf and into people's kitchens. How do you know when they're ready to be picked? When they taste good. We really make an effort to grow food that we like to eat too. All you need to do is put a bunch of fruit in front of the kids. Right. And give it to your family and you're not selling it. Exactly. For freshness we pick to order so that means someone places an order and we pick for  and it gets to the grocery store as fast as possible. Wow, that's awesome. Which is a huge difference from some of the bigger farms. They'll be two or three weeks old by the time they're there. You know, the longer fruit sits around, the more the vitamins break down and the flavor starts to get lost. Right. This is so good. They're so juicy. I love you. Squeezing too much, the juice just falls down. I have all this juice right here. And it's awesome to know that we would be getting them just like this in our store just a few days later.  a rice and butter up a tree. Do you really grow this many every year? We actually counted all the fruit one year on a tree and there was about 1,700 pieces of fruit. On one tree? Yeah. What? Wow. And on the years with a big crop, they produce a lot of these small sized fruits. The smaller fruit comes out first and we'll put it in these boxes  for farmers markets. And then this is the medium-sized fruit will come out here. We pack it into boxes. You know, more of the money that you're spending on your fruit, if you buy local, is going back to the farmer. So it really keeps us in business and employs local people. You're really supporting local economies when you buy local. You're supporting families such as myself and my family. I mean, you're getting quality here. And it's freshness and it's exciting to  be able to offer this to our customers on a day-to-day basis. I love the taste, the smallness of them. Absolutely amazing. So I know that brings you joy to hear that. Oh, it sure does. The best part about farming is growing something that I love and being able to sell it direct to people that also enjoy it. Today we found out many reasons to eat seasonal local foods. What are some of your reasons?  Los Angeles, Riverside, Orange, San Bernardino County, San Fernando Valley, and now in San Diego. Mother's Nutritional Center has so many locations for me to shop for my food vouchers. I love it. Whether I am home in LA or at my mom's in Fontana, there's always a Mother's conveniently close by. There may be many options, but nothing compares to Mother's. Mother's Nutritional Center. Today we found out many reasons to eat seasonal local foods. What are some of your reasons?  It's always good to have more jobs and the food tastes fresher because it comes in a lot faster. The less time it takes to get here, the sweeter and better tasting they are, so it's really convenient. They're nice, fresh and juicy. I give them to my children every day for snacks. The kids, they love it. They definitely love the fruit. Actually way better than the grocery stores. They're sweeter, they're delicious. They come straight from the tree. Being that they're local as well, there's no chemicals to preserve the freshness. Getting it to us.  my children are eating, what they're eating, what the nutrients are. Knowing that, you know, it comes fresh, it's in season, you feel like you've done your job as a mom. Bye!  you"
}