{
  "video_id": "DN5G6D4dBzg",
  "transcription": " So I just finished my workout, just sipping on my coffee. I'm about to have a client here soon, so I'm gonna do their photos for a training one session. So I'm gonna kind of just clean up the little studio area and try to quickly decorate it. And yeah, then I'm gonna take you guys along with me this weekend. Not really a lot of exciting things going on, but I think it'll still be a fun weekend.  have to get a dryer later today because ours broke. So I already finished up my session and I filmed a little video for you guys on my DIY gel nails. Now we're gonna go adulting and buy a new dryer. Show them your face boo. Look at my face. This guy is showing her face too.  furniture your little model we're getting some soil for our peppers that my grandpa gave me so we're gonna have the best peppers on the block so I just finished up my makeup but just did something really quick it's not the best there's some mascara here but we're on our way to Tampa  to spend some time with my brother and Asa and then find some photo spots. Hey guys! Hey! What's up? Hi! How are you? Good, I like your hair. Thank you. I just went to go get pizza. Hi baby!  What are you doing? Playing with your dollies?  natural why are you stopping? I feel like I'll be better on this side which leg should be on the front and back? huh? which leg should be front which leg should be back? oh which ever one feels like you're more balanced neither one  I feel like that George Lopez song is the same as this. Ready? Go! Oh, I want to put it on now. This thing is tough. Be careful.  Stop it turn You hear your music lowrider Let me try one more time It's so nice  It's so thin.  So I forgot to tell you guys that I won in the game but I'm pretty sure Bupu let me win because I was kind of sad and I'm competitive. But yeah we're still wrapping it up here, let Bupu finish up his breakfast round and we're gonna head out and look for some photo spots.  I don't think I told you guys what the white shirts were for but I thought this would have been so cute if you had a little kid oh my gosh but they're for our family pictures  Cute.  Alright guys, we're on our way home. It was raining the whole time that we tried to look for a spot but she had to wait it out. I did find a white shirt for me and then  got some ice cream, ate like early lunch dinner and we're gonna head back home. So that's it for the vlog guys. Bye! Say bye boo. Bye boo. No, you say bye to the camera. Bye."
}