{
  "video_id": "do2t7F13NNA",
  "transcription": " Hey everyone! So right now my friends and I are about to go head over to San Diego to have a girls trip weekend there. So yeah, we just felt like we needed to get out of Tucson so we're really excited to go and I'm gonna go ahead and show you what I'm wearing. So I'm just wearing a black oversized denim jacket, one of these Alphafit tanks, some Lulu leggings, and then my Air Force 1s. So yeah, it's actually pretty hot right now so I might just take this  check it off but yeah that's what I'm wearing and yeah so right now we're all packed and ready to go so let's go ahead and get into the video. Okay so we just got to San Diego and in our room  Here it is. We're staying at the Courtyard Marriott I think. And then right now, what are we going to do right now? Probably just get ready, change, and then head to the beach. And then her friend goes to USD so we'll probably meet up with her and then go to the campus and check that out. I love USD's campus so it'll be fun for them to see. And yeah, that's what we're going to do right now. Okay, so we're now at the beach.  and it is so beautiful here. The weather this weekend is like seriously so nice. So I'm glad we decided to come this weekend. But I forgot to bring sandals which I was dumb about. Actually no, I have sandals but I forgot to bring them like for right now. Oh they got smashed both! Yeah.  Okay, so right now we're at Belmont Park and we're gonna ride the coaster. You excited Emma? So excited! Okay, yeah, so we'll do that right now. I've never been here, so I'm actually excited. We'll see if it's fun.  at our hotel now and we went on the roller coaster and that was interesting. Yeah, I don't think I would go on again. I think it was like made out of wood. It was just like really aggressive. We were all saying. But yeah, that was interesting. And then we went to Cafe Coyote. Really, really good food. We had dinner and then we walked around Old Town because our hotel is like right behind Old Town. And then now I think we're going to chill out for a little bit and then probably head down to the hot tub.  and then come back and probably watch movies. And then we have a whole day here tomorrow, so not exactly sure what we're gonna do tomorrow, but yeah, that's what we're gonna do tonight. Okay, good morning guys. So we are in Mission Beach today and we are going to have lunch at Board & Brew and then after go head down to the beach and be there for a few hours. And then not quite sure what we're gonna do after, but that's gonna be our plan for right now. So yeah, we're gonna go have food and then head over to the beach.  I left my glasses at home, so I'm borrowing my friends right now  But we just left the beach and got ice cream and now we're at USD and they're gonna tour the campus and see it and then after probably head back to our hotel, get ready and go have dinner. But yeah, right now we're at USD's campus and they're just gonna go see it because they've never been here before. I came here when I was in high school to tour and yeah, it's so pretty. So they're gonna go ahead and see that.  Okay guys, so we just came back from dinner and now we're kind of deciding what we want to do. Our options are either go in the hot tub again or just relax and watch. I mean both are relaxing but the other option is just to stay in.  and watch a movie. So I don't know what we're gonna do. Okay, good morning guys. So today's our last day here in San Diego. We just checked out of our hotel and now gonna just go have breakfast at Better Buzz and get coffee and stuff and then probably be at the beach for a little, so yeah.  Alright you guys, so we are now back in Tucson. I forgot to close out the video yesterday but we did get back here pretty late but I hope you guys enjoyed this video and seeing like a little getaway weekend that we had and if you guys enjoyed it be sure to give this video a thumbs up and subscribe down below if you haven't already and I'll see you on my next video. Bye guys!  You"
}