{
  "video_id": "DYQMViyqMnU",
  "transcription": " naked kids into produce. It's torture. Even Celine Dion's baby's in there. Which she probably enjoyed. A little peace and quiet. That kid probably can't wait to get old enough to grab a razor. Yeah? You would like to be her kid? Dave Matthews' band sucks. If that upsets anybody in here, you're the problem in our country.  If somebody had a difference of an opinion than you, you felt personally attacked. Instead of focusing on a bigger issue, why do you listen to shitty music? You think it's trendy for young kids in Japan to get tattoos of words written in English? Think they're walking around, check this one out, it means love and water. My friends love tattoos. Are you kidding me? If you're gonna get something written on your body,  I'm dumb, that's it. That way in 10 years when you go, why did I get this? You can be like, oh, me dumb, not talk, her tear balls. My friend's like, it's an artistic expression. I'm like, wow, it looks like a butterfly above your cooter. It's like a stinky caterpillar. Daddy, where do butterflies come from? Well, everyone knows, boy, it's the vagina.  You ever been in your hotel, you turn the lamp one switch, the light doesn't go on, then you turn it again and then it does? It's fucked up. That's an easy problem to fix at the lamp factory, but you know it's some pothead kid going, hey, you just have to turn it twice, man. Just keep it going. No, don't keep it going, fix it. So now when I'm in a hotel, I turn it once, it doesn't go on, I don't read that night. I wait until the next night, and then I only have to turn it once. Problem solved.  Who wants me on their corporate team? I'm a hustler. I ask questions. I think we should legalize marijuana in this country. Yeah, yeah! So potheads have nothing to talk about ever again. You are so annoying. Nobody ever sees me taking this angle, but I do, with some force, okay? Grow up and do coke like an adult.  How many people in here have never waited tables in your entire life? Not a single day. Okay. Okay. You people are assholes. Huh? Huh? Everyone should have to wait tables for one year of their life so they realize their ranch dressing isn't that fucking important. But I need it for my fries! Well, you're a sick freak who should be beaten.  Because that is disgusting. You are one step away from dipping mayonnaise. And we remember that kid in school, don't you? You know what he's doing right now? He's an al-Qaeda."
}