{
  "video_id": "DZpVcpmuCI8",
  "transcription": " Hi guys, welcome back to my channel. Today I'm doing a tutorial on this look which is a Poison Ivy look. For the whole month of October I get to dress up at work which is really exciting. So I've got lots of ideas for coming up Halloween videos. And if you are interested in this look, please keep watching.  I used a primer on the high points of my face to give myself hydration. Then I went in with my normal foundation which is stroke of genius in look 1. I always apply this with a beauty blender because I find it gives that really nice velvety coverage. Next I used my NARS radiant creamy concealer in vanilla just underneath my eyes and on my eyelids.  with my Camera Finish Close Up powder. This is just a translucent powder. Using the lip liner Rococo Red, I started to fill in my eyebrows. I find this pencil though had more of a pink tinge to it instead of a true red so I went over with the colour Discs Scarlet Woman. Then I set my eyebrows with Anastasia Beverly Hills Clear Brow Gel. Next I'm using the  Pro palette concealer. This is the correcting concealer so it has a green shade in it. I use this on the high points of my face. Using the colour Ultra Suede, I'm going to set over my eyelids as well. Then using Lucky Clover, which is a bright green, I'm going to define my crease.  To re-intensify that I'm going over with Jada Jeannie on the lid. Then using Electric Forest, which is a slightly darker green, I'm going to go through my crease again. I took all of these colours underneath my eyes as well.  which is another loose eye dust. It's got a nice shimmer in it. I went through my crease and re-intensified that green and winged it out slightly. Then I went back with Lucky Clover and I put this on my cheekbones as my contour. I just buffed this colour out with a clean blush brush as well.  Next with my favourite highlighter, this is the Reflective Refining Highlight Powder. I went over the high points of my face. Then I used matte eye ink for my winged liner and Benefit's Roller Lash just to coat my lashes in a little bit of mascara.  my hair on the sides like at the front. I bought a little tiny flower crown with green and red flowers from this shop called Gloss. It's really, really cheap makeup and they sell hair accessories and stuff. Then I put a few little vine leaves in my hair and one up here and I might put some on my body. I'm not really sure yet. I took Jade the Genie again and went over my cheeks and just gave my cheekbones a bit more of a glowy look.  Then I used the Rococo Red lip liner again and just lined my lips. Then I filled them in with the color Veronica, which is just a mattastic red. And that is basically the finished look. I decided to add some green lashes. They're called Lotus and I decided to cut them in half so it was just the ends.  Thank you so much for watching this tutorial. I hope you enjoyed it. If there's any other looks you have ideas for, please let me know down in the comments. Feel free to subscribe and follow me on Instagram. I really love posting on Instagram and you guys might get some sneak peeks of the looks I'm going to be posting.  on YouTube. So I'm going to go to work now and I will see you on my next video. Bye!"
}