{
  "video_id": "e7pMil68H6M",
  "transcription": " Subscribe to our YouTube channel and don't forget to click on the bell icon to never miss an update.  are currently with us for unboxing. So without any delay, let's get started. First let's have a overview of the box. Here you can see this Zenfone Max Pro M1 4G VoLTE, supports VoLTE that is Jio and Airtel and Vodafone now. Then we have a logo of hardship hint which is made of phones.  phone in heart shape.  36 5000 milliamp battery and other specifications contact this this etc then we have importer of the device that is Flipkart India and now let's unbox this  the  In rectangle but in round shape and then your serial number warranty information and user Now here we have our phone We will take a look afterwards first of all, let's see other box contents Yeah, we have pull tab now  Here we can see the power adapter. It's Viking color. With ASUS branding on it. And the wattage is 5V 2A. It supports quick charge I suppose by OTA update. But currently it's not supporting the quick charge because it's 10W maximum.  be  Now let's boot up our device.  Now, our phone has booted up. So, first of all, let's have a go through of the phone from the exterior. Here you can see our Full HD plus 6 inch display which is 18x9 ratio. Then you have the front camera which is 8 megapixel. And the speaker grill as well as the our sensors.  On the bottom we have the primary microphone, the headphone jack, the power USB cable and speaker. On the left we have the sim ejector tool. It accepts two sim cards and one microSD. And on the right we have the volume rocker and the power button.  has a little different texture in the polymarker. On the back we have our dual prime camera setup which for bokeh effect and we have this single tone LED flash, finger print sensor and the Azure logo and here this extra serial number extra information and Azure claims this color is grey and I don't think this is grey I  and if I speak from my point it's like gross grey and many will agree to this as well so here I have a device which is let's see the out of box android version here you can see the android version is 8.1.0 and it has  go to pay something new something payment app and here you will see the 50% of the storage is used 15% of the storage has been used and you have only 54.26 free the battery is 65% and I from my using this device I feel the display feels a bit sluggish then  other devices so we will have a yeah and it is powering a snapdragon 636 processor powered by snapdragon 636 has 4 gigabytes of RAM and 64 GB of storage which is great considering the price of 14,000 inclusive of all taxes and it does have facial recognition as well  So here it is our unboxing of Zenfone Max Pro M1. Like the video if you like it, dislike the video if you dislike it. Leave a comment."
}