{
  "video_id": "E97XgSpJh3w",
  "transcription": " What's up guys welcome to another episode of LJFishing. Today I'm going to be talking about angler. There's one thing I can't stand.  What about fishing is other fishermen who don't care or think they own the water? Think they're the only one there just drives me nuts, and I've had a recent couple encounters Not like really an encounter. I guess but more or less a couple instances where anglers were not being adequate at all and you know just really drives me crazy, so I looked up a few  I  there. Have your rods in the boat ready. Have everything ready to go. All you need to do is unstrap the boat and drop it in. Don't be the guy that gets there and has to put all his rods out of his truck into his boat. Has to put oil in the motor. Has to put all of his gear in the boat. All that junk. Don't be that guy. Be ready when you get to the ramp. When you're ready to go.  The only thing you should have to do like I said is unstrap the boat take the transom mount off and roll around. Number two, control your wake. It sounds kind of weird to say but there's so many guys along fishing. I'll be fishing like a shoreline and there'll be another bass boat driving by me like 10 feet going like 50 miles an hour and it's like are you kidding me?  So don't be the guy that flies by other bass boats. Be respectful. Either avoid them or go way out the way. Or if you have to go by them, slow down. Don't ruin their fishing because you have to get to the next fishing hole as fast as possible. Nothing is that important that you need to get to the next fishing hole as fast as possible unless you're at the friggin' fourth wood cup. So that's number two.  I  You don't need to litter.  I mean if people are tubing and stuff on big waters and stuff like that, they have the right to tube. I mean, yeah, it's disrespectful if they're going right by you, but I mean, just because there's a constant wave coming your way from other boats and stuff, doesn't really give you a reason to get mad or anything. Honestly, everybody has a right to the water. So yeah, definitely, you definitely don't own the water. Alright, one other thing I want to talk about  of  And then gets a ticket or goes to jail or whatever. Don't even take the chance. Get your license, be legal, make sure your boat's registered. Have all the papers with you. I mean, just don't be a difficult person. I hate difficult people so much. You know, just be prepared at all times. It's just grinds my gears when people aren't. One other thing I guess I really want to cover.  I don't know if it's really fishing adequate. I guess it could be kind of. Take care of your fish. You know, hundreds and probably thousands of people are fishing in the same lakes you are every year. Take care of the fish. If you're going to put them in your well to keep them for a while or show off or whatever you're doing, make sure that your well is working correctly. You've got a good air right here. You've got a bubbling system or anything like that.  I mean there's all kinds of accessories you can buy to improve your life while improve the life of the fish While they're in the well, just take care of them. I mean It's oh I nothing Makes me more mad than I know we're bass fishing here But like when I go up to the boat ramp and there's a bucket full of bluegill that were thrown back in the water And they're all dead Like what's the point of that? You're gonna put them in a bucket keep them  I don't understand why people would do that. So just make sure you take care of your fish. If they're starting to not look healthy in the well, get them back in the water. Constantly keep refreshing the water in the well. Stuff like that. Because other people want to fish there and they want to catch that same fish that you caught that you're keeping to show off. Stuff like that. So just make sure you keep them healthy and don't ruin the experience for everybody else.  The last thing I want to say is just don't be a jerk on the water Don't be the guy that literally is always looking for a reason to like yell at somebody or get mad at somebody There's no reason for it. Okay, you're fishing. That's relaxing. It's fun Don't be the guy Who's just big jerk? Okay, if someone asks you a question answer the question I mean if Somebody has something to say just talk to him like you don't need to be a jerk to everybody Someone comes up fishing in here  area  things close so they can have an idea that you want to fish there as well. So yeah, that's a big thing as well. Don't fish right on top of somebody. Give people space and just don't be a jerk on the water. I don't know if this video really helps anybody, if it's anything anybody wanted to hear, but it's just something that's been driving me nuts lately because I've been encountering several disrespectful fishermen on the water and I just, I don't understand why people are so  so  stuff like that. You can go to my twitter page ljfishing16. If you need anything shoot me an email ljfishing16 at gmail. Like the video, subscribe, comment below. You guys have a good one. Stay safe out there and be a respectful fisherman.  you"
}