{
  "video_id": "eMmpc9xxQNU",
  "transcription": " Hi, I'm Liz Imperio and I'm artistic director for Hollywood 5 and today I'm teaching jazz. Being in Liz's class is such an amazing experience. She has so much knowledge about dance. She's so inspiring and she's experienced so much in the business. You can never expect one thing from Liz. She's so versatile and so you want to soak in every moment of her class.  When you see that people are hungry, you can't help but feel the electricity running through your body. Next thing you know, you're in a completely different world. From the second she walks in the room, you know immediately that she's going to push you super hard. You just dive straight into choreography. You never really know what she's going to throw at you. If you consistently morph the environment of the movement, then suddenly these kids see that there's more to dance, that there is connection, that there's  There is storytelling, that there's focus. She's not just trying to teach you choreography as much as life lessons that you can apply to every other dance that you've learned. All of the moves and everything has a story behind it. She genuinely cares about every single one of her students and she wants every single kid in her class to be pushed and to get the most out of the class that they can get. You really get to appreciate all the movement and just feel your best at that moment. That's what I'm looking for. The person that I connect to, the person that is willing to actually have a conversation with me  through their movement. Suddenly, I want to be part of the conversation. Next thing, I want to dance with them. I want to move with them. Liz never fails to amaze me, and I love taking her class. It was a great time. Everyone had such a blast, and we all kind of bonded throughout the room. And Liz was just, she brought so much energy to the room. When it's happening, when you're experiencing it, it's such a humbling moment. It takes your breath away.  you"
}