{
  "video_id": "EOZpxN6w3pE",
  "transcription": " Hi everyone, it's Kristin Beemer from Living Loving Paleo and today I'm going to show you how to make fried plantains. So if you don't know already plantains are a favorite of mine and my husband's and I usually make up a big batch for the whole week. So I'm going to show you how I make them, how I store them and how I reheat them. Plus I'm going to tell you all the difference between the different kinds. So one of the biggest questions I get is what makes them different? How do they taste different? Why is one green? Why is one yellow?  talk all about it. They b kind of plantain because it some dark spots on it, w gonna be softer and sweet much starchier, much crisp a potato. It doesn't have  Plantains so today I'm gonna show you how to cook up these yellow ones. All right So this is the part where I'm gonna need a little bit of help That was so crazy and real What are we doing? What are we doing with these things? What are we doing we're gonna chop them up and then we're gonna fry them up, okay, how do we do it?  All right, so is that how you do it? That works. So what you want to do is you want to make sure that you cut off both ends and then cut it in half. And you cut it in half? Yeah, cut it in half. Oh, perfect. OK. Now you got two ends. So now you're going to make a slit in the skin, not through the fruit, down that way so you can peel the skin off. You don't want to go too deep. Oh, yes. My pro.  You're a total pro. It's like you've done this before. Then peel the skin off. Yellow plantains are gonna be much easier to peel than green plantains. I like your method of getting rid of stuff. That works too. You can cut them however you want this way, but I usually like cutting them at an angle. Just cause it's so fancy. Well, we want fancy. And you want to cut them about maybe a half inch thick. He's doing such an amazing job. I don't want to lie to you.  Once the camera turns off, she slaps me. It's true. So I usually cook like five to six plantains a week for us. So today we're going to cook five of them. Now he's getting the rhythm down. You want to show people another way of cooking them, how you can cut them long? Yeah. Yeah, I do. How do I do that? Like you used to do it. Remember how you used to fry them up? Oh, yeah. Like what? Like long pieces. Oh. So you can cut them like this.  into little rounds or boom Just like regular bananas green plantains are less ripe than yellow plantains Imagine that I know who would have thought Oh perfection. He's dead Are we done? Are we there yet? Are we there yet? Yep. Okay time to cook them up. Let's do it. My favorite cooking oils are  Coconut oil or avocado oil both do great under higher heat I personally almost always cook them in coconut oil, but if you're not a fan of the flavor just use some avocado oil We have both those at Costco. Boom Not a plug. Where else can you buy 17,000 q-tips and 94 rolls of toilet paper? Exactly. That's all I'm saying. And now it's time to cook up these plantains. I'm gonna show you just how easy it is. So babe, what I want you to do is put just enough oil in the pan to barely cover the bottom.  You want enough oil in the pan where it's like you can kind of swirl it around a little bit but you don't need to stop. Try not to burn yourself or speak over your wife while she's trying to do the video. So one of the biggest things with plantains especially the more ripe they get, the easier they are going to burn. So I keep my temperature on medium low, keep a close eye on. If they're getting a little too brown too quickly, just turn down the heat.  Next up, we gotta fry the plantains. So that's probably enough for maybe two batches. So what you're gonna do is very carefully put them in a pan in a single layer so they're not too close together. This is not... Yeah, we should probably not demo with using our hands like that. That seems efficient. Grabbing these little heels. This is perfect. We'll see you guys next week when I get these all in there.  I like them sweet, personally. Yeah. But sometimes you don't want them sweet. You want them kind of hard. Whoa. All right, so you're just going to cook them for like two to three minutes on each side as soon as they start to turn brown. You're going to flip them and cook the other side. All right, now let's flip those babies.  While I'm doing that, I have a plate lined with a paper towel, but I'm going to stick them on when they're done cooking. Let them drain a little bit. And I'll meet you in a bit. All right, another note that I want to make is I like using a ceramic pan, which is a nonstick pan without Teflon. That way, these pan pans don't stick to the pan, but you can use whatever you like.  So darkness completely depends on you. Some people like them a little bit more burnt, some people like them a little bit less done. I like them with a nice golden brown. How are they looking? Good. Oh, they're perfect. So now he's just going to take those plantains, put them on the plate lined with paper towels and let them cool off a little bit while we cook up the next batch.  Boom. Boom. Boom.  Will you serve me up some plain things? Oh yeah, my pleasure. Hey babe. Yeah? Y'all done? Yeah, totally done. Um babe? Fine.  Oh god.  Yeah!"
}