{
  "video_id": "ErNL6TY1GfI",
  "transcription": " I  Our contingent's name is Debendranath Tagore. We participated in a street dance event and it was a battle, it was a face-off with 8 minutes of dancing and we qualified and we had a final battle and it was an amazing time. The first round, frankly speaking, it's a different concept. We've never done a battle before like this. So we were actually looking forward to it and were really scared but it was really amazing. We had a lot of fun. We know a lot of us made a lot of mistakes but we went with an intention  intention of having fun, that's all. So at the end of it we were just clapping and laughing that okay this was a fun time. We were shocked, we were absolutely shocked but we were really happy. So I think it helps when you don't expect too much. We actually got only 10 minutes, we got a song on the spot so we were actually really frantic, we didn't know what to do but we figured it out and the final battle we just had to focus, we just had to be together and on the spot think of what choreography we know and we had to perform. It was really spontaneous but one of a kind  something different so it was fun. We started on Monday or Tuesday actually and then our event was on Saturday, yesterday. So yeah, we had four days to do like eight minutes of routine. It was really hard because we usually take about like two weeks to figure out our routine and what formations we want to do. But I think it was a task but I think we pulled it off, honestly. I think we know how to work as a team so yeah, we just had each other's backs. Yeah, so we usually are the main team, we always go for all fests together and we never have issues with each other.  So I think we're so together as a team that coordination is like pretty easy for all of us. It just comes along. Okay, overall I think this is our third year in Polaris and I think this has been the best dance event for us. We really enjoyed this year. So I think for us as Teevise, this is going to be a memorable end of Polaris for us. Yeah, definitely.  Bye!"
}