{
  "video_id": "Exu_s-GTjGk",
  "transcription": " Hey YouTube it's your girl the return queen coming at you with a quick little video of my makeup collection and showing you how I'm all the way nixed out. All the way nixed out. Okay so let's go on a quick little tour.  of my NYX and I guess y'all heard me singing my little intro all the way NYXed out. NYX some people say NYX NYX whatever the case may be. This is my makeup of preference and I told you guys that I do have a lot. Pictures will come up after this. I have my NYX jumbo pencils  in black bean, I have pots and pans, I have slate, rust, gold, iced mocha, cottage cheese, bronze, baby blue, and oyster. And I got these off of ebay from a seller who had  I have had 10 for like $19.99 I think. All of my eyeshadow colors came from a store in my local mall called Pink Heart. I happened to go in there about 3 months ago. So this collection I have accumulated in the last 3 months.  store about 3 months ago and you see the eyeshadows are $4.99 well they were having a 75% off sale so I got my eyeshadows for $4.99 with 75% off so what is that like a $1.25 so my eyeshadows were $1.25 my 3 trios I have is this one right here and it is oh my goodness sorry  you guys. That's um Velvet Blue, Ocean Frost, and Space is in this trio. I have four of them. The next one has Baby Blue, October Sky, and Pacific in that one. The next one is this one and it has Princess Pink, Flame, Flame NCO, and Violet.  in this one and lastly is this one it has like a pink a white and a blue and it has baby pink white pearl and baby blue in this one I only have three of the liquid eyeliner pencils and I got them just so I could try them out I have like a silver color a blue color and then a green  I have three pigments and these came from my local beauty supply store in like a green, a rust color and a gold. They were $149 at my local beauty supply store. If I didn't say the trios were $6.99 with 75% off. I only got three lip colors because if you know me you know I don't do  I don't do lipstick much I only do lip gloss so I decided to go with colors that were not too too off or would look good with lip gloss over them and still wouldn't be too bad. So I got it in like a... let me see is there a name here... this is called Sparkling Flower. I'm going to stand it right there.  This one is called Sparkling Gold.  Sparkling Champagne.  skin complexion it looks so much like a natural line on your lip. I went back to the store and obviously somebody got my memo before I was able to get back to the store because they were all gone. So I am on the hunt for Y2K. If any of my subscribers see it please let me know where you were able to find it if I can run out to that same store and get it in my area. I also have a couple of the lip glosses  glosses. This one is a fave. It is sunshine. Number 118 sunshine. If you ever see this one pick it up. So so pretty. I have frosted beige. I also have it in clear. Like a purple color. A deep dark burgundy.  This is another one too, this fuchsia. But anyways, like I said I just wanted to give you guys a quick little look into my makeup box and the fact that I am a NYX NYX girl and that's all I have for you guys and remember like I always say if they can't handle you at your worst they don't deserve you at your best. Smooches!  you"
}