{
  "video_id": "fDPS-RV0cjc",
  "transcription": " Hi, my name is Courtney. I'm 23 years old and I'm in the worst shape I've ever been in my whole life. I've never been fit or skinny, but I think everyone has that point that they hit, that like max weight where they just know they aren't happy anymore with the way they are and they need to change. The lowest I've ever weighed was around 160. I think I lost  down to like a size 10. So I was feeling really good about myself. I'd never been that small before and it just felt good. I felt like I could wear anything that I wanted to wear. It was just a good feeling. I felt beautiful. I felt pretty. After high school ended, I managed to stay around 180 for about five years until about this past year was when I really started getting  I'm gaining a lot of weight. I got married this past September. I think I was around 190 or so. I tried to do one of those fad cleansing diets before the wedding just to drop some quick pounds and it worked, don't get me wrong. It worked great, but it was just not cost effective. I couldn't afford to keep up with it. I went in for my final dress fitting and I was all excited.  and it didn't fit. It was too small. That was really hard trying to... It's supposed to be happy when you go to pick up your wedding dress. It's supposed to be like this great feeling and I just felt crappy. It's not a good feeling a couple weeks before your wedding to realize that you gained too much weight and you can't fit in your dress. Not cool. Not fun at all. Even being at 190 though, I didn't feel bad.  about myself. I felt fine, I felt happy with the way that I looked, I was dressing I thought to fit my weight. I didn't think that I was wearing... none of my clothes seemed like they were too tight or anything. I felt happy with where I was at. I always told myself if I ever got up to 200 pounds that would be it. I would be in the gym that day working out until I got back to 199. 200 was my max.  and then I hit 200 pounds. And for some reason, I just kept putting it off. There's always an excuse, you know, like, it's so-and-so's birthday, or the girls at work wanna go and get lunch real quick, our friends wanna go out to dinner, we are going to Vegas for the weekend. Always something that makes you put it off, and there's always some excuse as to why I can't stay.  I'll get on kicks where I do really well for about a week or two. I'll work out every day, I'll be eating healthy, making all these healthy meals, eating right, and I'll lose a few pounds and get really excited, and then something happens to get me off track, and after that, I just lose it again. I just eat whatever I want, and all that work goes away in a few days.  all those pounds that I lost are back. I'm now up to 224, which is 24 pounds heavier than I ever wanted to be. It's a struggle to even get up in the morning to get ready for work. I think it's because I know when I go to my closet, I'm not going to have anything that fits me, and I'm just going to feel uncomfortable all day, and when I get ready, I'm not going to feel pretty anyways.  are tight and uncomfortable, but I don't want to go out and buy new ones because that would mean having to buy a bigger size and I'm not ready to admit that I need to buy a bigger size. I guess I'd rather wear uncomfortable tight clothes than buy ones that would fit me. I just want to feel good about myself again. I don't necessarily want to be super model thin. I don't want to be cut or have a super  six pack or anything like that. I just want to feel happy with myself. I want to feel pretty again. I want to be able to go shopping and try on clothes and feel good. I just want to be healthy and that's why I decided to join up with the American Heart Association to do this video series. You know, people always say nothing tastes as good as skinny feels, but I've never been skinny and I know how good cookies are.  I mean, cookies aren't my favorite. I want people to see that it's possible to lose weight. I want people to know that I'm struggling and I want people to be able to see my struggle and I'm hoping that they'll relate to that and go, you know what, if she can do it, I can do it. I know it's not going to be easy and I can't do it alone. I'm hoping that with your support, I can get back to a lower weight and finally feel happy about myself again.  I'm going to actually have to work out, which is miserable. I hate working out. I don't want to work out. I hope this is something that people can relate to. I want others to watch this and say, wow, you know what, like, I completely get that. I have the same issues. I hate working out too. I want to know what you're thinking. And I really need your help.  help and I'm hoping that we can do this together. Let's do it.  you  you  you"
}