{
  "video_id": "FL9j4DUagn4",
  "transcription": " Now on DVD, TV's delightfully offbeat comedy. You ain't get that, right? Northern Exposure. I love this place! Come back to Sicily, Alaska. Of course, Alaska. If I was in Sicily, Sicily, you'd be speaking in Italian there, wouldn't you, eh? Where people move to their own drummer. That's bitchin', babe. And visit with all its unconventional citizens. Excellent idea. Starring Golden Globe nominees Rob Morrow, Janine Turner and John Corbett. Search no more, O'Connell, because what you see is what you get.  nominated for a total of 39 Emmy Awards. That's a very interesting phenomenon to witness, especially firsthand. Brighten your nights with your favorite season. Well, we got no excuse now. of Northern Exposure. I've always felt welcome here. Digitally remastered for sparkling clarity. I see things I never appreciated before. Seasons 1 through 5 are now yours to own on DVD. Hey, congratulations. Season 6, coming soon.  Dr. Sam Beckett stepped into the Quantum Leap accelerator and vanished.  Scott Bakula Oh boy. and Golden Globe winner Dean Stockwell I've seen things that would curl your hair. Quantum Leap. Rediscover one of the greatest and most critically acclaimed sci-fi shows of all time. Seasons 1 to 5 are yours to own on DVD.  Let's do it! Now available on DVD. That's right, sucker. Three classic TV series. Are you serious? Very. Magnum PI, V-18 and Knight Rider. That's quite impressive. With all the fast-paced, heart-stopping action you remember. I couldn't have said it better myself. Magnum PI, V-18 and Knight Rider.  Your favorite season's now available. That's terrific. Season 7 of Magnum P.I. coming soon.  attracting the toughest cases. There's a killer walking around. And the biggest trouble. This award-winning show Don't mention it. features some of Hollywood's best. She's so starstruck, she's speechless. The Rockford Files. Season 1 through 3 available now. Groovy. Season 4 coming soon.  It's perfect. It's jungle out there. You can hear the audience laugh. So you knew it was funny. He's supposed to be some kind of genius like Sherlock Holmes. Is he drunk? No, he's thinking. He's a little. It's a gift and a curse.  you can own your favorite seasons of... Monk. You enjoy it? Life is too short. Seasons 1 through 5, available now.  Don't eat the chicken. Buddy plays one for the police. Let's call the cops. No, no, no. At headquarters, I suddenly and miraculously have a vision. What am I seeing? 8-3-1. On Highway 138. Exactly. And the spirit world thinks it jumbled and out of sequence. You named your fake detective agency Psych? Why didn't you just call it, Hey, We're Fooling You and the Police Department. Hope it don't make a mistake and someone dies because of it. That name is entirely too long. It would never fit on the window.  mystery original series, Psych! Dude, I can't believe you did this! This is unbelievable! What?!  You're a gentleman and a scholar. Oh, I'm sorry. That was a woman. I was talking to. With Golden Globe winner Steve Carell as the boss who doesn't know the meaning of inappropriate. No, Captain. No signs of life down here. Just a wet blanket named Pam. Petty behavior. In your face! Zero productivity. Stop it! Stop it! You're right. Oh, this is so important, I should run to answer it. Shut up.  All in a day's work. Did you get your tickets? To what? The gun show. The Office on DVD. Seasons 1 through 3 available now. Tune into The Office Thursdays on NBC."
}