{
  "video_id": "GEnOPtk3k_8",
  "transcription": " So my research I would say coalesces around issues of global justice. So looking at for example how we can overcome injustice, violence, inequalities. So I guess in common speak how we can make the world a better place.  Within that I do focus specifically on the Middle East, particularly looking at things for example like human rights of minorities, of refugees, issues like the right to food, the right to water within the region and conflict transformation and peace building. So I do consider that my teaching is very much research led. I teach two main courses. The first one is called Politics, Power and Policy and as the title  would suggest it really seeks to ask the sort of big questions in politics. So, you know, what do we mean by politics? What do we mean by power? Who has power? How they may relate to one another in relation to policy. It looks at things, for example, common terms that we hear like freedom, rights, democracy, justice, governance. But what do they actually mean to different people at different times?  time, and what does that mean for policy? What does that mean in terms of connecting the local and the global? How do they intersect? And also how they relate to the everyday person. People often have this idea that they sit outside of politics, so this shows them how politics is above and around and they're part of it. My second course is a later year course on Middle East politics and security.  Now the Middle East is of course one of the most pivotal regions in the world but is often very poorly understood which is very problematic. So this course introduces students to some of the core ideas and concepts and debates about the Middle East. So some of those you would expect like ideas around identity and religion and ethnicity but also the role that things like gender and class play.  have played. We look at the region's geostrategic importance in terms of oil, what that's meant for intervention, which of course Australia was involved in the last intervention in Iraq, and what understanding things like conflict in the region means for contemporary challenges such as Daesh or ISIS, the Syrian civil war which has led to refugees coming to Australia,  Arab Spring issues like that. Politics in general and these courses specifically, they give students really important skills that are transferable to the workplace and in my own experience I've seen that in terms of ex-students of mine have gone on to work in positions in the government in Australia, in the UK, in New Zealand, think tanks around the world, some are security analysts, so it gives them a very good base  for tackling some of the major politics, power and policy issues of today.  you"
}