{
  "video_id": "GGIexzDO8cg",
  "transcription": " This is the new E-M5 Mark III from Olympus. It's of course a micro four thirds camera with a 20.4 megapixel sensor and some major upgrades over its predecessor. So let's take a look at what it can do. So inside the E-M5 Mark III we've got 5-axis image stabilisation  which gives you five and a half stops of stabilisation in the body. And if you pair it with the right lens, I'm using the 12-40mm Pro here, if you pair it with an optically stabilised lens, you can get six and a half stops in the body, which is obviously fantastic. So to show that off, I'm going to take a picture down this street. Hopefully the traffic will move in a minute. And what we'll do is we'll put it on, it's on a fourth of a second, f22. I'm going to have it at full zoom, which is 40mm on this, obviously 80mm equivalent because of the micro four thirds sensor. We'll take the picture, you'll be able to see the movement of the traffic.  and also how still it keeps the camera and how sharp the buildings are behind. We have a newly designed auto focus system which gives us 121 phase detect and 121 contrast detect AF points. It's also been designed to be extremely customisable so you can change the way it works around the way you shoot. It's also been designed to work super well in low light so although it's not super dark in here it's working perfectly well in this dimmer atmosphere but it's been designed so that it works inside  or at night as well when you're out shooting. The E-M5 Mark III also contains Pro Capture Mode and Pro Capture Mode allows you to capture all of the action even if you're a little bit slow to the shutter. All you do is hold your finger down, half press on the shutter button and if you then take your finger off  it will discard any image that's been taken in that time. However, if you half press and then press the shutter button, it will capture an amount of images whilst you hold down the shutter button and it will capture a few frames from before you press the shutter button. If you're just half pressing the shutter button, you'll never miss the action. Now to test that, George, I need you to make a crazy jump move. The body itself has loads of manual controls making it really easy to shoot with.  and it has an improved front grip and thumb grip so it feels nice and secure in your hands. We have a fully articulated screen so it makes it super easy to shoot above or below, really good for street shooting. And in terms of ports, you can use a USB cable to charge, which means you can run it off a power bank if you're out and about. And you have a mic input, making video a better option with the E-M5 Mark III. And the specs back that up. So what can the E-M5 III do in terms of a movie spec? Well, it can shoot  It has a full cinema 4K at 24p, it can shoot Ultra HD 4K at up to 30p and it can shoot slow motion 120 frames per second in full HD. It also has a flat profile so videographers out there who want to do a little bit of grading that is possible and as I've said it has the mic input too so you can get a little bit better sound quality. It has a single SD card slot but that does take up the UHS-II so it does mean you can have some speedy write speeds which is great for videographers. Now for the next part of the video I'm going to hand the camera over to the  George our videographer behind the camera that you're seeing me on now and he's going to take some test footage with this.  All in all, the M53 works as a really good enthusiast camera. Although its heritage sort of pushes it towards street photography, of course, with the right lenses, because of all the features in there, it can be used for anything from wildlife to sports to family photos. Now, if you need a bit more information on the M53, because obviously we haven't been able to cover all of the amazing features  that it has today. You can pop on to the website, there's loads of info on there. You can give us a call, send us an email, or of course, put a comment below and we'll try our best to get back to you with all the info that you could possibly need. Thanks for watching."
}