{
  "video_id": "gLXO-jeJlTQ",
  "transcription": " Hey what's up guys and welcome to a battery drain test battle of the Google Pixel 4 XL against the competition. I've got the iPhone 11 Pro Max, the Galaxy Note 10 Plus and the newly announced OnePlus 7T Pro as well. I've never tested the Pixel 4 XL and the 7T Pro. So it's gonna be interesting to see what these phones bring to the table compared to the current champ, the iPhone 11 Pro Max and the Note 10 Plus which is the best from Samsung. So here are the battery sizes for all the phones and obviously  Note 10 Plus has the biggest battery out of all these models coming at 4300 mAh. And Pixel has the smallest battery of them all coming at 3700 mAh.  benchmarking stage. Lots of stages indeed. As always I've set the brightness to an optimal level on all phones and the only connection we have is the Wi-Fi network and location services. All the phones are charged to 100% and let's begin with the test. Timer is on and as always you guys know the deal. Kick back, relax, enjoy the music and I'll see you guys on the other side.  ♪ Oh, will they ever see the light of day, light of day ♪  But I will find you I know I'm calling you  So if you're out there, just run until the end And fall into me, and see where this could end  You feel me in your heart I don't know where you are But I will find you I will find you  I don't know where you are But I will find you I will find you  Wishing that I could run away with you Imprisoned by fear, just pull me away, pull me away Secrets, fantasies, and me and you Will they ever see the light of day, light of day?  Alright guys, so the test is over after 9 hours of continuous torture. The test is finally over and the winner and still the battery champion, the iPhone 11 Pro Max. Just like last time, the iPhone's win is again making the statement. Apple has killed it when it comes to battery. Very considerable difference compared to the second position Galaxy Note 10+. During the whole testing, the Note 10 Plus was very close to the iPhone but after the benchmark stage,  The difference was a little bit more so the iPhone was able to conserve a lot of battery and especially in the video recording stage I was able to record 40 minutes of 1080p footage and then 21 minutes of 4k video at about 11% battery which is pretty amazing. Now we have the Pixel 4 XL coming at third position of course with 90Hz refresh rate. I think it was a pretty decent performance. I'm actually quite happy how it performed during the test and didn't expect it to be better than the OnePlus 7T Pro.  70 Pro of course just like the 7 Pro is the first one to die. Not a huge improvement compared to the 7 Pro from the previous test. So yeah this was the battery drain test of the current best right now. Let me know your thoughts about the Pixel 4 XL especially. Do you think for the price and the features that it has is the battery performance justifiable? Let me know in the comments and I will see you guys in the next one. Peace out!"
}