{
  "video_id": "gMtg4FdyAK4",
  "transcription": " Thank you.  so  Hey everyone and welcome back to my channel. If you follow me on Instagram you probably saw the post of my DIY ruffled shabby chic tree skirt and in this video I'm going to show you how to make one of your own. This little project cost me about $7 and I actually saw the step-by-step tutorial on HGTV's website so I'll be sure to put the link down below for you so you can follow the step-by-step directions. But this is how I made mine from a flat sheet from the Goodwill  for $2.99 a really ugly plain white tree skirt that I got there for $3.99 and some hot glue. It was super super easy so just keep on watching. Alright so all you basically need for this project is like a tree skirt or what I saw on HGTV's website they actually went to the fabric store and got canvas cut by the yard but when I was at the Goodwill today they had this tree skirt there for only $3.99 and it was ugly and plain but for $3.99  It cost a lot less than going to the fabric store and it was just right there and easy to get and already cut into the shape that you need. So for the fabric, what I did was I took this sheet that I also got from the Goodwill and it's just a linen. And it wasn't exact or anything because it's a shabby chic kind of look so you don't have to measure anything unless you really want to. So what I did is I took the sheet and then folded it back and forth and then cut big long strips.  this big sheet it was $2.99 again so much cheaper than going to the fabric store. So the only thing I had to get from there was actually the glue stick and then I had little scraps of lace so I thought that would also look cute to kind of intermix with the ruffles. So since I already started this I'll kind of show you how to start a new row. So get my strip  I'm just going to put a little squirt of glue down there. And I don't like edges poking out anywhere so you can see it. So what I do is I fold the fabric over anytime you're starting a new piece or ending an old one and glue it down that way so that way you don't see any edges or cuts or anything. So the next thing, kind of make this go a little bit faster,  You can do about, I don't know, five or six inches of glue. You don't want to do any more because the glue sets up pretty quickly. So if you get a big long strip of it going, the glue is already going to be dried and hard by the time you get to the end of it. So you're just going to kind of take the fabric and do like little pin tucks with it and then smash it down into the glue. So I'm taking my fingers, just kind of maybe that little inch sections and just pressing it down into the hot glue. So you can kind of get a rhythm going and it'll go fairly  quickly. This project is so easy and quick to do. Just kind of a fun little crafty project just because it's so simple and you can't really mess it up and there's no sewing at all required with this so it makes it really easy. So we're just going to continue doing that and bunching that along. So after I'm done I just kind of press it down to make sure it's squished into the glue really well. So I'm going to continue along through the whole tree skirt and then  Keep layering it so your next layer is going to go above this and so the next ruffle I'll probably start that maybe about two inches so again I'll put another row of glue here and then start continuing my ruffle so we're going to have kind of a tiered effect with the ruffle so you're always going to be covering this section here and then you're just going to have little fun ruffles all throughout the tree skirt  Alright everyone, that's my super quick and easy DIY video. If you make one of these fun tree"
}