{
  "video_id": "gUHQnkOkeX8",
  "transcription": " Today we are working on a 99 Toyota Camry. We are replacing the inner and outer tire rods. We are starting off by taking off the wheel. We start off by taking off the wheel. We start off by taking off the wheel.  First we take off the cotter pin and we take off this nut. And it's set up with an 18 millimeter socket.  Ball joint tool from Harbor Freight. Oh yeah, before we break this free, we have to cut this tie rod because this is jammed from my accident. So let's do this with my grinder. Almost through with the grinder, so we just take the hammer to finish it.  And that be it. We did this with ale. We take this little screw loose right here off the boot. And the reason why we cut this is because we want to save the boot. And we have it.  way up in there. We got to get our vice lock diagonal pliers on there and just break it free. We're using these. Let's go ahead and pull our boot out. Then we got to put on our tire rod in removal and get that out. That's the tool I'm using. And it's a clip we got to  bend up. I'm going to do that with a hammer and a long screwdriver. Okay, after we got our clip on here, for our tie rod end removal, put our barb on here, nice and snug. Put our pipe on.  And new one out the box Clip in you see these little pieces here  It will fit into the groove right there. We want an inner tie rod. Take off our nut, because the boot got to go on there anyway.  on a tie rod.  I'm going to use a pair of pliers to get the clip tight over the tie rod. The clip has to go over these pieces here. It's standing up, you have to lay them down so it locks in place. Wire tie, put over our boot.  to hold it in place. Slide this back in place. We got our boot back in place. We got our long nose back in the pliers. We're going to pull this right here real good.  Get it nice and tight. And then we're going to cut it. We take our clip and put it on the inner tie rod. We slide it on there. We put it right back on the end of the boot. Put our nut back on the tie rod. We put it on our other tie rod.  Couple turns we got a line the car. We're gonna take it to the alignment shop Put out a tire rod back on We put our nut back on We got to tighten it up and then we're gonna see the hole and we put a cotter pin back in  I caught a pin back here. So now we're gonna put the tie back on, straighten it up, and then we'll take it to the shop for alignment.  I  you"
}