{
  "video_id": "GYcYjGBEL8k",
  "transcription": " Welcome back everyone to It's a Grim Life, the daily vlog of the Grim Life Collective.  I'm really early here today and I have to get up to go take care of a catering order. I am awake well before my time. The sun is coming up. I've been working a lot lately. So much in fact it's been very hard to get a daily video together. But that's the reason I started all this is to try and find something weird, something grim, horrific, or bizarre throughout my day. Let's go find some things that I  that are grim, but not grim. Does that even make sense?  It doesn't have to necessarily be something that you drink. I don't drink it myself that often, but they do have some here. There's the Imperial Ale pumpkin. There's the typical Dead Guy, Pumpkin Patch Ale, some Oak Jack Imperial Pumpkin. Like I said, there's not that much here to look at.  really look at but we are on a search for finding grim but not grim things today. In this little beer section these are probably my two favorite looking bottles. There's the Harvest Dance. It's got a little Grim Reaper. I don't know if you can see that Grim Reaper dancing with a little thing. I think it's a wheat girl. A wheat girl? Okay, why not? But this one here is pretty darn cool. See this?  Lucifer. But let's see what else I can find here that's Halloween-ish while I'm waiting to pick up this catering order that's here. They even have a pumpkin made out of cheese. The house behind me doesn't seem grim and houses never do until you find out the history behind them. The house behind me belonged to the Atlantas boogeyman Wayne Williams. He was arrested in  in 1982 for the murder of two adult men and tried convicted in serving life in prison. After he was convicted, the police attributed the Atlanta child murders that happened from the summer of 1979 to the spring of 1981 to him. To this day, he claims his innocence as well as a bunch of other people. Grim? Yes. No? Maybe?  Frappuccino the vampire Coffee drink or ice drink whatever they have the frappula Frappuccino and I went inside and the coffee gods the crack and a cup gods themselves Denied me of being able to film in there, but I was able to get my frappula Frappuccino and I am gonna end today on that note. It's got my name Michael and  Drink. Boo."
}