{
  "video_id": "GZ-JajWPI4Q",
  "transcription": " Andrew McCart, IFL TV and association with MTK Global. I'm here with the victorious David Brophy  Did you enjoy that?  I mean I got hit a wee bit back there, I recovered well and things like that. He started, he's obviously, I had to fight him in the first round knockout so he could see what he was after. But my maturity and my experience I think got through. He was looking for the big right hook at the time and when I took his best I was like, let's fucking go.  I think you need it when I can fight. I hope to not fight because I tend to think I can outbox people. But I do like to fight as well.  What was the reason for the slow start?  I started to land on mine and he didn't like that.  I'm hoping for titles this year. I'm hoping for a shot at the British. I'm never calling out Emdy. I don't disrespect Emdy. I just think me and Zach Barker would be a very good fight.  I'm a good fighter and I think it would be a good matchup. Could that fight easily be made? I hope so. That's not my department. Let's just go home and relax and then get back in the gym. I'll be back in the gym next week. I'm sure Billy will tell me when he is. Are there other titles? There are other titles. I just wanted to have some titles because I've never had a home title fight. I've been everywhere. I've never really said no to anybody.  title fight, never.  I'm sure a lot of people won't like it but I enjoyed it and we need to build upon that and repair a few wrongs and just get back on track. I like it, you're a handsome man, I'm happy to look at you. I've got black hair, that's the biggest thing they can have. I'm getting you in the camera again Billy. It's good to see that your face is a wee bit mangled. I don't shy away from dust ups, I don't mind that.  you'd enjoyed it because like I said in the fall from when he came back with me flurry you were so I get him on see was that the best you bought let's do this meet in the middle of the ring let's go for it and but you enjoyed that but you're gonna be in many more than what you want to stick to your boss I would hope to a box me a lot more but it lets you see if you can box you can fight as well cuz some people have to get having to get a both of them not mean some people can box and it gets rough they can I get a shell so it's alright I was a 100% happy but take a positive because I could have been back in your shell  you get a bad first round like you can win yourself and just curl up and that's that. Well in summary then before I let you go, no more journeyman, British title next. Hopefully, just any kind of title, you know what I mean, give me a title. Any title, sorry. Give me some titles and as I say I've still got that Colin Will from the house, it's never seen daylight since I lost it and I never will, but I just want new ones. Good stuff, well I won't keep you much longer David and I must admit I really enjoyed that fight, you had me on my feet so congratulations on that, congratulations on that. Thanks Andy. Thanks David, I'll catch up with you soon. Thanks mate.  you"
}