{
  "video_id": "h0mHhQk748Q",
  "transcription": " So what I got here is we just saw me doing was basically making a mock scrape and yeah it's August and everybody's like man August already you're gonna make a scrape what I'm doing is preparing so you know I'm big on these kind of territorial scrapes like this and these primary scrapes on the edges of food sources like this a territorial scrape would be a little more inside the woods most of the  time this one out here on the edge like this every deer that walks through this field could hit this scrape so I've got one on this side of the field I'm gonna have one on the other side of the field and my plan is to catch get these bucks to use both of them you know I got to stand on each side of the field and depending on which different wind directions I got for them headed to these food plots and I can get them to use them but all I do is a lot of times if I don't have the right kind of tree branch that I want you know to start to scrape underneath I'll take  and hang like a grapevine or a limb or something that is a little bit more for them to kind of bounce around and get into their eyes so where they can leave that gland scent, that orbital gland into their, they like to mark that limb with orbital gland. And then they'll use their interdigital scent on their feet and pee down their hawks and whatever, and they'll leave all that scent in there. But I just take a rake, rake it all up, find a good spot and I clear it out enough.  got a stand right here so what my my goal is is to actually have this situation to where you know I can catch this buck coming up here if it's the one I want he's gonna work this scrape walk away from it and I can slice him so that's the plan that's just kind of what I do I just use some black widow deer lure most time this time of year to start them I'll just use some like matriarch doe or something like that I don't get crazy with a breeding scent I might use a touch of scrape master once a while that's got a little bit of everything in it sometimes I'll even pee in it  Most of the time just the smell of the fresh dirt and a little bit of deer urine will get them started on it. They'll just keep using it and it becomes routine for them whenever they come through here because they like to know what other deer are here. It's a communication thing and works pretty good. Give it a shot and I think you'll be happy. Just tie it up there like that into a limb. Leave it hang down towards dangly like this. Break out underneath and you'll start getting some action on this thing. You can use anything.  to be a grapevine. That just so happens to be what I had right around here that I thought would work good. You can use any kind of limb. In fact, this is a sassafras tree. Sassafras already have a little bit of a smell like that or like pine limbs. Deer love that kind of stuff too because they can get it around in their face and whatever. The same thing you can do to just hang something a little more directly right where you want that scrape to be. I've got a perfect tree right here to put a trail camera on and things will work out just perfect. So, hope this is a good tip for you. I think it'll help you out.  you"
}