{
  "video_id": "h2SpLNxN-tw",
  "transcription": " Stay, stay. I don't even know. What's going on family? It's Nick Wright from Nick Wright Bodybuilding.  The famous Converse has officially shown major love and support to NWB and hooked it up with brand new fresh chucks.  to  and he wanted to give me the perfect lifting shoe. So check this out. What do you want in a lifting shoe? Up until now I've actually been using the Nike 6.0s, yes I just kicked it off my foot, that was cool right? Because they are flat-soled, completely flat, they're low to the ground, there's no heel on them, and they're light as can be. And that's essentially what you want in a lifting shoe. Right at the time where I'm running out of mileage on these current Nikes and thinking I need to get more, Converse hits me up, tells me hey, try our shoes, see how you like it, see what you think.  So I'm going to and honestly they fit the exact bill that you want in a lifting shoe. You get in the flat sole, it's very, very low to the ground. It's actually a little bit lower to the ground than the Nike 6.0s actually are. No space between the floor and your heel, which is what you want. This is why I actually deadlift in socks. It's why Arnold Schwarzenegger used to do squats barefoot. So you can dig your heel all the way into the ground, get all the weight of your heel right into the ground. So that's what these will allow you to do. The fact that they're obviously a soft material makes them that much lighter. And of course I personally go for the high top.  So I'm extremely excited, I am so grateful to Converse for sending this kind of love and support, and I actually asked them what the chances of getting an NWB Converse made would be, and he actually told me to hit them up as soon as I wear these two bad boys out. So that's the latest guys, I've actually been lifting with some pretty serious lifters here in Richmond, Virginia, who also lift in Converse shoes, so I've been seeing the trend come about in the gym a lot lately. I'm definitely excited to try them out now and see if I like them better than the high top 6.0.  Other good lifting shoes in general if you want to take it to an extreme are wrestling shoes. However, I personally don't want to go spend the money on getting a pair of basics or just having to buy wrestling shoes and strap up every time I want to work out. I feel like just getting a more casual, flat-soled, high-topped shoe works much better. And also a little more stylish as well. The five-fingered Vibrams are pretty popular. Those are actually a really good shoe as well. However, they limit you with certain moves. They're a little bit more discomforting than the Vibrams.  do when it comes to calf raises. I know Matt Ogis himself actually did a video, he loves the V-Rims, but he even says he needs to switch his shoes when it comes time to squat. I feel like using a regular high top shoe of the more casual sort will actually give you the versatility that you want in the gym. So I'm going to try these bad boys out. I'm not sure which style I'm going to rock to the gym versus which style I'll wear outside. Probably my day to day sneakers, my funky gym sneakers. So Converse, thank you so much for supporting  Subscribe now, and of course jump on the Nick Ryde bodybuilding page. Chucks, baby!"
}