{
  "video_id": "h2vrh9G5-cY",
  "transcription": " Hello and today I'm going to show you my computer setup. First off, let's start with the computers themselves. This is my main gaming computer right here. Let me turn the light on for you guys if I can. Let's see how I do that. Looks like I can't so I'll just turn off the other light. There we go. This is my main gaming computer. Got the little  temporary USB Wi-Fi drive thing until I can hook this router up over here or bridge it successfully. Right now it wants to keep crapping out on me for some reason. This is my secondary computer. It doesn't look like much, I agree. But it's what's inside that counts. This is just an old case I got from somebody. I'm not done building it yet. I still got CD-ROMs up there and everything. There's a monitor, keyboard, mouse. Not for the main one.  I have two monitors, watch out cat. My gaming mouse with on the fly DPI adjustment. My gaming cat. And my gaming keyboard. It's really cool. You can change colors depending on what you want. It's on the fly hotkey creation. So if you want to just repeat an action in the game, then you can do that.  For one of the things I'm really proud of, my stereo. I have two liquid cooled stereo speakers. Yep. And over there, and one under here, and it sounds awesome. I'll show you in a second, but the stereo, this is a 1000 watt stereo that I got for like $50, brand new in the box. As you can see, it's a really good brand, Yamaha.  All right, let's start up some song or a song Don't know how good this quality of microphone is you want to listen to the music too. Yeah I'll show how good quality it is, but I guess we'll see  You hear me coming through this place, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah,  I know you can't get enough of my sound  I know you can't get enough of my sound"
}