{
  "video_id": "HdbBkWjBQWw",
  "transcription": " Spencer Lazara, MMA Interviews here at Citizens and Mandalay Bay. It's Fight Week, International Fight Week. I'm alongside Chris Camozzi who takes on Bruno Santos this Saturday night live at UFC 175. Obviously nice to be on such a massive event.  massive card like this. Talk about, you know, coming back and fighting here. Well, I asked to be on this card and the UFC was kind enough to put me on it. After Andrew Craig fell out from the Abu Dhabi fight card, Joe Silva told me, let me know what we can do for you and I'll make it happen. So I said, look, you know, I'd love to fight on UFC 175 in Las Vegas. And here we are. He fell out of that of that card and actually had a fight before you. How was that for you having an extended camp and, you know, not  training thought process on that? You know, we did it right. I work with a company called Phase Four. They're physiologists and physical therapists and everything. So they helped me hold the peak, as you would say, for the athletes. So I didn't over train my body. We really had a chance to progress and build off of what we already had going into Abu Dhabi. So this camp, I feel even better than I did last camp. Talk about the meal you just had and making weight here. You had a nice lean meal here at Citizens.  Weight is falling off for me right now. Again, phase four is doing my diet, my cardio programs and everything. So I just had a little bit of salmon and some broccoli and avocado. And the more I eat, as long as I'm eating healthy, it seems to make me lose weight. So it's nice that I'm eating and still losing weight. Have you noticed a significant change in that portion of fighting over the years now as the sport's getting bigger and whatnot with nutrition and doing all the little things? Yeah, definitely. I mean, in the beginning, I ate like crap.  you know I'm learning as I get older and I think the fact that I am getting older I gotta I gotta get better at my diet so this has been a huge help and I think my metabolism is really kicking up and continuing to burn more calories. Talk about the matchup with Bruno how you see this fight sort of playing out I know you like to strike so safe to say that's where your biggest advantage lies in this fight? You know we'll see Bruno's tough I mean he's 13 and 1 I believe so you know he's winning for a reason but I think he likes to put the pressure and try to push guys  up against the cage and I think he's gonna have trouble doing that with me. I got a lot more reach than him and you know I like to pressure guys as well so I think it's gonna be a little bit of a battle there so we'll see who comes out on top with that. What can you say about your preparation for this fight? Man, preparation for this fight is, I'm glad it's over. Every day has been a fight for me. I train at Factory X in Denver, Colorado and it's a gym full of killers man. We got guys just trying to take each other's heads off every day, sparring  So I feel like every day I'm fighting So this should be the fun part now I'm getting paid for it before we're just beating the hell out of each other and then going home and saying good job How do you keep that sort of you know, making sure you're not sparring too hard or over sparring You know taking too much damage maybe in camp How often do you think you should spar, you know hard as opposed to maybe doing some light drilling or light sparring? We do light drilling light sparring, you know twice a week and then we hard spar  I think Friday is close enough to the end of the week. As far as controlling it, Friday is the test day. That's where you put everything to the test. If you're not ready, you're going to get beat up. It's definitely mentally a great thing because I'm coming here to fight, so I need to fight in the gym too.  So it just helps me prepare.  You're watching MMA interviews dot TV"
}