{
  "video_id": "hdXA4-tCwTA",
  "transcription": " But um, yeah, but that that show it was everything and also it was also hell for me but um, yeah, but I met you and you were so nice to me and you Alex Borstein and Will were the only three people that really kind of like Said stuff past. Hello You know, like how are you doing? You know that is I have to say that is  appalling to me. Why? Because I don't, well, I certainly don't want to think badly of the people that were like, you have to remember when I came on, there was two lawsuits going on. No, there was. You're right. There was. Yeah, there's a bunch of lawsuits going on. Yeah. Yeah. And then so crazy. People, you could tell people, you walk in a room, you could tell that people didn't like certain people, but not just like that.  Like it was like an obvious, uncomfortable feeling of like, something's going on here, that's wrong. And then when you're new and no one's talking to you, you perceive it as it's your fault. Like all of it, right? And you show up and you're like, this is my reality. I did this, which is crazy. You know, but. I can see that. And you know, I do have a need to make people feel comfortable  Do you know what I mean? Yeah, yeah, yeah. And so it's like any new person that came in, I like to think that I reached out to them. You were so nice. You know, to, because it's hard to come into a situation like that. And we were so intense and we were a family, like each other or lump each other. Do you know what I mean? It's like, it was an intense environment to come into. And so I always wanted to be like, it's okay. Like, come on in and play.  Yeah, but you know it shows you people though, right? It's like we'll sass. Oh, too was nice. Yeah, and um You're the you're the only one aside from will that's done this podcast Jordan I know but aside from that later. Yeah, when I that Way later. Yeah that in that class. Yeah You're the only two right? Yeah, that says a lot. Yeah. Yeah No, it isn't and I if I think about who  Like who who am I still in contact with yeah, I can tell you it's It's it's limited. Yeah, you know Debra Wilson and I have remained lover sisters. I gotta get her on this. Yes You know will Sasso will forever was Aries already on the show. Yeah Aries and I are in contact. Yeah. Yeah, you know, it's like I probably we can edit this out if we want. Yeah, see what he wrote about you last week. No, what do you say?  about how you were a big fucking coward and how you weren't real and there's nobody real in the industry and he just went on a... What the fuck is that? I think someone asked Aries also on... Like, hey, are you gonna be on Tiger Bell and he's like, that motherfucker won't return my tax or call. Yeah, it's like, but here's the fuck. Have you been on his podcast? No. Touché. Does he have one? Yes. Yeah. So, there you go.  But that's just Here's the thing. All right, he asked to do mine ten times in a row in one day, right? Yeah, so it's just like it's an old dude, you know, I have a schedule We only do it once a week, you know, yeah, and then he's like pop me, you know, they bump me for these other people and then I went that kind of like and made me more defensive. Yeah, and then  It's so funny to me though. Oh man. It makes me laugh so good. It's juicy. Why are people so mean? I figured you'd enjoy that tidbit. I did enjoy that. It's so much easier to be kind."
}