{
  "video_id": "HeJaCTpbnes",
  "transcription": " Turn that shit off man  Alright so we made it to the Griffith Observatory We did not go to ski mask because it got cancelled because he got sick and uh, here we are Yeah, bro, I'm so not used to talking to my phone and like shooting video and stuff Come on Jonah, I'm trying to get b-roll  She said LEFT. She said go inside though. She said, she texted me, she said LEFT. Just in all caps LEFT. Hello Liliana, we go left. I kinda wanna go upstairs. I kinda wanna find out where... Woah. That's so sick. Well, we found LA. Do we go down? Are we going down?  Yeah dude. Oh maybe they're down here. Wow. Wow. That's crazy. Never been in here before. Let's see. Whoa. It said to the left.  Wow Yes, we went out to the back over there we took pictures picture here picture here and here  Well, you're a meat-eater No, you don't like me I mean, we love vegans This is a moon that's a sample Very the cool hello  Jonah this floor is made of floor Same with the ceiling, but it's made of ceiling Wow Bro, no, cuz the floor is made of floor ceiling is made of ceiling Hello microscope you look Jonah, let me look with balls  It is balls. Sea balls. Tiny metal balls. Just kidding, they're dust particles. Mom, if you're watching this, we gotta come here with the girls. This stuff is insane. It's crazy. Maps and all kinds of rocks and stuff and space things and they got planets over here. Wow.  This is crazy This is crazy, I got telescopes I'm gonna look through it. No. Yeah  Oh Wait, that's super zoomed in here short period vibrations from nearby earthquakes long period vibrations Okay, wait, can we go back upstairs because we have five minutes  Well, I put could apostrophe NT. I'm pretty sure it's could N apostrophe T. It is. But I goofed. So if you go back to the previous video, you'll see where we goofed. Where I goofed. And I put a could apostrophe NT instead of a could N apostrophe T. And so I did a goof. All right, right here, put a graphic that says grammar time with Brandon.  Grammar time with Brendan. Alright, we just went to Starbucks. Now we're in the parking garage for Hollywood Boulevard. It's 11 o'clock. We're leaving in exactly 20 minutes. Right Jonah? Yeah. We gotta be out of here. So we gotta leave at exactly 11.20 to get out of here and hopefully get home on time. So uh, let's go and see some stuff. Chinese theater.  This is awesome I think he did more than that, but yeah This is also in GTA we haven't even been up here for five minutes and 14 minutes has already gone by yep Exactly  Yep Hello Hello Merlin's been like boring all night See? Boring, she wanted to read and I wanted to look with my eyes You also touched everything  Hey Hands are better than eyes. Sure. Would you rather have hands all of you eyes all of you neither? Gonna be the end of the vlog For today. It's 1120. I'm tired. I gotta be home. I gotta sleep What about you Jonah? Yeah, I gotta sleep. I got I got class in the morning. You're gonna sleep in the car I'm gonna drive. No, I'm not gonna sleep. I gotta edit this video. Yeah, he's got to edit mine, too. Yeah  See you guys later."
}