{
  "video_id": "HKOs-4TMwc4",
  "transcription": " So  Hello and welcome to the channel guys, this is Prakhan and you're watching Fantastic Mr. 360. Today we are headed towards the city because we are going for a test ride of Kawasaki Z800. That's an actual superbike guys.  The engine displacement is around 806 cc and the maximum power output is around 111 bhp which you get at 10,200 rpm. The bike runs very well and it's going to be a lot of fun. How does it feel to ride a superbike? You won't understand that much in the video.  superbike so anyway but you will understand a little bit how it feels to ride a superbike I am going to have a lot of fun brother I know so I went and I am doing a little shopping so I will show you what exactly I bought and what else let's go  I  I  I  grrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr rrr rrr rrr r r r r r r r r r r r r r r  There's a lot of people.  ah  so  so  The next station is St. Mary's–St. Petersburg  Two hours later  I  Finally back in room guys  I had a great time, I'm sure that you had a great time too. If you have any questions or suggestions for me or my videos, you can comment it down below in the comment section and make sure that I reply to all your comments. And right now it's time to say goodbye for today and I'll see you guys in my next video. Until then, take care."
}