{
  "video_id": "I1ECITk7WTY",
  "transcription": " In the past, communities were built around young families. Older people tended to migrate to warmer climates and age-segregated retirement homes.  communities. Today people are inventing a new future for themselves. They are coming together to build aging in place programs that enable older adults to remain at home and in their communities as they grow older. So many people are in nursing homes and don't wish to be there and their families don't wish to be there or in some other kind of care facility as opposed to being in their own communities and their own homes.  as they age. And there's very little that has been done about that in the past, except for family networks and the extended family kind of thing, which we know so well amongst our minority communities. But this really proves to be an opportunity to do a whole host of things in helping people to age at home, as opposed to going into institutions of one kind or another.  I've been a caregiver for, I guess, 25 years now for one or another elderly relative. It began with a phone call back around 1985 where I was told that an elderly uncle had broken his hip. And this was the day before his wife had broken her hip. They had no children and all of a sudden I was kind of thrown into the breach. Opportunities arose to be of service and  I got involved so I think that experience has taught me that there are a lot of gaps in the care systems that exist for the elderly now and this looked like a good way to fill a lot of them and we took it from there. One of the most serious problems about getting older is loneliness and some of the focus groups that we've had with people that has come up because older people  People are very worried about what's going to happen to them. I got involved after I retired. I was looking for something to do. And I went to a meeting of a local community group called The Summit. And there was a presentation about the program in Beacon Hill, which is an aging in place program for people who want to stay in their homes as they get older  and it is geared toward making their lives more comfortable, more safe, and have them be as independent as possible. It was a wonderful idea. Would have been wonderful for my parents, would have been wonderful for a dear friend of mine who died just a few years ago, and for those reasons, I really became, I think, more a mother.  emotionally connected to the idea. I had a couple of ailments where I couldn't drive and at home on this end I had volunteer drivers to take me to my medical appointments. Very positive side of it, all kinds of programs are being developed. For example, we have a wonderful intergenerational program. And that's a thread amongst most of these organizations.  the mixing of the generations so that for those of us who are older and can share certain experiences, we do that. For those of us who are older and we don't know how to use that new phone that we got and all of its digital doing, these young people step up and they show us that it's great.  14 hours on the floor. Lois Steinberg has been a driving force behind Aging in Place programs which combat loneliness by engaging people in fun activities where friendships are forged and connections are made. Each year, volunteers like Lynn Reitchcott contribute more than 22,000 hours toward the development and operation of Aging in Place programs. Access to rides provided by volunteers  It's been more than I thought that it would be in terms of my own gratification with it. And I'm just going to continue with it. As Barry Singer always says, I want it to be here when I need it.  programs are now operating throughout Westchester County thanks to citizens like Lynn, Lois, Ernie and Tom who have come together to start something brand new in their communities. If you would like to start an Aging in Place membership program or would like to learn more, please contact us at the Center for Aging in Place. Our phone number is 914-357-8511 or you can visit our website at www.centerforaginginplace.org.  www.cdc.gov.au"
}