{
  "video_id": "I9mUKhJvwtQ",
  "transcription": " Good morning! We're still in Dublin and we're going to drop our car off this morning and then we're gonna do some serious tourist stuff. Right babe? Steph's gonna learn how to pour Guinness today, I think. I think we're gonna do that. Well, yeah, but I'm just more excited for you to do it. Breakfast. You have the keys? Yeah, I do.  She's really excited about it, and I'm gonna try not to get hit by this car. At Jameson Distillery. Oh yeah, and we're gonna go to the Jameson Distillery, so. Like we have to, our dog's name is Jameson. And also- It's gorgeous! Steph, we walked by, like apparently Dublin loves donuts because there's like a million donut shops. And like fancy donut shops. Yeah, really cute donut shops. So she said the first thing that we need to do today is go get her a donut for breakfast. And then we can bring back the car.  Is your girl Okay, which way do we go This is military lane Is it the best way you don't know two best ways, okay, so you don't know the sign says straight Chris  Now you're going to cross the road, eh? Is it good?  I feel like this is like the Willy Wonka factory of beer. It's amazing.  There we go.  That was fun! Were you a bartender? Is that what you said? We're in. They're letting us into jail. So many touristy things in one day. I love it.  K go  So we just did our Jameson testing, taste testing. It was so fun. Kristen, I'm not a whiskey girl, let me tell you that. Well definitely not a scotch girl, we can both say that.  Yeah  like when you don't have a lot of time  Guys we're leaving Ireland I Think it was one of my favorite trips. We've taken so far you say that about every trip. You're right. I do I just like traveling with you. I mean just traveling. This is our last night We're gonna go out and see the temple bar area. We're leaving early tomorrow morning So yeah  I'm ending the vlog. That's it. Thanks for coming to Ireland with us. We definitely want to come back and do Northern Ireland. Yeah we do. Moral of the story is that we loved Ireland and we will be back and we'll see you soon. See you like next week or in a couple days or I have no idea when I'm going to post it. Whenever Kristen posts a video. Because we have so many freaking travel videos I'm going to try.  I'm gonna post Ireland before I finish. Yeah, it's really confusing. It's getting really confusing. Sorry if it's confusing for you. It's confusing for me too, so we're in this together. Thanks so much for following along and we kind of like you guys. A little. A little. Most of you. Some of you. Okay, bye. Okay, bye."
}