{
  "video_id": "IaKwKW04iVY",
  "transcription": " Hey, Kyle Barrington here again with Modern American Combative Arts. I showed a little earlier I did a video showing recoil management. I went back and looked at the video. I did a pretty good job, but I'm going to run it again. Like I said, we're going to put stuff out there so people can see it.  gonna make some kind of mistakes at the range. You gotta find out what you need to work on. What I'm gonna do, recoil management. They said some people call it a failure drill and do six rounds, some people call it a hammer drill. You'll, five, six, seven, eight rounds. I'm gonna run through, it's the end of the day. It's getting about 5.30 out here. Getting about time to quit shooting. So I'm gonna run through my magazines and check it out. Like I said, we can all look at the video together, but that way you know. SIG 226, multiple magazine,  Makar mags, high capacity, it's a 9 mil. Should be able to handle the recoil relatively easy. If I've got my good thumbs forward grip. Remember, my thumbs forward grip is here. What we're going to get, start off, get the gun up in your working area, get a good grip on the magazine, finger all the way up. I'm looking through it, load, like I said, initial load, did my press check. I'm going to go ahead and start from here, then I'm going to work my way through my magazine.  It should look something like this. Let's hope we don't get too much recoil. Let's see how she runs. So the gun's out, I've got a good grip, and I start shooting. Magazine reload. Reload. Clear it out. Okay, that was three  I think 17 round magazines, might have been 15. I'll have to go back and take a look. But what you see is, and I'll go back and take a look at the video, that's going through a lot of rounds, that's box ammo, expensive drill, but I know I can manage the recoil. I've done it enough. You gotta practice, you gotta get out there, make sure your gun handling skills are good enough. We know, minimum three rounds in a gunfight, you've gotta get multiple rounds, you need to know how fast your gun operates, and if it runs as fast as it can, can you handle it? Hey, y'all be safe, I'm gonna go back and take a look at the video.  video and see how I did critique myself. Videotape yourself, critique it, be safe, train hard. Thanks for watching."
}