{
  "video_id": "IhoM6jese_Y",
  "transcription": " You  I was three years old when I found out I had cystic fibrosis. I don't notice it, it's just sort of routine for me now, but like when I wake up and I have breakfast I have to take my enzymes, which are my pills that help me absorb the fat in my foods before breakfast, before lunch, before dinner, before I eat anything. At night I have to do treatments, I have to do my vest.  It shakes me.  thicker mucus everywhere in your body. And that's seen especially in your lungs, in clearance of mucus throughout your lungs, and also in your pancreas and in your digestive system. The basic defect in cystic fibrosis is that the chloride channel doesn't pump right. And so because of that, the layer of fluid that the majority of us without cystic fibrosis have in our sinuses, in our lungs, in our intestines, is just not present in CF because that channel  doesn't allow the salt and water to flow back and forth freely like it does in everybody else. So because of that, that fluid not being there, lots of thick and sticky mucus is produced primarily in the lungs and the pancreas are probably the two major organs that are affected, although we know it's an entire body disease. It makes it harder to breathe and also to digest fat and foods and stuff like that, so I take enzymes and do treatments to clear my lungs  lungs and make my life easier. On a normal day I'd say there's probably an hour and a half to an hour and forty-five minutes of treatment. As you get older the disease progresses. I am fortunate in the fact that I take my treatment seriously and you know relatively I'm very healthy for somebody with cystic fibrosis so I do consider myself  I feel pretty fortunate and lucky with that. It doesn't really affect me in my sports because of my treatments I can breathe but sometimes I'll get like short of breath or my chest will be tight it'll be harder to breathe and like long distance running can be hard sometimes but other than that it's not that bad.  You know, it's a ticking time bomb, I think is how my mother said it. And I think that's probably the best way to describe it. I mean, it doesn't get better. The only thing you can do is fight with treatment. But it doesn't, unless there's a cure.  which is hopeful, but it's not a... There's no making it better, it's only making it worse at a slower rate. Cystic fibrosis hasn't really gotten worse with me. As you get older, the scarring on your lungs becomes worse, so it does get worse, but I haven't really noticed a difference. I mean, I've gotten more lung infections as I've gotten older.  You know I think and just across the country I think there's plenty of ways to get involved in fighting this disease not just for love or not just in Columbus. So wherever I land, wherever I may land, I will absolutely find a way to get involved and keep fighting.  names to it, but in numbers, but basically it's the Vertex trial which is fixing the basic defect that we talked about at the beginning. So because it really is taking the chloride channels and helping them pump correctly. And the real exciting thing about all of this is it's probably the first time that in a chronic disease they're really fixing the basic defect, okay, at the cellular level. It's huge. So it's not like just a new antibiotic, which we do dearly love still, but we, but it is really looking at what we would call  Correcting the disease. They're really not calling that a cure yet, although I'm sure why but but it really is kind of correcting the disease so that these guys may end up taking a pill twice a day that will make their life so much easier. All the money that's donated and everything will go towards the drug being developed and will speed a development process and hopefully we'll come closer to getting a cure. It is unprecedented at this at this time how close we are to making serious  and impactful changes to how this disease is fought. And so I just want to thank you all sincerely from the bottom of my heart. And I'm sure I can say talk for my sister and family as well. That everything you do, whether it's donating, whatever your contribution may be, it is felt and it is impactful. So I sincerely thank all of you. Thanks for donating your money and spending your time to help fight this disease that's affecting  and my family. You know, having CF is a part of me, certainly, and it's a part of my life, but it doesn't define who I am. I don't let the disease define who I am. I firmly believe that everyone has challenges and they deal with them, and this is my challenge, this is my cross to bear.  you"
}