{
  "video_id": "IISHqHLi7oY",
  "transcription": " Hey Youtubers! So this is my first makeup tutorial ever. First tutorial. I'm hoping it's my first of many. I have no idea how to start this. I thought I'd start off with something easy. We're going to be doing a mime costume and makeup.  This is what the makeup will look like, only higher eyebrows because this is the original and I've changed it. And this will be the costume, this will be my design, you'll see what it looks like in the tutorial. I hope you enjoy!  with a cute bow attached to a white frill. It was perfect. Next you'll need a plain black skirt, one that folds to the knees. This was already in my wardrobe, it had pleats so it seemed very French like. I don't know if pleats are Frenchy or not but they just sound like it. You will need a pair of black and white striped socks, preferably ones that pull up over the knee. A mime needs white gloves. To which you will sew two black buttons on the outer top and the inner bottom.  each glove. Just like this. Suspenders, cannot forget the suspenders. Final touches people. And of course you'll want a black beret. Now it's a beret. You were like a cupcake without the cherry. Any black footwear will do. For this I'm using my black boots. Now that we've got the costume sorted, let's get into the makeup. Think of Dora the Explorer when I say this.  No swiping. Like you get sponge, I just find that if you swipe it's removing makeup from one area and just bulking it up in another. And then it's just not pretty because it's all splotchy. Just don't swipe. Dab. First off I've gone ahead and tied my hair back. Also prepared my face by using a cleanser and a good moisturizer. Grab your sponge and your white face paint and start applying the first layer.  Once the first layer begins to dry, apply a second layer to even out and brighten the white.  cover your natural eyebrow. Next, clean up around the edges of your face with either a makeup wipe or a cotton tip dipped in cleanser.  face paint. Let's start using some black face paint. Now with this face paint you want to outline the edges of where you just cleaned up. Don't worry about it being messy.  We'll get to the cleaning stage again. And by getting to the cleaning stage, I mean we're going to do it now. So go ahead and clean up. Moving on to the eyes, grab a black liquid eyeliner and heavily line under the eyes as well as filling in the entire free moving lid up to the crease. When one eye is complete, do the exact same on the other.  It should look like this. Now we're going to start painting on the weird 4th sided star thing. Easiest way is to mark a small dot where you want each line to stop. When doing this line, meet in between the corner of your eyes.  and the edge of your face. With the top line, just go past your natural eyebrow by a small amount. Thicken the lines at the base. Allow them to point outwards.  And don't forget to do that little tiny line in the corner of your eye. Very important. Gotta add a couple of beauty spots. Luckily, I was born with them, baby!  Go back in with the white face paint and fill in the areas around your eye that you have missed.  the eyebrow will reach its highest. We want these eyebrows to be really crazy and funky so don't worry if they're not symmetrical, don't worry if they're not perfect. Because we want them to look really weird.  Let's finish up this makeup with cleaning the lips and then applying red lipstick. Simple as that. You don't have to do red lipstick, I just thought it looked a bit more feminine.  you wanted to but I think red is probably best for this. The memory card kind of got full when I was doing the lips but this is what it looks like. And here's the results.  I hope you enjoyed this tutorial or found it useful in any way. Don't forget to click like and subscribe to Look2Kill."
}