{
  "video_id": "IYB2PnJsh1k",
  "transcription": " Yeah, I think I fucked up on that one part though. Shit, this shit gone, man. I'm finna walk this bitch, man.  You gang once, then you gang twice Got popped once, you got banged twice You ever spend around 50 blocks? Riding around with like 50 shots Five niggas, so there's 50 glocks Blowing down a nigga chimney block Lock it up, then let it pop Bad bitches, so we let them lock Wrong move, then we roll and rock Hit his chest, watch his shoulder pop Big nuts, that's an Ola block Never ride around sober, ah That shit, bitch, I could've told you ah Blow me this, you come blow your ah Freak bitch, yeah, she give me top Make it wet all like a mop Left hand still on the Glock Headshot, then it's overpops They ask me what I'm smoke outside I only smoke reefer Smoke the paper one time Had me feeling like Khalifa  Make shorty roll the wood, call her friend then she eat her And while I'm sparkin' up, I'ma order me some pizza, Mona Lisa See how I spot him, got him like a cheetah, How this nigga out drippin', bitch, it's why I got her feet She suck me so good, text after, swearin' that I need her Dick is good, hit her good, got her shakin' like a shee- They said, boy, you fuck Taisha, I ain't even fuck Kaisha I ain't even fuck the weaver, but after I fuck then I'ma leave her, wear my dick all on a clip Yeah, that's just how I tease her, Birkin bag on her side Yeah, that's just how I treat her  You getting clapped in, yeah, future goals left unpassed in Go to different city, love my accent, blue faces, I be stacking Niggas tweeting about me, niggas texting about me, turn a has-been to a has-been If you a has-been, you getting back shots If you try to run, you getting back shots I won't hesitate to let his Mac pop, make your bitch open like a laptop If you talk crazy on the internet, send TySat to come crack top Two cans back to the trash pot, then we whip it straight to the crack pot First of all, can I talk my shit? How you confront me like a man and I fucked your bitch Magic trick, blind man, how I weigh these sticks In the kitchen, water whipping, watch me make this brick  One call, set him up, watch me hit this lick Ass fat, pussy wet, let me hit real quick Good gas, pearl white, let me hit that shit I was smokin' so much, I had to quit that shit Look, we can shoot it out, just tell me how you wanna play it If I see sound like, bitch, I'm gone sick I'ma catch a homeboy lacking, put one in his head He was screamin', fuck the gang, now he fuckin' dead gang, nigga  Yeah"
}