{
  "video_id": "IYyN_JAix5c",
  "transcription": " Jesus and the Underdog  was the youngest of all his brothers. He was betrayed by his brothers. He was sold off on a slave table and yet in the Bible God says that Joseph was a very and is a very successful man. God saw something in Joseph that people did not see. We look at David and we see David also the youngest of brothers and the smallest and in the in the fields looking after sheep and when there was one man who God wanted to anoint as king it was the one who everybody else thought the odds were against the smallest or the most insignificant  But God had something for the underdog. We see Jesus walks around in the New Testament and he walks past a man with the name of Zacchaeus sitting in a tree and Zacchaeus had quite a bad reputation. He was a thief and he used to steal people's money and in spite of what people were saying about Zacchaeus, Jesus stands still and says, listen, I want to have some lunch with you. I want to eat with you. I want to have some fellowship with you. So the odds were, even if people felt the odds were  against them. Jesus never saw people in the way that people saw people. Jesus saw something else. And maybe today you feel like David, you feel insignificant, you feel you may be left out in the field to do the bad jobs, and you may be the smallest. God sees you differently. God sees a king when other people see a shepherd boy. Maybe you feel like Joseph, you feel like you've been sold out or betrayed, you've been placed on a slave table and you feel you've been stripped of everything you had or had.  And you don't know where you're going, you don't know what your future looks like. The odds probably you feel are against you, but when God looks at you, He sees you as successful because He does not look at you as somebody who has the odds against you, but He sees you as somebody who has a bright future in Him. Maybe you feel like Zacchaeus, you know, yes, you worry about where you've been and what you've done, what you've said, you worry about your history. Your history doesn't deter God, doesn't put God off, it doesn't raise the odds against you.  He brings out the passion of God for you. It's an invitation for you to come and sit and dine with God. So I want to encourage you today. If you feel like the odds are against you, if you feel like you're the underdog, there's so much more to say about this. But God has a vigorous passion for you. He has a vigorous love for you. I just want to pray for you today and just encourage you with the words that God is with you. It doesn't matter where you are. So let's just bow our heads and pray. Father, we thank you today.  You've always had passion for those who feel like things aren't working out father. Maybe maybe there are people listening today who feel that Life is treated them bad. Maybe they feel that the odds have been against them since a young age and they've been stripped of that being betrayed or they've been hurt or disappointed and Lord I just pray today that you would come through as the God who's always chosen the underdog has always been there for the underdog to pick him up Lord and to bring success forward where there was no success to end a great story Lord where there was no story  I thank you for that today in the wonderful name of Jesus. Amen  There's no sorrow  Lay down your heart.  Cause earth has no sorrow that heaven can heal. Earth has no sorrow that heaven can heal. So lay down your burden and dance. Lay down your shame. It's all in our world again. Just lift up your face.  Oh  As you are  you"
}