{
  "video_id": "JC1hUURScHY",
  "transcription": " How do you feel about the election?  kind of the powerful forces that they are in the industry. And we shouldn't have to give up that voice, give up that platform, give up that seat at the table because of bad behavior that somebody else has committed. You know, we want to use our platform for good. So I'm glad that we showed up and that we're here. It may not always be the choice we make for different shows, but I'm glad that we did it tonight. So I tried and I think a lot of us are here with joy in our hearts because there's a lot to celebrate. There's a lot of, you know, beautiful women's empowerment here on this carpet tonight. Women standing up for each other.  and with each other and not just for women in this industry but for all industries, all people to make sure that we're fighting for equity and parity. You know, it's a celebration to be able to be here and do this. Because it is the right time. It should have happened years and years and years ago. This should be a no-brainer. This shouldn't have to be written down but clearly it has to be and now it's time to take concrete action and make sure things change forever. And I am thrilled that my children are going to grow up in a different culture and they're going to say, really that happened in the olden days?  What do you guys tell them? How do you advise them on this? That you're in charge, that you own your life, and you be an ally and you stand up for it. It's like bullying, you stand up for anyone. What about the Aussie representation tonight? There's lots. We're everywhere. We're everywhere. Watch out. But we'll be even better represented at the parties.  Hour is about someone standing up and holding the line. It's a film that illustrates that words and actions can literally change the world. So it's very fitting that I think we're here today, we're in black, in solidarity with America and Reese. And you couldn't have had a more fitting film, actually,  Helen, how do you feel about supporting women tonight?  about ball haggers I haven't read them I haven't heard I haven't read them or read any of his reaction to it so I read I'm not really in a position to comment on that but you know again it's it's it doesn't surprise me you know this is not a these are these aren't you know odd little okay anomalies this is a this is a institutionalized trend in our industry and not just our industry in lots of other industries  Yeah, I'll talk to you later."
}