{
  "video_id": "JJPTYTswPCI",
  "transcription": " The line of scrimmage  to give Nesbitt an opportunity to get to the perimeter. Option, first play out and the pitch. Breaks a tackle, Dwyer. At the 40, 30, watch out, gone! Dwyer, 10, 5, touchdown! And what a way to start the second half of Advent. Well there you have it, Craig. The sting is back apparently as Josh Nesbitt that time runs the option to perfection and gets the ball out of the perimeter to Jonathan Dwyer who breaks a couple tackles  And hello momentum right back to Georgia Tech. A 60-yard run by Jonathan Dwyer. The sophomore out of Marietta came in leading the ACC in rushing over 107 yards. A ballgame picks up 60 to start the third quarter. And again, Tech will go for two.  Nesbitt, pitch, Dwyer, can walk in, touchdown! Or I should say two. First and goal from the eight-yard line. Under center is Nesbitt. On the pitch, coming near side, Roddy Jones turns the corner, leans in! Touchdown, Tech!  Well the Georgia Tech faithful have made the trip up from Atlanta, Craig. You gotta like what Paul Johnson has done here in the third quarter. Once again, getting the ball in space to his speed guys. Roddy Jones and a terrific lead by that time from Lucas Cox. And Paul Johnson just answered my question. There you go. Go for two. Nesbitt under center.  opportunity to tie this game. Once the throw talks, into the end zone, and we're tied at 28! Wow! All the way back from 16! Quarterback drawing all the way, Grant, nice call down to two yards for Paul Johnson's spread triple option offense. Got Blair teasing up. And a whole new ball game in Athens, 8-11 to play in the third, and the kick.  We'll push Samuel back to the two-yard line. Up the middle he goes, breaks a tackle, and hits a wall and falls to the 24-yard line. Fumble. Tech pointing. Ball was on the ground. Georgia Tech recovers at the 24-yard line. Well, there's Samuel there as he gets into traffic.  of held up by the Tech defenders. Ball's out. Ball is out. Ball is out. And what a momentum Georgia Tech has a chance to take the lead here in the third. Right up the middle. Dwyer. Touchdown Georgia Tech. Can you believe it?  Well, Paul Johnson certainly has done that. Just a little inside handoff trap this time to Jonathan DeWire. Good blocking up front. Nice cutback right there outside the defender at Jonathan DeWire. And this Georgia Tech offense has come alive in the third quarter. And Paul Johnson will truck the PAT. No two-point conversion try here. Snap is good. Kick is away. And through the uprights.  Blair and Georgia Tech owning the third quarter. Scott Blair is going to try a field goal now. 0 for 6 this season, Trev, from 40 yards and beyond. They will mark this ball down to the 18. This will be a 28-yard attempt. Scott Blair, high snap, hold, and the kick is away. And good from 28.  It's a 10 point game. They love the pressure on the opponent quarterback. Georgia today 0 for 1 on fourth down. And from the eyes, Stafford goes under center. Marino, watch out, 20, turns the corner, 10, 5, touchdown Georgia! What a tremendous effort by Noshon Marino.  Greg we said somebody had to step up here. No, Sean Moreno's not a senior But of course they're playing for these seniors here in Athens and what a great run from no Sean Moreno He got a terrific block up front from Sean Chaffetz at the line of scrimmage Moreno read it got to the outside and a great run from 24  Touchdown Tech!  This tackle again, John Knox, the strong safety, number 44, can't bring down Roddy Jones. And Paul Johnson in this offense, another touchdown here in the second half. Scott Blair will try the extra point. Jones with 13 carries, 214 yards against this Georgia defense. You have to wrap up when you play the option. Jones scores, it's a 10 point game.  So a knee for Nesbitt on a knee. It's over. The streak ends at seven and 10. Here in Athens our final score Georgia Tech forty five Georgia forty two coming up game two of the doubleheader.  is Alabama and Auburn. And this has been a presentation of CBS Sports, home of the SEC Championship."
}