{
  "video_id": "JRDKoZWaiIU",
  "transcription": " Jesus hey guys, I'm TJ. This is RTJ where I do all random things now people I Just saw on Twitter that Hyuna and Dawn performed together They oh, I love them so much. I love that. I love I really hope they they will be they will be more supportive it the people will be will be more supportive of them in this this this  I'm just gonna start and dance like a redhead I don't even what what are they performing? I just know they're performing Okay, this gave me a Joker vibe  oh my god  Oh.  wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait wait waitwaitwaitwaitwaitwaitwaitwaitwaitwaitwaitwaitwaitwaitwaitwaitwaitwaitwaitwaitwaitwaitwaitwaitwaitwaitwaitwaitwaitwaitwaitwaitwaitwaitwaitI to be a fan of fan of fan of fan of fan of  fan of   Fa         K , K , K , K , K , K , K , K , K  This performance, I'm telling you right now, I'm telling you right now, this performance is gonna be one of the legendary couple. This is the first couple that it, oh, I'm gonna go back. I'm gonna, sorry, but I'm gonna start. Three, two, one. Oh my God, Jesus Christ, she's beautiful.  this hit me that popping though in my I don't know how should I react to this I'm just shocked right now I'm like this part right here this wait no  I'm so happy that they performed together. They look wow.  they're going out of the cage this is not good this is not gonna be good this is not gonna be good it's never good when people come out of the cage never oh damn girl  Ooh!  okay this was an awesome and a little steamy performance  Instagram. Thank you for being here. Bye."
}