{
  "video_id": "K418iVP0w6U",
  "transcription": " Hey! This is my first video of 2020. The last video was just saying Happy New Year, but this is my first video of 2020. I hope you enjoy. Oh yeah and also, the video you're about to watch is my own series that I am making. So, enjoy this video. Joey! Wake up! What is it, Dad? You have to get ready for school.  Dad, I don't want to go to school. I want to stay home. Joey, you have to go to school. I don't want to get mad at you, but you're making me mad. Alright, fine. Okay class, can anyone answer this question? What is it Joey? Oh, I wasn't going to answer the question, but I was going to ask if I can use the bathroom. Fine, but make it quick.  We are going to learn biochemistry tips and they're very important. Thanks. I lied. I am just going to sneak back to home.  Yes, I'm home. Well, it's been 30 minutes and Joey still hasn't returned. Okay class, I'll be right back. I'm going to go look for Joey. In the meantime, do the questions provided in your packet. Oh, hello there Mrs. Diana. Oh hello there, Principal. So what brings you here?  So I sent my student, Joey, to the bathroom because he needed to use it. And he hasn't returned for 30 minutes. So, according to the surveillance cameras, I can see Joey running in the hall, heading to the exit. He must have cut school. No need to panic. I'll just contact Joey's parents right away.  Joey, if you're there, come downstairs right now. We have some serious explaining here. Oh shoot, I'm busted. Joey, is it true? Did you skip school? Tell us right now. And don't you even think about lying.  Fine. I skipped school because I didn't want to be at school. Please don't get mad at me. Don't get mad? You don't expect me to get mad? How dare you skip school? You know you need to be in school. Joey, you are grounded for a week. Now go to your room. Waaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa  you"
}