{
  "video_id": "KaK0kzOopw8",
  "transcription": " Yeah, yeah, oh yeah  Chris Jones, representing Fatista Greatness. Now, if you follow me on Instagram or Facebook, wish you should. If you don't, links are in the description. You've already seen my friend right here. Okay, got a homeboy right here, an overweight cat man, trying to make a life change, trying to go from shit to fit, trying to change his life. And I'm going to help him out, decide to take him under my wing. As you may or may not know, I'm going to be starting a second channel with Vince.  It's gonna be called from beginner to a winner and this is gonna be my one of my models right here Alright, let me go ahead and do this him and his brother real quick and I'm gonna show you a few tips Tell me your name brother. My name is Patrick Sampson. Tell them where you're from man. I'm from New Orleans, Louisiana. My boy from New Orleans. Which ward you're from? Sixth Ward. Anybody out of New Orleans, Sixth Ward or close, this your boy right here. Family right here man.  Tell them about yourself brother. This is your boy Rodney. You heard me. From New Orleans, Louisiana. This is my brother Beastmo. What's up? Yeah man, cool guys right here man. Real cool down to earth people right here man. Everybody I've met from New Orleans seem to be nice guys. Shout out to my homeboy Scully from OU Interfitness. He's from New Orleans as well. Right, right, right. You're different. Well anyway guys, I'm gonna show you tips for two exercises because quite frankly, we wanna work out. You know what I mean? You wanna make this video short?  Alright, just gonna show you a couple tips. If you enjoy these kind of tips, be looking at a beginner to a winner coming very soon. Gonna have a lot of beginner tips. So if you're interested in beginner tips, or if you're an advanced guy but you're still interested in learning more, cause some of you guys may be aspiring trainers, you may have cousins, sisters, kids that you want to take under your wing, it may be a good idea to subscribe to the channel as well. Alright, this is a shoulder press right here. Seated.  You got to do man, grab the bar shoulder width, okay? Lift it up, bring the bar down, chin level. You don't got to come way down here. That's going to put way more rotation on the shoulder than needed. You want to keep tension on the shoulder. So bring it down under your chin. Okay? You see a lot of this stuff. I don't know what the fuck that is. Bring it to your chin, okay? Slightly lower to where it's comfortable. You don't want your shoulder to be too low.  to rotate forward. Okay? So keep your chest up, bring it to your chin, bam! That's all you gotta do. Bam! Alright, first thing I want you to do is sit a little straighter. So back up, back, there you go. Put that low back into the seat. Okay? Now bring it down to chin level. Bam! Now bring it up. Easy money. Show them a side view. Show them a side view. Get to the side. Bam!  Alright guys, it's quite frankly, it's easy to show you good form with no fucking weight on the bar. So we're gonna see how he does with some weight. Keep in mind, this is his first time doing this, okay? Let's go.  There you go easy money man easy money look at that Look at that. It's got to be beastly in no time  I can't be sitting around watching people live. I'm away with the tube I did maybe wait  Alright, let's go.  Some good reps Exercise right here is great for shoulder mobility It's gonna keep you from getting injured. A lot of people don't realize this but if you have weak rear delts  That's gonna suffer on your base for the long run always strengthen your rear delts too even as a beginner I'm shorter. I Gotta bring it to my eye level. Make sure you bring it to eye level Okay, if you're tall motherfucker, all of a sudden you gotta bring it up like them. I'm a short motherfucker So I gotta bring it to eye level. You want this at eye level? Okay? Then you need balance, bang  See how I'm pausing? Pause. Pause. None of this bullshit. Pause. Pause.  And what else? Like I said, this can benefit even advanced people. This can benefit people who aren't even beginners. Everybody wants to learn. Even people who've been in the gym a year because quite frankly, you can go to any gym and you'll see people who've been working out three years still look the fucking same. So obviously you're doing something fucking wrong. You might want to subscribe as well. Well anyway, don't forget to like my shit, comment, subscribe, Holla back at you.  You"
}