{
  "video_id": "kcAivnYmQy8",
  "transcription": " Black people in America are systematically disadvantaged in virtually every way, politically, socially, and economically. Obviously it's nowhere near as bad as it was in the 60s, for example, or the 1800s for that matter. But it is a thing, like, it's provably true. There are people who deny this. There are people who say things like, oh my god, stop whining about it. There are even people who make the argument that black people are naturally incompetent, and that's the reason for the discrediting.  All of these attitudes are unfortunate and obnoxious, but I would argue to be expected. You see, as recent as 150 years ago, and that's being generous, black people were literally not considered human individuals. Like, by the actual government, much less the citizens. That's really not that long ago. Like, think of something else fucked up, like the Crusades. That ended like 600 years ago, which is a lot of time for Catholics to get their shit together. Today, the Catholic Church is by no means perfect, but they have a fairly progressive  Pope, who's a lot different from the popes back in the day that used to tell Christians to go kill everybody. Slavery in America was barely a couple of generations ago, though. Societies don't go from thinking certain people are cattle to being welcome in open arms overnight. I mean, it sucks, but I don't think that should be expected. But of course, there's slow progress. Black people eventually gain citizenship and many of the rights that come with it, like the right to own property, or the right not to be property. But it's definitely frustrating for many people to live in a society that  so loudly and proudly advocates things like justice and equality, and still be affected by institutionalized and interpersonal discrimination. Whether it be the fact that people with black-sounding names are less likely to get hired, or the fact that black people are much more likely to be searched and or arrested during a traffic stop, or the fact that black history is marginalized and overlooked 11 months out of the year, among many, many other things. But like the Catholic Church, institutions and societies tend to  get more progressive over time. As regular people gain more access to outside perspectives and information in general, social and economic injustice becomes more apparent and less acceptable to the average person. And like I said, in a country where many of our grandparents' grandparents may have owned or been slaves, this kind of inequality and social attitude can't change overnight, or even over a couple of generations. But how long does it take? Because I know a lot of us think, like, this should be fixed by now. Like, it's no longer  socially acceptable to be openly racist. Obviously there are still racist people, but they usually have to preface their comments with, I'm not racist, but... But there are still a lot of overtly discriminatory systems and institutions. And the only way that these can continue to exist is if people don't know that they're racist, or people don't think that they're racist, or people don't care that they're racist. And it's probably a combination of all three, which is frustrating because these things really do exist. Sometimes I like to imagine what it was like  like for the average white person who lived in the American South in the mid 1900s? My hunch is that many of them weren't overtly hateful and didn't go out of their way to be racist to people. But of course they didn't go out of their way to help either. They just lived in a society where it was normal. And I think it takes a lot to get a society to come together to change something that's normal. And then I like to imagine what it was like for the activists, the people that protested and marched during that time. People that were acutely aware that something was not right.  not right and they wanted to do something about it. I mean, they had to know that things wouldn't change immediately or even possibly in their lifetime. Or maybe they were courageous enough to have that hope. But sometimes I wonder what it's like to live in a society that you know is completely backwards and that you know is still in the changing process and that the change you want may not even occur in your lifetime. But then I think maybe that's what's happening right now. And as I said, I can't compare our experience to the experience of black people that came before us, but there are clearly  some things that need to be fixed. And if history is any indicator, that change could take a couple more generations. Now of course that doesn't mean we don't talk about it or try to get anything done. I mean, that's exactly what propels the change. And in the internet era where information travels at light speed, I'd expect societies to improve much quicker than they ever have. So I don't know if this video can be considered optimistic or pessimistic, because oftentimes we're trying to spread information and get things done and then you check the news and dumb shit is still happening.  or you're wondering if anything you're doing is having any effect whatsoever. But sometimes I think, maybe we just need more time. That's just me though. I want to know what you think though. Drop a comment. I also want to give a shout out to all the new subscribers. How you doing? If you'd like to, please give the video a thumbs up. And subscribe if you like my hair.  you"
}