{
  "video_id": "KdqPQ4cFzZE",
  "transcription": " Crazy God it was the pulse pounding a heart-stopping walk of his life filled with words of prayer Nick Willenda put his life literally on the line The world's longest blindfolded basketball shot  The largest number of bees on a person. Nothing will prevent a beekeeper from China from smoking a cigarette. Even 1,000,000 bees that cover his body.  25-year-old Jaio Bingo set a record at the end of May 2015 as a man with a record number of bees on the body. The total weight of the insects was 108 kilograms. He endured 2,000 bites on his body, but at the same time, he still managed to smoke a cigarette. As the extremal told Later, it helped keep the bees away.  We're going to release.  Alright, I'm out. The whole world is watching you. I'm going home now.  Jump into the water from the highest altitude, 58.8 meters. A brave man who dared to jump from a height that exceeds the top floor of the Tower of Pisa was a Swiss Lasso Schaller. Schaller chose a picturesque waterfall to set the record.  a speed of 123 km per hour before hitting the water. The highest jump into water horizontally in a manner akin to the belly flop. It was made by Professor Splash, whose name is Darren Taylor. Darren jumped from a height of 11.5 meters into only 30 centimeters depth pool. Probably, this was a very painful record.  so  You  And a big chance at history right here. You can witness it at the Isle of Classic.  The highest jump on the motorcycle was made by Robbie Madison. December 31, 2008, in Las Vegas, he was able to jump on a copy of Paris Arc de Triomphe. The height of the jump was 36.5 meters. Robbie is a motocross star and constantly participates in the  in competitions of varying complexity.  target at a distance of 5 meters using only her legs. The record was recorded as the furthest shot from the bow with the help of the feet. Guinness World Record for the biggest dominoes. 500,000 dominoes fell one by one forming various cool figures. In the final, everything turned into a picture of the Sydney Opera House. Guinness World Record breath hold.  It was set by German freediver Tom Sietes in a rival with the former record holder Brazil, Ricardo Bocce. Both athletes settled in tanks of water and tried not to yield to each other in the duration of the breath hold. This time Sietes managed to hold underwater without air for 22 minutes and 22 seconds. The previous record of breath hold was made by the Brazilian man that was recorded earlier in the Guinness Book of World Records was 20.  you"
}