{
  "video_id": "Kh9MP3gY2nM",
  "transcription": " Uh, good morning. If you're asking or wondering, I did wake up this way. No biggie though. Nothing a little bit of a lot of makeup and a lot of hair supplies won't fix. I decided to inspire you all with my blue coffee mug. How is that going to inspire you? It's gonna inspire you to make a nice cup of coffee and get about your day. Also, in celebration of Christmas, since it is coming up,  Amanda insisted on wearing his elf outfit. I couldn't tell him no. I couldn't tell him no. Also, I put the Christmas tree up. And it is a very sad excuse for a Christmas tree, considering this is my first apartment and my family's stolen all of my Christmas ornaments, which are not mine, they're actually like handed down, so they're actually my mom's right now. I just haven't been able to do anything with it. So, I have a white Christmas tree.  Christmas tree with blue lights and I think that is as far as I'm gonna get with this tree. Anywho, Christmas is on its way. I feel like a lot of you, especially men, are struggling to figure out what to get your people. And by people, I definitely mean girlfriends. Well, here I am to help you out as much as one can.  Mainly I gotta help the girls out. I gotta help you guys figure out what to get a woman What to get a girl what to get your girlfriend? Uh, you know what to get any female in general Listen, I get asked a lot. What do I buy for my girlfriend go shopping with me? That's actually an excellent option Take me shopping with you The only thing that I'm going to suggest you have to buy me one item and it better be chocolate guys. Listen  You know what? It's gonna be the super most hard question I've ever had to answer ever. We're girls, okay? I feel like we are the easiest thing to shop for. We like just about everything. We like things that are pretty. We like things that make us pretty. We like things that smell good. We like things that feel good. And I'm not even talking about like,  You know something that feels good to my little fingerprints a fuzzy blanket. We like things that taste good We love chocolate things that are sweet a whole entire set of Bath stuff your bubble bath. We like things that are colorful some girls like pink some girls do not I don't really care for pink but Whatever we like food. We like animals. I'm gonna be completely honest  I was given a coloring book. I color in that thing furiously. Coffee. Always. Gift cards. Gift cards are good. You don't have to do anything. You don't have to do any type of thinking for the shopping. Some girls... Some girls like to read. Now, if you get me a book, I would read the cover. Not because I'm ungrateful, just because I am way too ADHD to focus on anything a book has to offer me.  You can get diamonds. You can steal any kind of Valentine's gift and use it on Christmas. Like, you know, a singing card. And more chocolate. Flowers. Don't forget flowers. For some reason, flowers just show that you've been thinking about them. And it's nice. If you can't find anything, at least go with some flowers.  in the car may not be the best gift, but it could mean more to the right person. So that's it. I really hope that you're gonna get your lady friend an awesome gift this Christmas. Because when she gets that furry blanket and she gets her bath and body stuff, she's just gonna be so happy.  Come here, Amanda. Oh, man. Amanda, keep your clothes on! This is a serious issue."
}