{
  "video_id": "KjCMdFUl9FI",
  "transcription": " Good morning everyone, it's Natalie welcome back to my channel. I'm actually in my garage right now and I am getting ready to go on a picnic with Evan and Christian and I'm getting all the stuff together and we're gonna go to like a park by the lake and have a picnic and probably go swimming and  chill so that's I'm getting ready for and I'm basically almost ready so we got the noodles the towel some food speaker and then my phone and then all the food in there so let's go to the picnic hey guys so we made it to the lake say hi  So yeah, we're at the lake. Here it is. And we got all of our snacks and we're about to go jump in there. So yeah.  Hey guys, so We just went on a tiny trip we only went like  There and then I couldn't touch anymore so I realized it was time for me to go back and get a floaty. But here's Evan. And here's Riley. We're gonna attempt this again. Yeah, with these. I'll make it this time.  Go Dash!  sunny no clouds anymore.  I think I'm gonna go. My hair is looking so blonde. I love it. I hate my hair when I have dark hair. Maybe it's just this lighting but I feel like it is getting a lot lighter. Since being in the sun a lot.  celery and carrots and ranch because I wasn't that hungry but I was hungry I don't know I just eat even if I'm not hungry so yeah oh but I have to show you something so the other day at Target I don't think I showed you guys but I might have can't really remember but I got these Finn and Jerry's chocolate chip cookie dough chunks and they're like snackable and so they're not like bad for you I mean it's not like good for you but they're not I don't know they have like eggs in it  so you can't like risk getting like salmonella or whatever but you just like keep them frozen and they're literally just like cookie dough like this you just eat it and a lot comes in here actually like I've been eating this like all week like good like handful or whatever cause I like to eat a little dessert after my dinner and these things are so freaking good  will  So I hope you guys like that video if you did please give it a big thumbs up subscribe down below or this video And I'll see you guys later. Bye"
}