{
  "video_id": "KknUO0Elk0I",
  "transcription": " Unchapped! United Neighborhood Citizens Home Appearance Patrol. Starring Uncle John and Jack Vale as the Unchapped employees. Jack, I'm standing right over here right by, uh, it looked just like you.  How come I don't see you? Because I don't know, Jack, I'm right over here, right next to you. I'm looking that way, I don't see you anywhere. I'm down here, Jack, come on down. It's like a garbage can. What street are you on? I don't see you. Like, I'm on the same street that you're on. Over? I'm on the same street you're on. You said across the street? Yeah, kind of north of you, Jack.  Jack, I'm kind of north of you. He doesn't understand me. Tell him I'm just right down from him. He's right down from you. OK. Do you see another guy in a yellow? No, he's on the ground somewhere. Can you tell him? Right there? He's right across from me. My man's right over here. To your left, to your right. Behind you. Is that guy there?  Hey, do me a favor. Tell this guy where I'm at. He doesn't know where I'm at. He's at a strip club in Vegas. I'm just down the street from it. Would you mind telling this guy where I'm at? I don't know where you are. The guy in the yellow is right down the street. Is that him right there? Yeah, that's him right there.  Come on, look right. Hey, tell this guy where I'm at. You know the area? Oh, yeah. All right, just hit the top button. Hey, bud, he's on 3rd and Broadway. I'm looking for him right now. I don't see him. Over. OK, he's right across from, uh... Yeah, I know he's at the Hard Rock Cafe. I'm looking for you now. He's right here.  Well, tell him we're here. Hey, turn around. Right here. Right here. Right here. No, right here. Here. No, look up. Look up. Look up. No, no, look straight. I hit him in front of you. Hold on. Hold on. Hold on. It's me. It's me you're talking to. Give me one minute. I'm looking for my buddy. 20 minutes.  I was talking to you. I don't think so. I'm on the phone with my buddy. We work for the same company with my buddy.  you"
}