{
  "video_id": "koEB4XPd9IM",
  "transcription": " The American Pronunciation Guide Presents  The.  Hi, this is Stu Mahan welcoming you to another exciting year of sports on NBC and Channel 3. This year, of course, marked the return of NCAA football to Channel 3. And with it comes the added thrill of color. That's right. For the very first time, the weekly collegiate game of the week is being telecast in living color on Channel 3. Now, in the weeks to come, you'll be seeing some outstanding games, Michigan versus Minnesota, Notre Dame, Michigan State, UCLA,  All of this will be highlighted by the first football triple header in color on New Year's Day. Now that'll be the Sugar Bowl, the Rose Bowl, and now the Orange Bowl, all being brought to you live and in color, marking a thrilling combination to a colorful collegiate football season. But Channel 3 has still more in store for local football fans. For the second straight year, KCRA has concluded arrangements with Sacramento State College to telecast three of its important home games.  In addition to our full coverage over radio KCRA October 24th next Saturday Channel 3 will bring you all the thrills and excitement of the big Sacramento State homecoming game against Chico State and then November 7th It'll be the Hornets versus Humboldt State and on November 14th the big one with the Cal Aggies All the games will start at 2 p.m And this is still another expression of Channel 3's genuine desire to bring events of local interest to you our viewing public  Swimmers, take your marks. Culminating Channel 3's outstanding sports coverage this year is the 28th Olympiad from Tokyo, Japan by means of the new relay satellite. NBC is bringing you tape and direct coverage of a sporting event thousands of miles away.  And as we said before NBC and Channel 3 are your sports headquarters sports of all kinds if you're a weekly viewer of the NBC Sports Spectacular, you know what I mean weekend and week out the Sports Spectacular brings you exciting coverage of events throughout the world Well, that's about it I think you'll agree with me that Channel 3 has some of the most outstanding sports coverage in the entire area Coverage which makes Channel 3 your station for example  exciting viewing into the world of sports. This is Stu Nahan reminding you to stay tuned for all of the color and thrills of the Olympic Games in Tokyo immediately following this program. And be with us next Saturday at 2 o'clock for our first telecast of the big Sacramento State homecoming game against Chico State live from the Hornet Field. Until then, so long."
}