{
  "video_id": "KPWKVLDh01Y",
  "transcription": " you  I am Imun Basara Kharija. I am from the village of Pusolap. I am from the village of Kikina. I have a small farm, a small farm, a small farm, a small farm, a small farm, a small farm, a small farm, a small farm, a small farm, a small farm, a small farm, a small farm, a small farm, a small farm, a small farm, a small farm, a small farm, a small farm, a small farm, a small farm, a small farm, a small farm, a small farm, a small farm, a small farm, a small farm, a small farm, a small farm, a small farm, a small farm, a small farm, a small farm, a small farm, a small farm, a small farm, a small farm, a small farm, a small farm, a small farm, a small farm, a small farm, a small farm, a small farm, a small farm, a small farm, a small farm, a small farm, a small farm, a small farm, a small farm, a small farm, a small farm, a small farm, a small farm, a small farm, a small farm, a small farm, a small farm, a small farm, a small farm, a small farm, a small farm, a small farm, a small farm, a small farm, a small farm, a small farm, a small farm, a small farm, a small farm, a small farm, a small farm, a small farm, a small farm, a small farm, a small farm, a small farm, a small farm, a small farm, a small farm, a small farm, a small farm, a small farm, a small farm, a small farm, a small farm, a small farm, a small farm, a small farm, a small farm, a small farm, a small farm, a small farm, a small farm, a small farm, a small farm, a small farm, a small farm, a small farm, a small farm, a small farm, a small farm, a small farm  I was born in the village of Aibam. I was born in the village of Aibam. I was born in the village of Aibam. I was born in the village of Aibam. I was born in the village of Aibam. I was born in the village of Aibam. I was born in the village of Aibam. I was born in the village of Aibam. I was born in the village of Aibam. I was born in the village of Aibam. I was born in the village of Aibam. I was born in the village of Aibam. I was born in the village of Aibam. I was born in the village of Aibam. I was born in the village of Aibam. I was born in the village of Aibam. I was born in the village of Aibam. I was born in the village of Aibam. I was born in the village of Aibam. I was born in the village of Aibam. I was born in the village of Aibam. I was born in the village of Aibam. I was born in the village of Aibam. I was born in the village of Aibam. I was born in the village of Aibam. I was born in the village of Aibam. I was born in the village of Aibam. I was born in the village of Aibam. I was born in the village of Aibam. I was born in the village of Aibam. I was born in the village of Aibam. I was born in the village of Aibam. I was born in the village of Aibam. I was born in the village of Aibam. I was born in the village of Aibam. I was born in the village of Aibam. I was born in the village of Aibam. I was born in the village of Aibam. I was born in the village of Aibam. I was born in the village of Aibam. I was born in  I was told that the Japanese were going to attack us. They were going to attack us. They were going to kill us. They were going to kill us. But we were not afraid. We were not afraid. We were not afraid. We were not afraid. We were not afraid. We were not afraid. We were not afraid. We were not afraid. We were not afraid. We were not afraid. We were not afraid. We were not afraid. We were not afraid. We were not afraid. We were not afraid. We were not afraid. We were not afraid. We were not afraid. We were not afraid. We were not afraid. We were not afraid. We were not afraid. We were not afraid. We were not afraid. We were not afraid. We were not afraid. We were not afraid. We were not afraid. We were not afraid. We were not afraid. We were not afraid. We were not afraid. We were not afraid. We were not afraid. We were not afraid. We were not afraid. We were not afraid. We were not afraid. We were not afraid. We were not afraid. We were not afraid. We were not afraid. We were not afraid. We were not afraid. We were not afraid. We were not afraid. We were not afraid. We were not afraid. We were not afraid. We were not afraid. We were not afraid. We were not afraid. We were not afraid. We were not afraid. We were not afraid. We were not afraid. We were not afraid. We were not afraid. We were not afraid. We were not afraid. We were not afraid. We were not afraid. We were not afraid. We were not afraid. We were not afraid. We were not afraid. We were not afraid. We were not afraid. We were not afraid. We were not afraid. We were not afraid. We were not afraid. We were not afraid. We were not afraid. We were not afraid. We were not afraid. We were not afraid. We were not afraid. We were not afraid. We were not afraid. We were not afraid. We were not afraid.  I am very happy to be a teacher. I am very happy to be a teacher. I am very happy to be a teacher. I am very happy to be a teacher. I am very happy to be a teacher. I am very happy to be a teacher. I am very happy to be a teacher. I am very happy to be a teacher. I am very happy to be a teacher. I am very happy to be a teacher. I am very happy to be a teacher. I am very happy to be a teacher. I am very happy to be a teacher. I am very happy to be a teacher. I am very happy to be a teacher. I am very happy to be a teacher. I am very happy to be a teacher. I am very happy to be a teacher. I am very happy to be a teacher. I am very happy to be a teacher. I am very happy to be a teacher. I am very happy to be a teacher. I am very happy to be a teacher. I am very happy to be a teacher. I am very happy to be a teacher. I am very happy to be a teacher. I am very happy to be a teacher. I am very happy to be a teacher. I am very happy to be a teacher. I am very happy to be a teacher. I am very happy to be a teacher. I am very happy to be a teacher. I am very happy to be a teacher. I am very happy to be a teacher. I am very happy to be a teacher. I am very happy to be a teacher. I am very happy to be a teacher. I am very happy to be a teacher. I am very happy to be a teacher. I am very happy to be a teacher. I am very happy to be a teacher. I am very happy to be a teacher. I am very happy to be a teacher. I am very happy to be a teacher. I am very happy to be a teacher. I am very happy to be a teacher. I am very happy to be a teacher. I am very happy to be a teacher. I am very happy to be a teacher. I am very  The land is fertile and fertile, but the land is not fertile. The land is not fertile, but the land is fertile.  I am a teacher. I teach my students to be good at their work. I teach them to be good at their work. I teach them to be good at their work. I teach them to be good at their work. I teach them to be good at their work. I teach them to be good at their work. I teach them to be good at their work. I teach them to be good at their work.  I am a teacher. I teach at the school. I teach at the school.  The people of the village are very happy to see us. We are very happy to be here. We are very happy to be here. We are very happy to be here. We are very happy to be here. We are very happy to be here. We are very happy to be here. We are very happy to be here. We are very happy to be here. We are very happy to be here. We are very happy to be here. We are very happy to be here. We are very happy to be here. We are very happy to be here. We are very happy to be here. We are very happy to be here. We are very happy to be here. We are very happy to be here. We are very happy to be here. We are very happy to be here. We are very happy to be here. We are very happy to be here. We are very happy to be here. We are very happy to be here. We are very happy to be here. We are very happy to be here. We are very happy to be here. We are very happy to be here. We are very happy to be here. We are very happy to be here. We are very happy to be here. We are very happy to be here. We are very happy to be here. We are very happy to be here. We are very happy to be here. We are very happy to be here. We are very happy to be here. We are very happy to be here. We are very happy to be here. We are very happy to be here. We are very happy to be here. We are very happy to be here. We are very happy to be here. We are very happy to be here. We are very happy to be here. We are very happy to be here. We are very happy to be here. We are very happy to be here. We are very happy to be here. We are very happy to be here. We are very happy to be here. We are very happy to be here. We are very happy to be here. We are very happy to be here. We are very happy to be here.  and  I'm not going to be able to do it."
}