{
  "video_id": "Ktkdr0OHQms",
  "transcription": " so  We'll take a quick tour of the historic New Salem State Park in Petersburg, Illinois. Don't blink, because you'll miss it. We're just going to drive through the main park. The historic village, I don't think they'd appreciate me having a bike in there, so I think we're going to pass on that, and I'm not going to walk around it.  It is kind of nice back here, but there's not much to it. If you don't go into the historic village and see the museum, there's really not a lot to it. A lot of parking area. There's the gift shop, ice cream, toast office. And then behind that building there, off that direction is the historic village,  There's a lot of cabins and neat stuff out there. There's Abraham Lincoln himself. Guess we could go get a shot of Abraham Lincoln for you. Like you guys have never seen Abraham Lincoln before. We'll walk up there and let you get a good look of Abraham Lincoln.  Yeah, so there's the visitor center gift shop. And there's old Abe Lincoln himself. With malice towards none,  There he is guys Abraham Lincoln This is New Salem State Park, so don't feel like you got to make a trip to Illinois just for this I've lived here my whole life and I've been in there one time And that was because we went on a school field trip for school  So you're probably not missing anything. And then we'll go over here to the picnic area. I got to remember to check my tire pressures when I get home. It just feels funny. When I turn to the right, it just feels like it falls into the dirt.  the corners really hard and when I turn left it feels normal. So I don't know, I'm gonna have to check tire pressures and tire wear. I don't think it's a tire wear. I've only got 4,700 miles on the Monster so it just barely broke in. Yeah, there's a picnic area and playground. Pretty impressive I know. Oh, there's a shitter.  That's a good-looking shitter. Yep, pretty impressive. See, I just barely turned and it just fell to the right. Of course, I was riding one-handed. That probably didn't help, but I don't know. It just seemed like it was wanting to fall over that direction. Maybe it's just me. I haven't ridden that much yet.  Squirrel. That's for you, LJ. You and your squirrel suit. There you have it, New Salem State Park. Big fun. There's another squirrel.  So if you ever come to Central Illinois, instead of going to New Salem, just give me a call, maybe we'll go do something really fun. Cause this ain't it. There's not a whole lot of fun in Central Illinois anyway. There you have it.  New Salem State Park. Torqued Off out. See ya. Oh, just a tidbit of information. If you ever watched the movie Bad Teacher, it was some of it filmed out here. And at the state capitol in Springfield. So, I guess some exciting things happen here.  Not much though  I"
}