{
  "video_id": "KvX3NE3KJ9s",
  "transcription": " In 2009 was rated by customers at 8.4 out of 10 when we were selling it as a PDF at the price of $47 for each download. How to Persuade Women, Male Edition is a men's guide to attracting, dating, and knowing women.  the techniques of knowing women to the core. You'll also learn how to raise your defenses against drama and anxiety queens. Jake Hollow, author of both the e-book and paperback, is going to reveal his secret strategies for attracting the female species, from gaining strong male confidence to learning the five reasons and types of female seduction, and the truth about body language, plus more. In this sizzling dating manual, Jake unfolds a unique law of attraction strategy that you  use to boost your women compelling power. Point of fact is positive thinking can affect your love life in such an intense way. The interesting part is as clearly laid out in How to Persuade Women, law of attraction can enhance your mesmeric impact on the she race. There are tons of tips and tricks that this book can offer to men who want to enhance their dating or social life. It enlightens several shady aspects about relationships allowing you to develop healthier future romantic encounters.  Check out just a few of the innumerable things that you'll learn from this guide the Jake hollow guide on how to persuade women relationships autopsy this diagnostic tool will help you to assess your previous relationships detect the problem areas and heal them the proper way to take risks without being stupid Six steps in getting rid of your past burdens and having more control over your life Learn the four types of women whom you must avoid  and know the red flags. Strategies that you can apply to reach your most wanted outcome, no matter how seemingly impossible. And other shocking details and tactics any man wouldn't want to miss. Let me be clear, he doesn't have an overly complicated method. He's more or less a clear-cut guiding principle which shows you how to amplify your success with women by focusing on three specific areas. Attraction. What good would any book on dating be if it didn't give you clear-cut  Easy to follow tricks to sparking attraction. Avoidance. Some women are just time wasters. Others just aren't right in the head. And they can put your entire life in jeopardy. I'll show you how to pick them out of your life like lice eggs. Abundance. This is where you put the first two things, attraction and avoidance, together to multiply your success infinitely. Think of it as the universal law of creation, but finely tuned for dating and seduction purposes.  Just reading these books won't help you. The way these books can help you is by doing the following. Take notes while reading. Write down all the questions asked in each book and respond to them. Practice what you learn and think about becoming a teacher who creates, instead of being a follower. The reason for the success of these books is not because they're a copy of someone else's work. No, it's because of the format used. What do I mean by format? Well, when you pick up a paperback version,  that it's not formatted in the traditional book size, nor does it really feel like a book. If you're a person who enjoys learning, you'll notice that the size and look of the book is similar to a textbook from school. That was done on purpose because it felt right. That is what makes these books stand out from the rest. You may find the male edition and female edition both at the following links.  you"
}