{
  "video_id": "kxIj6W7DQZU",
  "transcription": " All the scores, all the highlights, all the fans. This is Friday Night Football on NBC 25.  3. On the next Montrose Drive, it's Elasovic again. Going up the middle, exploding through the middle I should say. This is going to pick up 38 yards and go inside the home plate.  3. Shelton under center... Alex Elasovich spins into the endzone to give Montrose a 14-0 lead. Montrose 27-12. 3. Moving on... We have Heritage at Midland Dow in a game that would turn into an absolute romp. Dow's Caleb Richard makes a 40-yard run in the second quarter. Dow would later score on that drive as they would do many many times this evening.  Next up, we're going to have a turnover here by Heritage. Fumble in the rain. Tough to hang on to that wet ball. Number two, Marlon Evans coughs, Kevin's coughs it up and Midland Dow recovers inside the five. Then another first down by number 22, Caleb Richard, who seemed absolutely unstoppable tonight. He puts his shoulder down and picks up a nice game there. Then Richard strikes yet again with a huge pass play to number 85, Mike Robb for another, another touchdown, making it a score of 49 to nothing before the end of the first half. Midland Dow.  the game.  3. Davidson visiting Carman Ainsworth...Carman looking to go 2-1 after last week's  3. On the ensuing drive, Davison opting to punt, but the snap gets away from Graham Hungerford. He tries to get it away, but Carmen defends Jalen Bradley for the safety. 34-8 Carmen at that point. 4. Next Carmen possession, it's 4th and 1. Carmen decides to go for it. Tyler Minor with a direct snap. He turns the corner and goes 34 yards for the score. Carmen is up by 2.  31 to 8 at that point and that's the way it ends. Cavs are now 2-1 on the year.  FENTON LEADS SWARTS CREEK 14-6.  the Tigers take a 14-6 lead. Late in the third quarter, Swarts Creek fires back. Watch this pass. He's going to drop it right in the bread basket of Kenyon Spurlock who hauls it in. Trust me, it was pretty. He goes 60 yards and Swarts Creek were too strong tonight. They win 35-19.  3. Next up, Goodrich at Corona. Goodrich driving in the second quarter.  to Michael Marston who ta 40 plus yards for the touc nothing martians. We're g the second quarter. Now E the big man who gets in f Marchans win a big one on to six. A few more scores to now. Durand blanked for t Central has all kinds of beats them at home. 48 to n  WEST VERSION  3.  your favorite mid-Michigan high school football highlight scores and of course our game of the week. I'm Corey Kopik and I will see you again tomorrow night for some college football highlights including Central Michigan's matchup with Syracuse, Michigan's game with Miami of Ohio and Saginaw Valley State looks to even their record at one on one as they battle Tiffin. Thank you very much for joining us and have a great night.  so  ♪"
}