{
  "video_id": "l2J0M0D38m8",
  "transcription": " Okay, so we finally finished the master bathroom and it's dark in there right now, but we have a motion sensor switch which will, as soon as I step in, the lights will come on. Let's take a look.  So the lights just came on by motion. So the ceramic tile plinth floor we did on thirds like wood floor. We also built a glass tile feature wall on the TV on it. And here's our amazing shower. The shower, this is an amazing shower.  Have windows inside tempered glass We have two ring shower heads 20 by 20 inch Each side is pretty much like a his and her shower. We don't have the door on yet, but the pan is a 100 inches long As you can see we have one full long curb and two corner benches  We have a sprayer on each side we have a controller that controls the jets the sprayer and The temperature gauge also The rain heads that's what that does right there. So six jets per side Six on that side six on this side Two windows these windows were not here. This is the exterior wall  What we had to do was I had to run a beam up top So I had to take out the whole wall, run a beam. We actually put in an 85 inch Soak dish niche or niche with glass tile in the back as you can see So it turned out very well The doors on the way, the glass doors will be 8 inches high, one door  We put in Vessel Bowl Sinks  Vesselbow sinks, LED faucets, the smart mirrors LED also put in speakers which sound amazing. So the client is extremely happy. It turned out very well. It's a good job. The shower pan is pitched. It doesn't, I mean, it definitely drains.  Now what I'm going to try to do is turn off the lights because this is a motion sensor light and show you some of the features. Well in the next video I'll show you. Alright, I'm going to attempt to turn off the lights so I can turn on some of these LEDs like in the shower head. Even that light in the middle has a dimmer switch. Smart mirror has LEDs. The faucets have LEDs.  So let's just see if we can lighten it up a little bit. Let me turn off the... manually turn off the switch. So we're in the dark now. If I come over to the faucet, when I turn it on, all the heat is on the faucet. Blue means cold. If I turn it to the right or left, red is hot.  Let's try this one over here. Yeah, see the motion sensor light comes back on. This one is turning green, green, well red is hot and green turns it to between warm. That's pretty cool.  Turn off the lights again. You can see it also will turn on the LED mirror. You can see this mirror also has LEDs on it. And that power button in the middle turns it off.  Try and get this faucet here to go warm which would be great Turn the lights off one more time and we're going to try for now the rain shower here which this is tricky because I'm going to figure out how which one of these so the selectors in the middle three knobs  Hot and cold on top. So I have to figure out which one is which. One is the jets. Not that one, that's the sprayer. Pretty powerful. Okay, switch it again. Maybe that's it. Those are the actual jets, so that's not it.  I think the first one is the rain shower head. This one here. So this is going to come out and it's going to change colors. So it should have an LED on it.  You see it now, the LED. That's on the rain shower head. Pretty cool. When you take a shower, it lights up. Green, blue, I think we have it all set up. It's a pretty cool feature.  and the light in the middle. If it's on a strip light, it's on a strip light or it can come down. So, just wanted to show you some of the features. And this thing works excellent. So I'll be talking back at you, so.  you"
}