{
  "video_id": "l4yzdnliEPE",
  "transcription": " Star Wars Forces of Destiny Sneak Peek  and maybe a little bit prior to that where they were going to show a series of short stories involving the ladies of Star Wars and So we're gonna get a sneak peek at that here today. So let's get a look Ray BB-8 Got us some speeder bikes Awesome How did I find you Find your home  Find your courage All right Jenner so Find your destiny Oh Princess Leia and Sabine Wow Princess Leia speaking to new hope I mean, yes Sabine speaking to Panama Oh, we're gonna get return of the Jedi Leia with the Ewoks  Awesome. Oh, Sokka! Shape us into forces of destiny. Ooh, Yoda, and that look like Anakin right there. Ooh, look, damn, that look like Varys. All right, Star Wars Forces of Destiny, July 3rd on youtube.com, and then July 9th on the Disney channel. So, guys, we're gonna get a really, really exciting series of short stories  Star Wars  to have Sabine speaking with New Hope Leia. If you recall in Rebels, we did get a much younger Princess Leia. I believe she may have been about 16 or 17 at that particular time. It was in season two of Star Wars Rebels, where we got a young princess who actually met, oh, I'm sorry, a young Princess Leia who met with the Rebels, and now we are seeing  Sabine speaking to Leia when she's much older and Possibly around the events of new hope so that's very very interesting right there guys So I want to know what your thoughts are in regards to this sneak preview. Will you be watching this particular series? And what do you think of the animation? I do like the animation not as good as rebels or Clone Wars very similar to and I mean the Clone Wars. There is another animated series  based upon the Clone Wars, which is simply called Clone Wars, that came out sometime before the Clone Wars. And there is a difference between the two series, guys, if you don't know. So that animation kind of reminds me of Clone Wars animated series there, just a little bit, not quite the same, but more closer to that series than it is the Clone Wars or Star Wars Rebels.  So guys, I want to know what your thoughts are. Please leave those comments down below. I will be checking and responding to those comments. Please like and subscribe and may the force be with you always. Really, really exciting stuff guys. Very, very nice."
}