{
  "video_id": "ldzt9uhf9_s",
  "transcription": " This is BBC World News. I'm Regan Ahmed. Our top stories. Several American states pledged to ignore President Trump's move to withdraw the US from the Paris climate change deal. We report from California. The American Secretary of Defense calls North Korea a clear and present danger, but says he's encouraged by China's attempts to help contain the threat.  questions about health care and nuclear weapons for the two leaders competing to be Britain's next Prime Minister. And tight security ahead of the European Champions League final later on Saturday. Police are on high alert after recent incidents.  Hello and welcome to BBC World News. The White House has defended Donald Trump's decision to pull the US out of the Paris Climate Agreement. Administration officials say it's now up to other world leaders to decide whether to sit down and negotiate a new deal. Among some of the American states that say they'll simply ignore President Trump is California. It sees its future prosperity depending on  on developing clean energy. James Cook reports from Kern County, north of Los Angeles.  deal is historical, that it's no longer relevant. He's talking about the Sino-British Joint Declaration. That's right. After 20 years, it had no practical meaning at the present time. How committed then is Xi Jinping and China to the autonomous rule of Hong Kong, given those sorts of statements?  Well, the former Deputy Assistant Secretary of Defense for Middle East Policy, Brigadier General Mark Kimmett is in our Washington studio. Let's have a chat to him now. Thank you very much for joining us and for your time. We've heard that before in terms of the no-fly zone and that was a plan a number of years ago. But now that Russia is in there, how is it possible to do that without engaging Russia? But everything we've heard from the Russians is that they're not willing to accept what you describe. So if the US goes in  They're engaging Russia. They're going in for all-out war. Surely that's the issue.  Let's go live to Sicily where President Donald Trump is speaking. He's addressing troops at an Air Force base. Let's have a listen.  Flip. Oh my goodness. Without crashing, the driver, Leo Donnell, who goes by the nickname the Mad Scientist, you'd have to be, managed the feat in Las Vegas. And as they often say, please don't try this at home. Amazing. Much more coming up on BBC News. I'm on Twitter at BBC Redgit Island."
}