{
  "video_id": "lK8vJZ1x9as",
  "transcription": " Get those guns up! Get those guns up! Where'd they go? The light post. Light post? Okay. Ready? All three. Let's fuck these guys up. Hey! Hey! They're moving, they're moving. Chris, lead a push. Take this building. We need another mate. Another mate. Another mate. They're wide, they're wide. I got one. Here. Hey, this building emptied itself to attack us. Go, go, go, go, go, go, go, go!  If you have an angle, time to go.  Hit! Back him up, back him up! Hit!  Get back inside, get back inside. Get back inside. Hit! A lot of hurry up and wait. Oh yeah. In the truck, out of the truck, in the truck, out of the truck. And then so we just made an assault on the north end of Argoon starting yesterday afternoon and we took it. So here we are. We've made it up to the mosque and pretty much that was our end of advancement. Some of our other dudes actually made the assault on the jail, I believe, too? No, not the jail. Ranger took the jail.  We actually snuck all the way around the town and then came in the mosque from the rear and we were able to take the mosque from them which has never been done before apparently in the history of Airsoft at Shelby. We did that, took their flags, probably put a picture in like right here. Saddle, saddle.  We slept for 11 hours Get down bitch get down And then we took the the hotel Yeah, they went into the hotel without even firing a shot except for the first gonna kill the first guy on they Wipe that deal like that's that they're sleeping and stole their water. We have like 13 cases of water. They're fucking salty Also yesterday his gun went down the mark 46. Yeah, me and me and the mark 46 don't work. So  One of the other guys got hurt on Friday and he let me borrow his weapon. His uh... screw in there. I did not break McNutt this time, he broke himself. He broke himself. I was there, he broke himself.  Don't like them by your TMS guys stock batteries don't do it bitch betters All the air movement hey nice Ranger kid by the way what my PC  A fucking hit!  Let's go  Hey, is there still a dude up there? Hey, let's fuck these guys!  We're not cab, but we're going. Yeah, one sec. Hey, gun truck, move. I thought it was ceasefire.  Go, go, go! Go, go, go! Go, go, go! Go, fucking go! Go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go, go  Get our boys up before we advance  Make it quick, long strides. You're gonna get hit! Just fucking go! Keep going! I'm sorry, I'm sorry, I'm so sorry. Relay! Relay!  Watch your fucking LEDs!  Right here that's them. Oh keep that shit locked down  The G&G one? Don't empty it, so that kilo you can reload too. No, I'm fine. You want to move with the Rangers? You want to move with the Rangers? Why don't we do it? Yeah, let's fucking do it. We can move across. Wait, now wait, wait. Wait. Wait. Now.  Thank you!  No plates man"
}