{
  "video_id": "Lo9uUfSSBg0",
  "transcription": " When you get a fight like this that everybody's been talking about it's always so interesting to see these opening moments here at round number one. Now his opponent got away from that uppercut. A well-placed overhand right.  Oh! Round number one, and he's already down. And if he survives here, Joe, you wonder how that's gonna affect him for the rest of the night. Because if we expect him to be aggressive, will he be tentative from now on? One, two, three, four, five. Down he goes. Now up he gets. And if he wants to stay up, he's gonna have to grab on.  Kill a little time. Halfway through round number one, the Brown Bomber's right hand scores well that time. The Lion's showing you a little defensive skill there. He'll move away from that punch.  The Brown Bomber's blocking ability is doing well for him there. Teddy, he's wobbling all over the ring. You know, Joey can't use his legs right now, so he wishes, and it's too late for him because he wasn't taught, but he wishes he was a guy who was taught how to slip right in front of a guy and make the guy miss. Then at least he could do that. Right now, his only chance is to grab because the legs are not going to be there for him. Look at that. Smart veteran move. Hurt, so you hug. Exactly what the doctor ordered.  Solid left hand to the head A little head hunting with the right round comes to an end We saw the knockdown there in that round a little bit of a momentum gainer Yeah, obviously it gives you confidence, but you know what it can also be a momentum killer believe it or not I also know I've had guys where the worst thing that happened to him in the fight was when they saw the knockdown  because they thought it was just gonna keep happening. And they thought about only the punch they landed, not how they set it up. So they got away from the game plan. Able to get away from that head shot with the block.  Good defense just covering up down low. Well, nowadays we have so many different weight classes. Used to be only eight weight classes. Now with all the super and juniors attached to every weight class, you can go up and down the scale with ease throughout your career. Is that good for the game? No, I don't really think it is because you're making it too easy for the fighters. You know, I'm not saying that it's not good that they have an alternate to a  a weight class, but a lot of times when you make things easy, they're going to go for the path that is easier. In other words, somebody should be a middleweight. Now all of a sudden they're going to be a light heavyweight. They're going to be a super middleweight. Well, with a little discipline, they would have fit into that middleweight frame. It wasn't that they couldn't make it. Now you make it so easy, they don't want to make it.  Very nice work to the head. The right hand landed. The Lion's got the mentality right now of fine. Bombs away. He went down earlier, and now he sees this as his only way of getting back in this fight. Yeah, he's behaving like a guy out in the street. And that's okay for a guy out in the street. You get desperate, you act a little amateurish, you just start throwing bombs, hoping to get rid of the guy. But it's not okay if you're a professional fighter. He's gonna pay a price for this. The Brown Bomber's right hand  did a nice job that time. That worked well for him. Beautiful. Round comes to an end. Joe and Teddy with you here ringside. Teddy, you know, you really got to admire how accurate he is. I mean, he makes the most of what he throws. Yeah, he makes it count. This is a guy who doesn't want to wait. And yet another big shot comes in. He was able to get up and continue on last time. Now he goes down again.  One, two, three, four, five, six, seven, eight, nine, ten. The ref is stopping this fight. The Brown Bombers in prime form. Power surge here. Knockout winner. Ladies and gentlemen, by way of knockouts, your winner, the Brown Bomber, Wilder.  Teddy, there's a lot of explaining to do here, but help me with this. Was this early knockout on a left field a product of one guy being prepared and the other guy just not ready?"
}