{
  "video_id": "lUvcxr1HY1U",
  "transcription": " Today we're actually down here at the water bomb park. We're actually here to share one of those first times with Sammy. He's going on his very first water slide. Come here Sam. He's going on his very first water slide because he's passed the 100 centimeter mark. So we're going on the first water slide or your first water slide outside of the kiddie pool. You looking forward to it? Yeah. Yeah, let's go.  I do. You can't go on that one. That one's too big. You're going to go on this one. There. No. That's where Sam. What are we going on, Brianna? The Python. The Python. First time, Sam? Yeah. It's a little tall. Yeah. Looking forward to this? Yeah. Yeah. It's going to be awesome. The stairs are a bit of a climb, but that's OK. Look at the line.  The python looks like it's a family robot that goes into the dark. Sam, you ready to go down a slide in the dark? Yep. Yep, we're going to protect your sister. That looks pretty cool. You ready Sam? Yep. I'm ready. That's your foot there, that's it. That's it? That's it.  and then Brianna hold on. There you go. You ready? Let's go Sam you ready? Give me five, give me five. Yes here we go. Oh my god going backwards sucks. Oh my god turn around turn around turn around. Oh we're spinning. We're spinning. Where's oh no I'm still backwards.  Oh no! Oh no! The big drop! The big drop! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo! Woo!  That was awesome! That was awesome! That was awesome! That was awesome! That was awesome! That was awesome! That was awesome! That was awesome! That was awesome! That was awesome! That was awesome! That was awesome! That was awesome! That was awesome! That was awesome! That was awesome! That was awesome! That was awesome! That was awesome! That was awesome! That was awesome! That was awesome! That was awesome! That was awesome! That was awesome! That was awesome! That was awesome! That was awesome! That was awesome! That was awesome! That was awesome! That was awesome! That was awesome! That was awesome! That was awesome! That was awesome! That was awesome! That was awesome! That was awesome! That was awesome! That was awesome! That was awesome! That was awesome! That was awesome! That was awesome! That was awesome! That was awesome! That was awesome! That was awesome! That was awesome! That was awesome! That was awesome! That was awesome! That was awesome! That was awesome! That was awesome! That was awesome! That was awesome! That was awesome! That was awesome! That was awesome! That was awesome! That was awesome! That was awesome! That was awesome! That was awesome! That was awesome! That was awesome! That was awesome! That was awesome! That was awesome! That was awesome! That was awesome! That was awesome! That was awesome! That was awesome! That was awesome! That was awesome! That was awesome! That was awesome! That was awesome! That was awesome! That was awesome! That was awesome! That was awesome! That was awesome! That was awesome! That was awesome! That was awesome! That was awesome! That was awesome! That was awesome! That was awesome! That was awesome! That was awesome! That was awesome! That was awesome! That was awesome! That was awesome! That was awesome! That was awesome! That was awesome! That was awesome! That was awesome! That was awesome! That was awesome! That was awesome! That was awesome! That was awesome! That was awesome! That was awesome!  so  You're gonna do a backflip? This is going to be an adventure.  Wow, look at how high you are!  Sammy say bye-bye As always, if you've got any question marks about the water bomb park of course or any of the rides we've gone on today Please leave them in the comment section. If you haven't subscribed already, what should they do Brianna? Click the subscribe button. Yeah, see she's good isn't she? And as always we will see you in the next adventure. We can't go on it again  you"
}