{
  "video_id": "m0zWJ7A4bNk",
  "transcription": " I've got four circles drawn on my piece of plywood and I'm just going to cut those out with my skill saw.  four wooden blanks, one, two, three, four. And the next thing to do is to cut the little circle hole in the middle, two inches, for the barbell. You could cut out these blanks other ways. You could cut four squares and cut all four circles at the same time. You could use a band saw to cut them. You can even cut circles on the table saw. You could, if you wanted to, put a nail in the middle and attach a string to your saw and use it as a compass to cut your circle.  But this seemed to work just fine. I've got four blanks and the next thing I'm going to do is put my circles in the middle. So as before I will use my 45 pound weight as my template and I'm just kind of squaring it up on my top wooden blank and for this I'll use a mechanical pencil just to get a really good line because you want this to be exactly two inches so it's nice and tight on the barbell.  Alright, so I've got all four blanks here and they each have a two inch hole. And now I'm going to break them into two separate weights by putting some spacers in between them. So I just cut these six spacer blocks and I'm going to mount them in between my discs.  discs. So that's what my blank looks like. You can see it's got a little more stability than the standard single piece of plywood. And probably a little bit more weight. It's probably closer to 4 or 5 pounds than just one or two.  Anyway, I just have to make the second one of these and then sand them down.  So as you can see I've got my wood blanks set up and it just makes it really easier to reach that bar if you're going with lightweight instead of having to reach too far.  Just a close up of the blanks. You can see they have the spacers in the middle there. They set up really nicely and have lots of stability as opposed to just a straight up blank. So that's my video about making these wood blanks for my squat rack. If you liked the video, just click the thumbs up button right down there or subscribe to the channel.  few other videos about exercise equipment and workout stuff and let me know what you think."
}