{
  "video_id": "M8afiRNnB9s",
  "transcription": " What are we cooking today, Joyce? I'm making a shrimp salad. Look at all this stuff. Wow. I'm going to show you how to make a flower out of a tomato. The knife should be really sharp. I usually use a paring knife. I got two just in case I screw up. Because when you demonstrate, that's what happens. You're almost like peeling it. It's like an apple. Yeah. I will keep it in one piece. The whole thing in one piece? Yeah. That's tough.  You just need to do it slowly. I need a sharp knife. Oh, it's not one piece. But I can fix it. With Scotch tape? No! Scotch... Elmo glue. Right? You can just roll it up.  Right? And then this one, I broke it. And you can roll it the same sort of way. Stuff it in the middle. Oh wow. That's a very nice choice. Looks like a rose, eh? Good that I broke it. That's why I showed that you can fix it. Yeah. I think I should have some video of doing like this kind of stuff. Yeah. Yeah. But then, COVID have no food. Like Chinese people usually peel all the skin. People here like to have the skin. That's why I have half and half. I put it in water.  just cover it and I cook it with the egg but put the egg in cold water if you could put an egg in hot water it will crack some of the skin will fall off okay you know then you cut this piece it's a lot of coral can of food cocktail because you don't want the water okay that's why I let it sit and drain it okay the shrimp I deveined it it just need to be cool that's why I didn't save anything  to show the deveining. But if you see my video, you have seen many times. Some people split it. I like the whole shrimp because I usually save the tail. Pretty. And just split it like this. Some people like to put the cucumber inside the salad. But I will make decoration. This is English cucumber, seedless. Are they in season all the time? I think this is hothouse. You can always buy them.  If you cut it, it will be pretty candy-style kind of thing. By the way, it's mayonnaise involved. Okay, I think that should be enough. Cut some tomato slice. The tomato is not in season. You can hear it, that it's not quite... Sour cream and mayonnaise. Half and half. What do you mean the whole thing? The whole bottle. Yeah, but you don't want a whole bottle. You see how much stuff you have. This is full fat sour cream.  We don't do like... Cumin, that's not enough. That would go good with anything, Joyce. Then you add the potato in it. Dressing or whatever you call it. It should be enough. We can always add to it. You can use your eyes to adjust. Add the fork for the cocktail and we can save something for the drink. In Asia, a lot of those drinks with the shade ice,  Oh yeah, okay.  Because it's fresh from the green mung. See the dressing is just right amount. See right amount for the plate too. Are you going to cover the whole top? No. If nothing, it would look good. That's my point.  Wow, it's so colorful, Joyce. It's like too pretty to eat. Really? Never stopped you before? That's true. Is this your own salad? In Hong Kong, that's what shrimp salad. This is a typical way to make the shrimp salad. This is called giving the lily.  right? Yeah. Colvin loves that. Just destroyed this great pretty shape. I know. Good thing it's a picture. Yeah. Picture time. Should it be three-strong?  Thank you."
}