{
  "video_id": "MG42KaLuIcg",
  "transcription": " So it's about 540 in the morning and We just got our Lyft driver who's here seems like a really nice guy. We're gonna be going from our home to Dallas Luffield Airport and we'll be on a plane from Dallas to San Francisco All right, so we are here at the airport yes About to get on our plane  Doesn't look too busy, but we'll see. Perla? Awesome. So what's it like working for Virgin? Yes, I am. I'm a professional basketball player. And you make basketball? Alright. I haven't been messed up. It's alright, man. It's all edited later. You guys okay? Yeah, yeah. It'll be on YouTube at some point. It's okay. I'll end up on YouTube one day. Oh, there you go.  Alright, so we're on the flight here. See they're finally loading up, filling up some last-minute fuel. It's actually pretty cool. Virgin has this little TV screen I guess. It's pretty awesome. They've got pretty nice lighting inside. Light space, you know, could be better, but whatever. But yeah, I think we're gonna taxi off soon.  Probably the most entertaining safety video I've ever seen.  you  you  So this is San Francisco International Airport Terminal G I believe for internationals We're on our way to find Air China check-in to uh I guess um get our tickets reissued It's gorgeous the banners really old photos They're great job here  The architecture is really nice too. Pretty well done on the inside. Wow. I'm impressed. Hopefully we can find Air China somewhere here. Air India. Not going there. Swiss. Hopefully it's down there. We're here at our gate here in SFO getting ready to get on our flight to Beijing, China. You can see the aircrafts right back there. It's a Boeing 747, I believe.  Looks like a newer version. And we have a Lufthansa A380 right here as well. And so I think the boarding will start soon. It's about 12 hours from San Francisco to Beijing. So it's quite a bit of a fight. The experience was terrible. The service was slow. You get your own personal entertainment. You get a bottle of water courtesy of Air China. It's something called 5100. You also get your own pair of slippers.  and you get free shoes  keep you updated on what goes on.  So we are inside Beijing Airport. It's really nice actually. Surprisingly well. Wow. Super nice. There's no lights. We're kind of trying to figure out how you get to customs. We just got through customs. Chinese version. It's actually pretty simple. Very easy. Took us probably like two or three minutes. Pretty simple process.  We're getting on this train and that should take us to our baggage claim, but a little more of Beijing Airport for you. It's really nice So we are finally here in Beijing inside our hotel room at the Marriott I don't know how well you can see but it's a view of a little bit of downtown Beijing for you I think it's much better on this side  We did a little we went out to eat and to a local Indian restaurant So I have a little bit footage of that right which was pretty interesting, but I think that's it for tonight and then tomorrow We'll be going to Tiananmen Square and some other places, so I'll upload some more of what happens there  Little bit of a Beijing downtown If you are from India it is very much like India  See some more of Beijing over there."
}