{
  "video_id": "mm0N18H_-WU",
  "transcription": " Lolly is beautiful just stunning. Come on Carol G. Is that who you are? I don't know who you are. Yes Becky! I just spit. Hi guys, my name is Ashley Dupree. Welcome back to my channel and today we're doing another react video. Today we are reacting to I believe Mao, Ricky, Carol G, Lolly girl, Lolly yes Becky G. Okay this song I'm looking over here  Because girl, what is that called? Mimala, the remix, girl. Mimala the remix. We're back to the normal camera, you know. So, we'll see if this is in focus. Girl, let go. Watching over here. Watching over here.  Alright, let's go. Let's give it. Give it a whirl. Give it a twirl. Do all the things. Already, girl, the beat has got me. Okay. Oh, they are so cute. Oh, girl, you better have a high ponytail.  Oh, this is it. Oh, this is it. That's that's the tea  Oh my gosh, this video is everything. This is everything. Yeah.  Ooh, and I love how there's this like little element of like, hey girl, let me just make a little video. Ooh, I think I hear Becky G. I think I hear Becky G.  Oh, this is girl. This is it. This is like my new favorite song my new favorite video Come on Becky G. Oh Fisher Oh these some bad girls up in here, okay, you can't see the hips  You can't see them And the lighting in this video too, I love this girl this is the best video right now  where that camera is going loli is beautiful just stunning come on, come on, Carol G is that who you are? I don't know who you are I don't know who you are yes, Becky I just spit okay, okay, calm down I'm gonna calm down, okay yes, loli Becky G girl, now that's, that's the shot okay, oh girl, the  That video, that video was everything. Okay, the looks were great. Okay, the lighting was great. Okay, because I love that little dark feel. Okay, we had that with Abraham Mateo. He had that little dark feel to his video too. I liked that very similar lighting. I liked that. Loved the camera elements. Okay, let me just make a little video for my boo. Whatever. Okay. I also liked, get your thoughts together. I liked that each of the girls who were featured had a moment and they were like, let me just say my name for a moment so you don't forget who I am. I'm sorry.  This is everything. My favorite thing right now. I just want you to know. My favorite thing right now. Okay, just that's real. Girl. Girl. That's it for this one you guys. I hope you enjoyed it. If you did, please like, comment, share, and subscribe. Subscribe being the most important. And of course, if you do subscribe, please turn on notifications. That way you can be notified of when I make my next video. Girl, you know you want to do it. Everybody's doing it. Well, some people. My name is Ashley Dupree. You can follow me on all of my social media.  That is A.M.D. Smiles with a Z, beauty, on Instagram, Twitter, and Snapchat. And until next time, stay tuned. Girl, that was everything."
}