{
  "video_id": "MmsIOgJuuWQ",
  "transcription": " There's a different look to the St. Louis skyline with the recent completion of the Stan Musial Veterans Memorial Bridge. The state-of-the-art span creates a new gateway between Illinois and Missouri, reroutes a major interstate, and will have a huge impact on our region. Illuminating the mighty Mississippi is a new engineering marvel, one that has changed the St. Louis skyline forever.  Bridges tend to symbolize the community they're in. It's often been said it looks like a piece of artwork, and the beauty part of that to engineers and contractors is we know how complex the structure is. There's a lot of things that go into the design, the construction, and just really complex, but when you look at it, it looks very simple. The cable stay really is a unique structure. It is aesthetically pleasing, and there are things that are done to the structure, ratios of shapes and spaces and things like that, that may not be readily evident, but really add to the  to the character of the bridge. The Stan Musial Veterans Memorial Bridge cost $229.5 million. The overall project to build the bridge and to connect it to the Illinois and Missouri interstate system cost about $700 million. The new Mississippi River Bridge project was commissioned to address traffic safety concerns and the growing congestion on the Poplar Street Bridge. We've got three interstates crossing the Poplar Street Bridge. By pulling that traffic out there, it makes it safer for motorists.  Everything's going to work as one big regional traffic pattern. It's going to pull about 20% of the traffic off the Poplar Street Bridge and all the through interstate truck traffic will be moved off Poplar. And this will also help us to make some badly needed improvements to the Poplar Street Bridge. Being situated on the New Madrid Fault, safety technology was built into the design. Cable-stayed bridges work a little bit better with the seismic design because you don't have the rigid connections like a truss bridge and things like that.  So it's able to incorporate a lot of unique things into the design to help it withstand earthquakes. Anywhere in the St. Louis area during a heavy earthquake, you probably want to be on the bridge. It would be one of the safest places to be. From end to end, the Stan Musial Veterans Memorial Bridge is approximately 2,800 feet long. There are 136 conduits on the bridge. Each conduit contains between 31 to 73 strands of cable to hold up the bridge. The main span, the portion between the two towers, is 1,500 feet.  making it the longest in the United States. For a span length this long, the Cable State Bridge really tends to be the most economical because you don't have to work in the river a lot. We've got two large piers in the river, but those are the only locations where we're impacting the river itself, barge traffic or anything like that. A build project of this magnitude over the Mississippi River did present challenges. You get a very swift current and a lot of people know the smaller rivers are the most difficult to get to.  and don't really think of the Mississippi River just by the sheer size of it that it does it that much. But we've actually had a variation in water height of 44 feet in just a three-month period. And the towers, working with heights 400 feet above the water, is something that brings its own unique challenges with just the crane capacity and the safety aspects of that. Each tower contains more than 2,200 tons of reinforcing steel and a total of 1,000 tons of steel.  approximately 8,000 cubic yards of concrete, enough to fill 1,000 concrete trucks. Installing the final section of steel required timely precision. The last piece that joins the two together, we took a lot of calculations on what the temperature would be and what would be at that plan. And so we actually fabricate that last piece with our best estimate, with our engineering expertise. Fortunately, we hit our mark and  It fit up perfectly that last day. It's a new front door to the region. It'll bring people right into the heart of St. Louis, you know, for your Rams games, your Blues games, Cardinals games, anything going on downtown. A great economic development impact for us. From this bridge, you can see 250 years of transportation and commerce. The Stand Museum Veterans Memorial Bridge is a distinctive and graceful addition to this iconic skyline.  At the foot of this bridge is the convergence of five class one railroads, three interstate highways, next to the busiest economic artery in the Midwest, the Mississippi River, and not far from three great airports. This is not just a bridge to Missouri and a bridge to Illinois. This is a bridge to jobs. This is a bridge to opportunity. It is important that in America we always honor those who work hard, who do hard things, who make things like this, this bridge.  of a reality and help relieve congestion, relieve pollution, and encourage economic development, help all those vehicles that go across this bridge are going to help strengthen our economy. In America, we find a way. And you have found a way here at this wonderful intersection of major highways that intersect and connect major freight networks and major communities in America.  Three, two, one.  A lot of people go through their whole career and never get to be involved in a project like this and to be able to be a part of it is just a great feeling and a sense of pride. It's going to be something they'll stick with for the rest of your life."
}