{
  "video_id": "mmuViuXyhfo",
  "transcription": " Hi, Jeff Cote with Pacific Yacht Systems. What we're talking about is our favorite line of inverters here, the Freedom SW. And it comes in really two flavors for us, the 2000 watt model and the 3000 watt model. Here we're looking at a 3000 watt model.  This is sort of the inverter that we use on boats where they absolutely need an inverter. Like all the refrigeration is inverter. They're running their inverters 24-7. The moment they leave the dock, that boat absolutely needs an inverter. Oddly enough, some boats even have AC lighting on board. So the inverter is a critical part of the boat. And so when we're dealing with a boat that actually uses the inverter a lot and there's room to mount this, because on a lot of past, there were older inverters that were about this size that were really good quality, low frequency inverters, we're going to install an inverter.  all this Freedom SW line. This is of course a true sine wave inverter. All the inverters we do are only true sine wave. I never bother with doing a modified sine wave. It just doesn't make sense. It's not worth the money in our opinion. Really good, good quality. It's got everything you pretty much need and it also works with this SCP controller. So this is the ability to control this unit remotely. You'll notice that this Freedom SW doesn't have any  interface. So really to turn this unit on, know the status, what's going on with it, disable the charger, enable the inverter, see what are the amps coming in and out of the inverter, what's the voltage at the device, enabling load sharing, changing the power inside the inverter and saying I only want to use 15 amps or 30 amps. All of this is going to be controlled by this remote panel and this is absolutely, even though it doesn't come with it, this is what we sell with every single one of these SW series.  Yeah, it's great. It comes with a temperature sensor. It's got circuit breakers on the side. This is important for troubleshooting. You're going to want to have that. Yeah, and the AC come in. You do your connections over here. You've got connections for the temperature sensors. There's covers. Here's the chassis ground over there. This is what I would call a serious inverter, you know, for those boats that really need one. So if you've got more questions or wonder which inverters is right for you, contact us at Pacific Yacht Systems. Thanks for watching.  you"
}