{
  "video_id": "N2ampIDnTAQ",
  "transcription": " My name is Red Pepper, and I'm a extraordinary voiceover man. I've been following the Villa since 1976. That's a lot of time. Simply because I like the colors. No word of a lie. I liked the colors. Simple as that. Villa all the way. It's in my blood, the last molecule. Don't play with me. I'm Villa till I die.  Hi, my name is Red Pepper. I'm an international voiceover artist. I have got to be one of the most famous people in the world who isn't known just for my voice, which is kind of cool, really, because you make sack loads of money, but no one knows you until maybe you're on a train or something and you happen to answer your phone, hello, and everybody looks up. I saw on a blackboard guards wanted back in the day  when they had guards at the back of the train. I said, yeah, I'll go for it. I got it. Six weeks later, I went up to become a driver and I became a train driver on the London Underground. And yeah, that was good. Done that for 13 years. I can't really grumble about that because being stupid on that job, I used to turn off the lights on Halloween. Imagine, stop the train in the tunnel, turn the lights off and say, this is your driver speaking or is it?  I used to do crazy stuff like that. And somebody actually heard me using the public address system on the train and turned out to be a television executive. And he got me my first voiceover job. I've done so many along the way. Armageddon, Amistad, Bee, Blair Witch Project. You could go on and on. A lot of the stuff I do nowadays is in animation. You know, you have your Xbox and you have some characters talking. Usually it's me saying,  Come on guys, get up the hill!  Oh, that's a great voice.  through the glass window is like they wrote down a big piece of paper Spielberg and I realized with Spielberg in my headphones he could hear what I'm doing but no one told me that's the freakiest thing that ever happened in a studio just having Steven Spielberg in my ear I'm very grounded I'm not one of these guys who give it large outside because I got a really cool job I'm very grounded as you can see I'll come when I'm coming to the match I'll come in my gear I don't come in a suit and  I'm not into that. I got into Villa, like I said earlier, because I like the strip. I just like the Cutters. And my very first game was some kind of semifinal, I do believe, against Man United at Old Trafford many, many years ago. It was a night game and it was cold and my father was not impressed because he just did not want me to go. And I kept begging him and he did some really good schoolwork and stuff. And he said, OK, let's go. And we went and I enjoyed it. And from then on, I watched Villa through thick and thin.  I remember going to a Newcastle game at St. James' Park and watching those two clowns from the same team fight each other. And Villa was just playing them off the park. Watching Tony Daly go down the wing was just a beautiful sight. Watching Juan Pablo Angel score any goal was a beautiful sight. Vassell was a beautiful sight. Watching Martin O'Neal jump up and down animated was a beautiful sight. There's so many good things about Villa. Watching the whole 10 roar.  Full house at Villa anytime against any game. That's just a beautiful thing. People don't understand it until they experience it. Television? No. You don't get that atmosphere until you're in it. And there's something special about Villa Park and people don't understand it unless you're a villain. Watching the currant crop, snot grass, he's got the heart of a lion. Watching our young Jack, Jack Greeler, he's just something special. I hope he never leaves this place. I'll go with the highs and lows. I'm one of those fans. I don't get too irate.  I take my slaps and I bounce back up and we will come back up because we are a Premiership team. You know, it's never ending. I can't put my finger on one particular player or one particular manager and say, you know, they were the best ever. It's just from the fans point of view, I just love the villa. So I support every single one of them through thick and thin.  I'm Red Pepper and I am part of the pride.  you"
}