{
  "video_id": "n31ZUJiHty8",
  "transcription": " G'day, I'm John Willis from Club Marine TV. It's a beautiful day in summer at Martha Cove on Port Phillip Bay. And I'm down here with the Northbank 750 HT, the hardtop version. She's a ripper, but this one's got a secret. It's got the new Mercury diesel. That's a 3.0-litre V6, 270 horsepower,  diving through a Bravo 3X Seacore Lake. It's a great unit, let's go have some fun. The hard top is just amazing. Just a great secure structure for the rough weather and for the bright sunshine that we've got out here today. It's really quite warm out here. But what a layout, plenty of deck room, huge big fishing area there, nice deep  So it's nice and safe in a big sea, you're not going to go falling out. Side door in this one as well. And look at the layout of the cabin and the cockpit and helm. It's just a fisherman's dream. It's terrific. It's a good, solid pedestal type seat. You can put seat boxes in there if you prefer. The dashboard layout is really quite simple, but plenty of room for big electronics. You've got your compasses, you've got wipers on the windshield as well, which is just vital for a hardtop. Plenty of ventilation through the side.  side windows, plenty of headroom for a tool bugger and footrests, you name it, it's all here. For the passenger, you've got similar comfort. All round, the 750 HT, I've taken it through some rubbish in my life and it's come out smiling every time. Northbank have made a great boat, even better. They've taken away from the outboard well and fitted the ripper new Mercury 3 litre diesel, 270 horsepower and it's taken away from all that we've had, the bad  side of diesel in the past. It's not noisy, it's extremely fuel efficient, it's easy to service and it's got a heap of grunt too. So plenty of manoeuvrability and plenty of bite. I've got to tell you, this redefines everything you've ever thought about diesels before. It brings the weight down low, up the back where it should be, got enormous bite and enormous torque and just rips this thing out of the water without all the traditional induction noise of the diesel. Rips it out of the water efficiently, cleanly,  efficiently and gets us up to a beautiful top speed of 36 knots. I gotta tell you, I'm convinced. What a way to go. Well here we are back at the ramp. We've had an absolute rip of time in a great boat. Well done Mr. Northbank and well done Mr. Mercury. This has been John Willis for Club Marine TV. And now I've got to give it back.  you"
}