{
  "video_id": "n89wgjevEsE",
  "transcription": " I'll see you in the next video.  partner in just a matter of months.  your channel fast, which is pretty funny because I didn't know what I was doing or how to even do this. But I post that video. It's a horrible video, but you can check it out if you want. It basically just verifies that I was just starting the channel out. And I even say that in the video, I'm starting to grow this channel. You can also verify that some of these videos were actually show that my subscriber count was at zero. And so I was all over the place when I started doing power washing videos. And I don't even know what some of these videos were about. Just learning how to do this. But I feel it's important to show you this because  You know there's a lot of stupid out there in the world and there's there's quite a few people that are really good at it So they'll you know share that I just started not too long ago, and then some people they think they're they're Sherlock Holmes, and they'll see that this channel has been around for a while. Yeah, yeah, it's been around for a while, but You can have a channel without being a youtuber without trying to grow it you know yeah You sort of have to have a channel to make comments and to save to favorites and to like videos and stuff so Lots of people have channels doesn't mean they're all you know working to be  You can verify that right here that this is just been going on about a year since I started trying to grow it and so now let's check this out. Let's go to Here we are at subscriber counter calm and as you can see over 15,000 subscribers now I remember when I first started out I would get excited just to get an average of one or two subscribers a day coming in If we scroll down here now, you can see over a hundred subscribers a day on average. I'm bringing into the channel  I also remember when I became a partner after a few months my first Month worth of Adsense revenue amounted to $30 and if we look up here now You can see it's over a thousand top-end estimated and I'm very close to this number I would log into my YouTube account and show you that but YouTube does not like that So I don't want to get this video taken down or get a strike against my channel But I show you it's it's up here close to the top end. So I remember when I was at $30  I  you  I even have a section dedicated just becoming YouTube partner So these are all the methods that I know of in terms of getting you know The thousand subscribers and the four thousand watch hours the fastest methods I know of and the most effective methods I know of to get to that partnership level and so anyways It's very exciting to think how much farther this channel will be and Adsense income in another year I mean like I said, I went from $30 a month hoping that I'd be at $100 a month in this first year and I'm already almost  at $1,000 a month. So now I'm hoping just to get from 1,000 to 2,000 a month within the next year. And so it's very exciting to think how much farther I could actually get then. And so I share all these tips for growing on YouTube right here on this channel. So if you're interested in growing yourself on YouTube, be sure to subscribe and join me in this journey as I continue to grow, learn, and share all this with you. And with that, I'm going to wrap this up, and I will see you in the next video.  you"
}