{
  "video_id": "n9L_TaFKL6w",
  "transcription": " What's up everybody? We are finally back from an amazing weekend up at the 27th annual shootout over in Norwalk, Ohio. And just getting back to normal life again here in the shop. So as I promised before, we're going to start building this YouTube channel. And that means looping you guys in a lot more on what's going on in the shop. Today we've got the Black Zenith back over here.  you know we did the removable tube front end setup on it not long ago just back in the fall and we've got Mike's silver bullet Evo here we're gonna go ahead and proceed to move forward with building that on his car and we're gonna build a jig around it more to come on that soon so I know you guys have been asking for it a lot and we're gonna go ahead and bring this product to market we're also gonna have some other options  for you guys because the one that I made here for the black Zenith is for the stock location style turbos that are still fitted behind the radiator setup and we know that a lot of you guys like to have larger turbo setups that can be placed in various locations and the way that this is set up will be one option but we're also going to make some options that are a little bit more versatile for you guys that want to mount your turbos in different various locations regardless of where it may be.  So we'll go ahead and get started on working on Mike's car and keep you guys in the loop.  All right, so next morning here I've got Mike's car pretty much all ready to go before making the cuts as you can see you've got it all stripped down Got the radiator out removed and we're gonna deliver  the power steering cooler. We've got the oil cooler hanging down out of the way. You can see where I've marked everything. We're just about an inch out from this corner joint here on both sides. And we've used a straight edge in order to get that line as straight as we can. Likewise, we've marked where we're gonna make our cuts on the vertical areas. And not much left to say.  Chopping chop is such a derogatory word. We're gonna make the cut  so  All right, so  We've got Mike's tube front end all in progress here. We've made the cut and now you can see we've got everything off the front of the car that we wanted to remove. Made some nice clean cuts here on each side and the next thing to do is start making these plates that are going to fit right here which will have some nuts welded on the back and that'll accept the new tubular front end that we're looking to make.  make.  button and join us for this ride of building race cars and cool projects. You never know what we're going to be working on next."
}