{
  "video_id": "NE0VpQQUmAU",
  "transcription": " I Know I just met you Jemaine Mandayne drops out here with the one the only miss Kim Orlando and we're heading  To Canada I'm just hoping we get it. I think you're gonna get it. I don't know if I'm getting it  Can you say eh? Eh? Is this your first time in Canada as well? No. No, so you've been to Canada before. Yeah, and I've had poutine, but I haven't seen you eat poutine. That's what I'm excited about. Well, that's what we're doing today. The lady at the border patrol recommended Frenchies, Frenchies poutinery. So wherever that may be. Well, it's not lefties. Definitely not lefties. It has to be that little classy looking spot up ahead. Is it closed? No, it's open. Open, so 11 o'clock.  It's Friday 11 48 48 12 minutes boom. We're here my first stop in Canada again shout out to my Canadian fan Let me know in the comment section below if this is a good look did I go to the right spot?  2010.  I want the record to show that we let you in 20 minutes early.  Nice to meet you.  Yes, yes.  And this is where you're gonna need to be because your man drops dropped in on him. All right Let me let me get right into it Cheese curd. Oh my goodness. See that cheesy action Gravy homemade gravy. They make it in-house gravy  I wasn't expecting that Chris that Chris was that I know you die you gotta get in the video, you know, you know  that crisp from the fries actually happen right here. Y'all can go by if you want some. No, no, we're just signing. Okay, okay. Okay, well you can watch the video and then decide. Yeah, indeed, indeed. So, from my hands, not from Canada, when you're thinking of the cheese curd action, y'all think of like a mean mozzarella game, right? Fresh, that stringy pull is everything. But when that gravy kick in, that seasoning right there, oh, that's when it changes up a little bit. That's when you start to respect the poutine game. So the flavor is 100%  Oh yes!  I'm  I don't know how many spots we're gonna hit in Canada today, but we're out here in Windsor. Everybody have a good time. Cam, I hope you brought your appetite. Frenchies. Bye."
}