{
  "video_id": "njOg6o4xDJQ",
  "transcription": " Hey, this is AJ Powers with the American Dream. Today I'm with Tim Wrongley here at Flagship Cruises and Events. Tim, thanks for having us. Hey, well thank you for being here. This is awesome. Glad you guys could make it down. Yeah, glad to be here. So you guys are here based out of San Diego. We're right by the Midway here. You've got, tell me how many ships again. We have 11 in our fleet. 11. So I know you've got a wide range of what you guys do. You want to give us a little bit of a tour?  background on that? Yeah sure so flagship cruise and events locally owned and operated since 1915 so we're a high-end luxury yacht company that has built the brand obviously where we're at along the Embarcadero it's a perfect you know convenient location everything from small little water taxis to our ferries that go to and from Coronado all the way up to California Spirit which holds 650 passengers so nightly dinner cruises, harbor tours, whale watching  Obviously today we're going on the Patriot jet boat. A little more fun today. Yeah, Sunday and Saturday and Sunday champagne brunch Weddings, private events, you name it. Anything on the water. So we just passed Memorial Day. So now we're starting up your guys' busy season, right? Yeah. So what are the changes after Memorial that are coming into effect now? Yeah, so we're all full bore right now. We're doing daily harbor tours, of course, and we started kicking off the Patriot jet boat every day. So normally it's only on the weekends, but summer is  here. Kids are getting out of school. So we're running that seven trips a day, seven days a week. And then we're also doing like a Saturday and a Sunday brunch instead of just Sunday. And then we've got spirits at sunset, which is a two hour cocktail cruise that also goes Friday and Saturday nights through the whole summer. Awesome. So we're going to get on the Patriot. It holds one hundred and thirty two. Is that right? Close. One hundred twenty nine. One hundred twenty nine. Twenty nine passengers. Thirty two dollars apiece. Thirty two dollars apiece. Thirty minute. Thirty minute throw ride goes 50 miles an hour. It's got  two 1400 horsepower jet propelled engines. We call it the roller coaster on the water. Spins on a dime, does 360 spins. You get wet, you got loud music, you know, going through your hair. Yeah, yeah. So it's a blast and people love it of course. You want to take us down though, let's go jump on? Let's do it. All right.  Tim, looks like a ton of fun out there. Ivan, your first time on this ride, what did you think? Oh, incredible. It's definitely something you have to experience when visiting or if you live in the area. Tim, thanks so much for allowing myself and our  agents to get on board the Patriot. We had a blast. Yeah, I mean, it was still a great time, even though I work here. Every time I go on it, it's amazing every time. It's such a big thrill. And they took it easy on us. We didn't get too wet, a little bit, because it's not fully summer. Some of us did get wet. So like we said earlier, we're running it seven days a week now. Now we're kicking off to summer every hour on the 30. So 1130 to 430 every hour. Awesome. So come down here to the port right next to the  Midway or search flagship. Yeah, just look for flagship cruises online. You'll be able to spot us right away. Awesome. Thanks so much for having us out. Thank you very much guys. Thank you."
}