{
  "video_id": "noOM42oLy_s",
  "transcription": " Yo guys, Lazy Jamie here and today I'm gonna be watching the best of Pink Guy who is one of many of Filthy Frank's characters. Now I actually haven't watched any videos with Pink Guy in it so I don't know what to expect. I'm gonna guess it's a bit crazy because most of his are. I've seen him in the videos with like the hair cake, vomit cake, those things. So we're gonna be checking this out today and it's gonna be a first time reaction as usual but before we get into it, if you enjoy make sure you subscribe, join the Lazy Crew today. Let's go.  What is he doing man? Don't tell me he's in that thing. That would freak me out. Can I have a moosey please? That's where that meme comes from. What the flick? How many videos have you taken before?  He's face you got strong eyebrows  Oh wow! I love fried eggs! Yeah, he speaks Japanese. Oh no! He looks like a dog! Look at that poster! I know some of the memes but I haven't watched any of the individual videos.  Hey boss, hey boss, hey boss. Hello. Can I have a boosie please? Not impressed. Turn around mrs. He's vlogging it. He's vlogging it. They're laughing, he could be dying.  Jesus Christ... What's going on? Yo! That's Japanese! Bruh! Who's that? He's right-tancing, what the flip?  I think I've seen a gif of him break down his voice. Oh prank! It's just a prank bro, it's a prank! What's for breakfast dad? Dad what's for breakfast? Is that nude? NOOOOOO!  He's got a suit on, he's got like normal shoes as well. Trainers. Social experiment gone wrong. Gone sexual. I don't know how I reacted to that to be honest. He's in an elevator with a guy in a pink suit. I love that! It's like a little mission. Oh shit!  He's like karate kid, let's go! He's not messing with him Look at his face, he looks so pleased He's smiling He's not sure whether to be scared or laugh  You've been telling me being serious  It's time to stop  Come on, the counter jokes man.  I need to watch more Filthy Frank. The amount of times I get shared videos by Filthy Frank. I have people I know that just love a bit of Filthy Frank. I don't need to check them out myself. I have checked them out. I do know. I get some of the references. I don't know what I'm talking about. I get some of the references, right? But I don't watch him regularly. I don't watch whenever he uploads. I'm like, oh, I better check that out. I'm not a subscriber to him. But you know what? He just earned himself a new subscrizzler, mate. He earned himself a new subscrizzler. But yeah, that brings an end to this very filthy video.  damn filthy. Thank you very much for watching. If you enjoyed, leave a thumbs up. Comment, let me know what you want me to watch next. I can watch other filthy frank videos, anything you want me to watch, you know, anything at all, I will check it out. And subscribe, join the lazy crew today. Cheers."
}