{
  "video_id": "NOqb0dFIxds",
  "transcription": " Hey guys, so today's video is going to be a bombshell a blowout inspired hair tutorial because personally I have way too thick of hair to be able to blow out my hair and make it look nice and Like use a round brush brush. I just don't have time for that And so I wanted to show you how I achieve a similar look using a curling wand  And this one is the Sapphire wand from Irresistible Me. And the cool thing about this wand is the fact that it's like detachable. So it comes with eight different handles, all different shapes and sizes. So you're gonna like have such diverse options when it comes to curling your hair and really be able to achieve any look you want. So this is the little pouch that all the attachments come in and it kind of like rolls up really nicely and conveniently. So if you want to take this traveling, you can. It is kind of bulky, but again, you're going to have so many different  So I just kind of wanted to introduce the tool that I'm going to be using and if you are interested in purchasing this or their straightener, which is amazing, I have a discount code for 10% off and that is irresistiblemichaela. So you guys can use that and get 10% off your order. But other than that, let's go ahead and get into the tutorial. So starting off, I have attached the largest barrel to the curling wand and I'm putting it at the highest heat setting, which is 450, I believe. I like to do this because it works best on my thick hair.  Next, you're going to want to separate your hair into two sections and clip the top half up to make it easier to work with just the bottom half. And you're also going to want to apply some heat tamer spray to protect the ends from heat. So go ahead and do that. And don't forget to brush it out and kind of wait for it to dry before you actually go ahead and use the tool. But taking about a one inch section, I'm going to be curling that away from my face. I tried doing like away and towards my face, and I just cannot handle the towards my face  this  curl or less for a more beachy wavy look depending on the style that you are going for. But basically just repeat that process all over my head and of course you want to do the other side again facing away from your face and yeah. Does anyone else do weird facial expressions and dance moves when they're curling their hair? It feels like such a long process but then you'll check the time and you're like oh it's only been 10 minutes and yeah I'm in. Could be the only one. Once the whole bottom layer is done go ahead and add some hairspray and then I'm taking  my  like  can  scrunching it at the same time to really make it very full and voluminous because I have such thick hair. My hair does not have volume on its own. And then I'm just taking my Tangle Teaser again and brushing out the curls kind of ferociously, kind of just like striking them a little bit and making them a little bit more loose. You can totally go back in and curl the ones that you want a little bit more defined, but yeah. And you can tease your hair. I, you know, it doesn't really work for me, but this is basically the completed look. And if you want to add more volume, like I said, you can totally just like tease  ease the top half and stuff but I think it turned out really good. So that is the end of the video I hope you guys enjoyed it don't forget to give it a thumbs up if you liked it and you can also follow me on Twitter and Instagram and Snapchat because I have all those things and it's super fun and yeah I will see you guys in my next video have a great day bye!  you"
}