{
  "video_id": "nUo9znRufNY",
  "transcription": " Man the car is filthy. Alright guys, currently I have a car up in the air and I'm gonna show you why. Just in a minute.  But today we're going to show you how to do it install on a new parent license plate relocator that is currently about to hit the market. I don't think it's out on the market yet, but it soon will be. Now, if you have a front mount intercooler or if you are in the market for a plate relocator, this is going to be an excellent choice for you. So as you can see, I have the bumper off the car. Of course, this is my beater bumper, so please don't mind the scratches on it. A car is right there and another bumper is right over there, but we're going to show you how to install this plate relocator.  So let's show you what comes in the kit. This plate bracket, a spacer, a bolt, a nut. You got four of these which I assume are for your license plate and a whole bunch of washer. Good thing they include one of these. You can never have enough of those. So one of the reasons why I do like this kit over all the other kits that are out on the market is that it simply bolts onto your bumper. So you're probably asking how does this bolt onto your bumper if this is just plastic? I'm gonna show you why in just a minute. So I'm gonna show you how the other popular one that almost everyone has how it bolts on. Give me just a second.  minute. Where the hell is my... Let me just back this up just a little bit. Alright, so, just grabbing my crash beam. And as you can see in the back, I have a front mount intercooler, which requires removal of the front crash beam. So, what does that mean? So, the pop-up one I saw on the market uses the front crash beam and uses this adapter to mount your front license plate bracket. Parent has come out with a nice, ingenious way on how to mount your license plate without using the front crash beam.  And this is pretty ingenious. Yeah, so No more of this. So and the good thing is every time we take off the bumper You don't have to take out your front license plate bracket, which is kind of pain sometimes Okay, so I showed you everything that comes in the kit So first thing it's gonna tell you to do is to take off your tow hook cover now It says to use a small towel, but I like to use some tape In order to not scratch your bumper and a good old flathead screwdriver and you take that into that little space  right there and you simply take that out so you don't scratch your front bumper. Take out the little tab and you can remove your tape. Hopefully in one piece. Alright so your kit is gonna have these two plates that come with the kit. Now this is gonna go on the inside and this is going to outside. Of course there are marks on there because I've already installed this. What you're gonna do it says to take... Let me just read this one more time. So I don't know if I get a close-up on this. Now it says the grain finish is what faces outside.  side of the car so it's kind of hard to tell which is the green finish and which is not the green finish so the easy way for me to tell is to take the one with the little part number or whatever that number is and this is gonna face the outside of the car so you're gonna take this plate and you're gonna put this on the inside so there's little tabs on the back I don't know if you can see right there but all I did was stick it into these little tabs right there and it stays there so that's it now let's go to the  or the outside part. So now for the outside plate or the front plate. Now it says to take the grain finish and this is the finish that faces outside of the car. So the way I did it, I put the one with the part number that goes inside. So the two part numbers kind of face each other. So this is also, so this also fits right in the hole, just perfectly, just like that. So there's kind of an oval shape. So there's no way to install this wrong. All right, so now you're gonna take your bracket  bolt and your washer and your spacer actually two washers so take your bolt your spacer after the space you're gonna take your bracket a washer and a spacer and what you're gonna do you're gonna stick this in the hole just like that without your back plate popping out and put that back in then you're gonna take your m10 bolt and then you're just gonna bolt this to the back of the back of the bumper  Really easy. Well, actually what you need to do is grab a spacer So grab a spacer put this on the bolt and then your book you're not I'm gonna show you on the backside. This is really easy So next thing you're gonna do you're gonna take this bracket hardware or your license plate hardware, which I think is a four millimeter and what you're gonna do is gonna put that on the bracket and that's pretty much it so you have your bolt and  your washer and License plate your handy-dandy license plate frame and stick that on there Alright, so that's a quick and easy install That's pretty much it for the parent license plate holder for cars with the front mount intercooler You can use this even if you don't have the front mount intercooler either way. It's up to you. They do have an option Where it uses the front crash beam so either way whichever one you want to use if you're planning on a front mount intercooler  So we're making a quick stop over here to a parent. Let's go see what they have All the parts here at parent. It's like a kid in a candy store Showroom in there when charge  Daily driving  Stock intakes for just testing right now. Normally our intake works.  right now and yeah we've got a new top-secret part but I can't release any details on that just yet and let's get out of here so I don't have to sit in traffic for five hours  you"
}