{
  "video_id": "oBvw8UmeeHs",
  "transcription": " Hey guys, it's Martin. I'm so glad to be back for another to-do list. Our June theme is Away We Go. We are talking about how to travel like a pro no matter where you're headed. Let's get into our tips right now. First up, travel with the right jacket. The best traveling coat is linen by far. It's lightweight, it's breathable. Something unstructured, unlined is perfect because it's casual.  but classy. You can still sit down at a nice dinner in a jacket like this and it will survive the overhead bin compartment better than any fabric. Wrinkles are its middle name. Next up, the ultimate in travel hacks. Bringing your own liquor on a plane. Yes, it can be done. You can get those little mini liquor bottles through TSA security. It's easy to do as long as you have them inside of a clear plastic bag. Then, you're saving lots of money and when the drinks cart comes around, all you got to do is order your mixer.  Most people are guilty of bringing way too much reading material on any trip they go on. I know I'm guilty of this. So my new rule is I just bring one book and I bring an actual paperback, usually one that can fit inside my breast pocket right here. I really like a physical book because you can take it to the beach. It can go a lot of places that your tablet can't. So many great apps that you can download before you go on a big trip. One of my favorites, Trip Advisor, where you can read tons and tons of reviews before you book anything. Trip Case, which is a terrific way  to consolidate all your itineraries into one place that you can then share with friends and family so they always know where you are. And lastly, Waze, which is an awesome navigation app that's crowdsourced. It'll change the way you think about maps on your phone. Same Fit on the Road is pretty tough to do, but it's a lot easier if you get a resistance band. It's just this one small thing that you bring with you and suddenly your hotel room is a private gym. You can enhance tons of different exercises from squats to push-ups to curls.  Gentlemen, thanks so much for watching. If you like these tips, be sure to tweet this video. Just tag me and BB Mann to-do list. Have a great summer vacation. Happy travels. Be safe out there. We will see you next time."
}