{
  "video_id": "oEQ_aGwksHE",
  "transcription": " A mensch is a Yiddish word for someone who acts like a respectable person. The Red Bull was totally for being a mensch. We wanted to start acting like a mensch. And we wanted to go outside of our comfort zone and start doing something that would make us uncomfortable but at the same time give us a feeling of it felt good to help someone today. I go to the market square to see if anybody is in need of some help. We're gonna go try and see if we can get food or whatever they need. Once we were already in the square, we thought we might as well have  some fun so we started doing some tricks on the rollerblades. So we tried at the square but we didn't see anyone around and now we're on our way to go under the bridge. So as we were going around to find people who looked like they were need I remembered when I go skating by the bridge I've seen people  We have a Danish and we just wanted to know if anybody was hungry or wanted it. What kind is it? It's apricot. I'll take it. Perfect. Thank you. Enjoy guys, have a good day though. Mission successful. We were able to make someone's day I hope. I hope it didn't come off in a bad manner like oh we're making fun of you we want to give you some food but as an actual act of kindness from our hearts that we want to go outside and we're coming  But a mensch doesn't specifically mean someone who's doing acts of kindness. A mensch is also someone who works on their inner self and how their being is. So to do that, you have to learn Torah and Torah will tell you exactly how to live your life. I just got up. We had a mad Fibrain last night that lasted until about 2 in the morning.  Everyone and everything! God's creations!  I decided that going rollerblading before Mifsaim would definitely help. Now that I got my exercise, it's time to go on Mifsaim. The Rav Pinya just told us that there's a Jew in the basement of the JCC, which is like across the street from us, that needs to put on to fill in.  Just luck  Good Shabbos!  The most important thing is to establish a relationship. Yes, Tefillin is a mitzvah, but the whole entire Torah summed up is love for your fellow.  This is going to be intense. That's a G. F. That's nothing. Play us a little tune. We're going to sing over it. I'll show you some blues.  We are getting ready for Shabbos. That was perfect.  When I go through and I edit this video I have to look at everything in the positive light I encourage everyone here to just look at what you've done last week and think about how there's Positivity and everything with that guys Please do an extra act of kindness because doing that could tip the scale and bring Moshiach So Moshiach now and have a good week guys  You gotta be strong, you gotta feel like you own it. Fight against the darkness, it's trying to control you."
}