{
  "video_id": "oQxDR7c6Sv8",
  "transcription": " Hey guys, it's the next day and as usual I didn't end the vlog because you know me, you know I don't end the vlogs properly I'm here with Suzanne and Janina! I finally had the day! This is our very first Creator Event in September!  Today the second day of our ventures in Cebu. Where are we going again, Madam Lore? Actually to the mountains. That's what our cousin said. To the mountains. We're going to the mountains you guys. Check out that neighborhood. They have like this swimming pool. This is a good place.  You outside well, it's like you can really see the city From here You have the mountains there, it's so cool to booze like very industrialized and it's awesome  Yeah, this is how crazy we are. The moment you think we're normal, girl nah, you're wrong. The hair is up in a bun. So now I'm ready to go. So we're going to the pool. We're gonna check out the pool. We're checking out. They actually, I just realized that they have like foot and body massage in here. And also they have this like coffee  Free station too inside here so  It's the flower of... and look at that! We have like floating umbrellas. And then look at that! So beautiful! I think we need to take a picture maybe. So guys... It's Yurao. Yurao can't even read. Guys, look! I'm in the land of the flowers! Of the pink flowers!  There's a pool up there. Right? Oh my gosh, look at that you guys. The mountains. The cousin, Tejen. This can be hard. It's going through.  Okay, we're moving Wait Oh my gosh When you rent this place, it's like 200 and 100 pesos per day 200 per day 100 pesos per hour? You kidding me? So it's better that you actually rent this for the day  It's a big house.  And all its goodness. We're going in here. Filipino restaurant. Oh nice. This is good. That is pretty. Their placement is so cute. And the chair is so nice. It's pretty. It's all vintage. And everything.  I like how clean it is and simple Because sometimes when you have like too much designs right? or anything, it's just wrong. Bay scallops Egg, red egg, chicharon sisig. What do I have at home? Chicken something. Can I eat? Mirror. Things.  I feel so welcome in this place  Go ahead and dip it. It's called nguyen. Oh yeah, nguyen. We're going to be trying the sisig. Let's try the sisig. This is a vegetarian sisig. Lots of vegetables.  These are mushrooms.  everything and then eat it. That's the process of eating Halo Halo. Okay guys, so my sister did the whole mixing and stabbing for me of this Halo Halo because it's like, it turned into this ice cream.  Guys I finally found it mahogany teakwood and this is from Bathroom Body Works. The other one is this vanilla bean.  I don't know how to fix it."
}