{
  "video_id": "p4f2gqgsgMM",
  "transcription": " What's up guys welcome back to our channel today? We are getting extensions for the first time ever we have virgin hair We've died before but we've never actually gotten extensions. We always use the clip-ins So this is gonna be a really big day for us because we've been wanting to do this for a long time But we've been so nervous because we heard that extensions can kind of ruin your hair. We are in good hands We are going to go visit Monique at extension bar, and she's gonna take good care of us. We're gonna vlog it  show you guys our experience getting extensions for the first time. This is the official before and we can't wait to show you guys the after. Let's go. This is the last time you're gonna see my hair like this. We are about to walk into Extension Bar and get extensions. We're gonna show you around inside. Come on.  The joint is jumping. There's Monique. She's busy, of course. Getting everything ready. My favorite part. And the star of the show that's asleep. He's dead. I know. Oh, don't wake him up. Oh, look, he's getting up. Hello, jerk. Good morning.  Look who woke up Walter yay The goodest boy and the mascot of extension bar Julia is up first getting a toner Before the extensions just so everything's even and the color looks consistent throughout because it's been a couple months since we got her. Yeah So first we got our hair toned  And I'm up next for blow dry and then they're going to add the weave, the inches. That's it. Yay. We needed this. I got my hair toned and blown out. And now I'm about to get my extensions in. That's the next step. Liz is still getting blow dried. And we're about to get our inches. So excited. And we're probably never going to go back to this hair again.  Take a good look once you get extensions, you don't go back Update we are both blown out. Oh, no, we're ready for the team  More hair hair hair hair getting started getting parted And here is the hair  Wow  Yeah, six to eight weeks  And we're doing the T-bucket. It's the T-bucket. What our version is called, Every Babe. Every Babe. So, hashtag Every Babe. Every Babe. And that is Eden. We love her. Yes, we'll see you, Eden. And you're on the vlog, so...  Yeah, does it does it have here like a little bit Yeah, the color matches beautifully and this is perfect timing for our birthday last for birthday and New Year's  Wow look at that matches perfect Because of all the blonde dying it blonde all these years to Juju was in need  Oh, hello! Amazing! It feels fantastic. It looks fantastic. Oh my gosh! Oh my gosh, guys. Look at this. It's beautiful. I don't even recognize myself.  Update Look at you just locks the hair is so soft Like I mentioned it feels literally like my real hair. I don't even feel a tape. It's perfect animal success It feels just so healthy and long That's everything I could have ever dreamed for more and yes, you're right. I needed that. Thank you I know  Hers is a little bit blonder, but it's that's our natural differences like hers is a little bit more bleach and mine's a little more Dirtier yeah, yes, so we are obsessed Monique you killed it And we still have to take pictures so Wait excuse me. I'm looking for my sister. Her name is Julia. Oh, it's that's you Seriously I haven't seen you with this long luscious hair, and I can't even Is it a wig? Hold on let me check  JK look at it from the back though. Oh You haven't never had hair this healthy girl The right hair this long healthy and long you're about to like take the streets of LA by storm I'm shaking. I'm so excited  Oh my god, oh my god. But look at the subtle difference, it's perfect. Oh my god, you guys, we're obsessed. Extensions are life changing. If you ever wanted or have questions about them, let us know. Your questions in the comments. It took a village, but we did it. And Walter! He's had a long day.  Oh speaking of, is that a raptor?  You"
}