{
  "video_id": "p_u5NTopEso",
  "transcription": " In 1952, Rocky Marciano stepped into the ring to become the heavyweight champion of the world. It was a title he would never lose, for what Rocky lacked in bulk, he more than had. Next week, another monster punch-up as extraterrestrials set prehistoric monster Titanosaurus and Ardiphith... ...up to 175 pounds of next summer's holidays for only a pound deposit.  Yes, our summer 93 giveaway means you could go free. Free? So where are we going then? Caribbean looks nice. Settled then. Costa del Sol. Thomas Cook are packing up a great deal into next summer's holidays. So don't just book it, Thomas Cook it.  Good evening campers. This is the pound of fire, yours for under £5,000. And this is the uno fire, for under £6,000. But how about the curry? They're selling like hot crumpets. Fido? Fido.  23, 23, 23  Gerald Ford! Don't look now, but I think we got one of them mystery customers in. Where? Sitting over there, by the door. She was having a really good nose around just now. What did she have? White wine. Was it cold? Yes. Was the glass cold? Yes. Did you offer her a choice? Yes.  Should be alright then? Yeah, anyway, choose that natural. Yeah, natural. Alright! Ansels. Better service, better pubs. No mystery.  with the family. Sort out your pension. That's an easy one. Walk into any TSB and see how easy we've made it. Or call us. We want you to say yes.  Oh, I win again. Three nil? How can anyone be that lucky? Best of seven. Okay. This time I'll play it cool. Here comes my winner and it's a beautiful run and he lobs it across and a strike and comes in and he's dummy again. Never mind, Dad. Here comes the PG Tips. PG picked the youngest, freshest tips of the tea bush, which makes PG Tips the tea you can really taste. You know, son, there's more to this life than winning. Yes, Dad. Best of nine.  John Smith's bitter tend to concentrate on the beer. That's because John Smith's has a unique full-bodied flavor that deserves no nonsense advertising. In fact, it's been a constant battle to keep the ad people at bay with all their gimmicks. But thank goodness John Smith's... Oh, very clever. Oh no. Get off!  get this chip grease completely out at 40 degrees. Because it's fat. And butter? At 40 degrees my powder won't always shift it. How come? Because it's fat and some compacts don't stand a chance at 40 degrees. And now? Now there's Aerial Ultra with Fat Digester. It's remarkable ingredient. Look, on these fat stains at 40 degrees some other compacts can have problems but Aerial Ultra digests fat leaving clothes ultra clean. I hate to admit it but Aerials work.  The fat had no chance, even at 40 degrees. Aerial Ultra, digests fatty food stains at 40 degrees some other compacts leave behind.  before the clapperazzi get here which way's the kitchen? Golden roasted, richer, smoother Nescafe Gold Blend. I don't know why I let you do that. Because I... You serve better coffee. Besides, I love you."
}