{
  "video_id": "pDfwyiHcEkM",
  "transcription": " Before I became the UN HeFuShi Ambassador, I started a foundation called MUDD.  in 2012. And so my focus really was through that foundation to reach out to young men, to boys, and speak with them, engage with them, and discuss concepts of masculinity, definition of manhood, on what basis, on what parameters, on what set of values, or what understanding does one call oneself a man. So it really started from there. So going to colleges, engaging with them, and through dialogue,  encouraging them to involve and include values like gender equality, respect towards women, focusing on freedom and equal rights, equal opportunities for everyone, not just boys and men. So make that a part of the definition of manhood. So this is what we were working on, and that's when the UN got in touch, and I think the HeForShe program is also calling out for young men to get involved in this dialogue.  So I'm continuing doing the same work that I was doing before. Of course, there have been certain changes because now with the UN being involved, as Marid, we have a lot more access to many more people to discuss and debate ideas, get assistance from people if need be. It's very nice to see the popularity of Indian films and it's growing everywhere we go. So it's a very healthy sign that the audience and the size of the audience is increasing.  It's great. I feel like I'm part of something that's very, very special. You know, I actually do feel that for most of it, the world has suffered from patriarchy. And I think a lot of it comes from traditional values being inculcated from religion. And there's a lot of patriarchy in religion. But for me, the turning point really was there were a couple of things that happened in 2012. One was the gang rape that happened in Delhi, which was  huge, it was very, very disturbing. There was a lot of anger. I felt like I should do something about how I'm feeling. That was one. It was closely followed by the rape of a five-year-old girl, which was again just extremely brutal, very horrific. There was also, just all these incidents happened very close on each other's heels. There was a harassment case that happened in Assam  where a woman was harassed on the streets by just many men and there were people filming it, it was just grotesque. And then finally, the one that was closest actually in terms of personally affected me was the attempted rape and murder of an employee from my office who worked with me for years. So she was murdered by her security guard who tried to force his way into a house and tried to rape her. She obviously fought him off, but he did.  So there were all these things that happened and I just felt that it really something needed to be done. We can't just be mute spectators just you know like venting when an incident happens and then moving on with our lives. That some kind of sustained effort needs to be made.  It's very tough for me to define. It probably would be more easily answered by someone who's not Indian and not an avid Indian movie watcher and has kind of introduced himself to Indian movies through this film.  capital, you don't want to be known as a country where women are not safe to walk around and everybody carries it. You hate it. You hate the fact that people think this way. But you have to do something about it. You have to change that image. And the young people in India, I think, are hungry for that change. What a lot of them, when we interact with them, I think have not yet realized is the power of their voice is what they haven't. You know, a lot of them feel they can do stuff on the ground where they are. But collectively, if you demand change and collectively, like it happened after the  the Nirbhaya incident. There were changes that happened in legislation, in the definition of rape, in the definition of sexual harassment. In the wake of the MeToo movement now, there's been mandatory guidelines now that have been put in place for sexual harassment committees in each office, in every union. So these changes, these are changes really that are being demanded by the younger generation. And those changes are happening slowly but surely.  Today what's happening is a massive, massive effort on everyone's part. Starting with, of course, the state government of Maharashtra with all the clearances that were needed to get this done. And then, of course, all the artists and everyone who's come and performed. And they want us to have a better life. They want our children to have a better life. So it's really wonderful to see the amount of people who've come out here to support me. Initially, I mean, there were eyebrows raised and questions asked as to why a man needed to be doing what I was doing.  when you call yourself a feminist, it did raise a couple of eyebrows in certain circles. But I think, because also, I mean, I guess, in their defense, you know, if I have to play devil's advocate, I mean, initially when I started, it could have maybe felt to them that it's just a reaction to an incident and I'm not serious about it and maybe it won't, I won't be sustaining this effort with time to come. But now it's been seven years and we've been working nonstop every single year,  possibly can. And for now, those voices are more supportive than critical. We will certainly do that. With this, I'll request Salim if you can actually add all. I'm trying to get better and looking forward to the dawn game. And I'm sure people... How was that?  So the amount of money you are going to spend is like a custom shot.  punches are concerned. We're throwing them all. So it really is, it's a big mainstream ball game."
}