{
  "video_id": "phcTSB7CzAo",
  "transcription": " Defender is the vehicle that I would get in and drive across any desert in the world.  There's a 300 TDI, which is probably one of the best engines they ever put into a Defender. I've had a truck like that before that I got to spend some time in. The whole Land Rover experience is there. You feel like there's not a lot of car around you, so you're kind of out in the elements. The doors are really thin. You can feel the wind going by as you kind of rattle through stuff.  you  The Defender embodies heritage. The fact that it's the same truck for so long. It's kind of scary that it's a 1996 build and it's that rattly. The Defender, it's quite an iconic car. I really like being behind the wheel of those. I feel quite at home there, so always a real pleasure. The Defender feels like a school bus. As a Land Rover owner, it was my first time driving a Defender. I was honestly shocked by how bad it was. It fits the image of the Outback.  of any desert actually. It has plenty of room for all your gear. It has enough torque to idle over big rocks. It can rally up the dunes. It's nothing, it's not too much power, but it's comfortable. The power steering, the coil spring suspension rides great. It gives you a quintessential view or vision of traveling across the outback Australia or Africa. It's just a safari car. It's built for overland travel and it's perfect down here in the Simpson. Everyone loved  teasing the Defender running into the trip, but I think it showed everyone that it's the mighty icon, especially when it pulled the crew truck out and also the 40 as well. The Defender seemed to power through quite well, not too many issues, we've had a fuel issue with it, apart from that a few rattles and bumps and she's gone pretty well. Defender, probably the statesman of the group I think, didn't do much wrong, didn't do anything particularly quickly,  got through everything and definitely hard to get some people out of that vehicle. Well it's no secret that the Defender is my favourite vehicle of this trip. I absolutely adore the thing. And this one's a 95 model and I gotta tell you the performance of that engine with low down torque, the way it went, it really surprised me. The Defender, look Land Rovers are not my favourite car, that's not a secret. But I tell you what, that thing is awesome. It just ploughs along, trugs along, it's given virtually no trouble. I think it had a little fuel water  issue but really no trouble at all and I just sailed through everything with relative ease."
}