{
  "video_id": "pmqoc7KPNPw",
  "transcription": " In October 2015, a monster storm dumped 18 inches of rain in Columbia, South Carolina in less than 24 hours. The flood devastated the area.  I'm Michael Marche, owner of Forest Lake Fabric. My family's been in the textile business for right at close to 100 years. Working with your family and for your family, it just makes every day more meaningful. Our typical customer wants to come in and redo furniture, redo their bedroom. Anything from just to redo a pillow to a paint color to a building helped me get started.  Usually someone does one piece of furniture, they want to do another one and another one and then the poor husbands, they're like, when my wife comes into the store, she wants to do a sofa and the next thing I know I'm gutting my entire kitchen. Forest Lake Fabric was run by my grandfather up until 1990, which at 90 years old, he finally really wanted to throw in the towel. He really gave me the reins and I took it from a little small floundering company to what it is today.  and really the business was booming. And that October night came. It was a pretty nasty situation. Flood of the century with Michael. Four dams upstream broke. I'm over here for two days just watching water flow through the neighborhood. We had seven feet of water running through here at 30 miles an hour. Water didn't recede until two days later.  Tuesday we got in here and I knew it was a total, I mean it was, I didn't even know if the building could be salvaged. The water, it blew out about 30 foot section of the building and I was pulling kayaks out of here, railroad ties, tremendous stumps. There was fabric for a quarter, half a mile downstream all in the trees. I was floundering, I didn't know what to do.  didn't know what to do. I think that following Saturday or Sunday was when we were able to clean out the store and hundreds of people showed up. His friends and the people of Columbia came to his aid. I mean it's just like they were members of his family that were volunteering to do whatever they could do to help Michael. Well, needless to say that we were so grateful to have so much help.  Michael was pretty much in shock in the beginning. We did lose all the inventory and basically we did have to start over, completely over. And we're faced with, do we rebuild? Do we reopen? And at that point, I had already started talking with SBA about getting me back in business. What do I do? Well, SBA has an Office of Disaster Assistance and we have approved over $53 billion in disaster loans.  My job is to give you options. My wife and I signed a note and we were in business with SBA. I think by April I was completely funded. The Marches have been in the textile business for ever and a day. We were determined to keep going. Ginger and I talked about it almost every single day, what we wanted the space to be like, not only for us, but we wanted to represent our family well, our community well. We wanted the community to love it. We wanted it to feel the same, but just a little bit different.  little bit nicer. When we look for candidates for the Phoenix Award, we're trying to look for somebody that really needed SBA's assistance and was able to recover after the disaster. They were resilient. So just a champion story and those are the types of things that we want to tell. The SBA came to my, they came to my rescue.  you"
}