{
  "video_id": "pScHAD2PyTw",
  "transcription": " Hey guys, it's Rebecca welcome back to my channel today I am gonna be going shopping for some room decor because I want to redecorate my room for Christmas right now We're at at home and we're gonna go see if we can find some Christmas ornaments because they have a lot of ornaments here and they're having a huge sale right now. We're at home and I haven't found anything to add to my tree, but Sarah found this little tree that she could put in her room  we're in the pot zone, pot zone it's really crowded here so it's kinda awkward to vlog I'm in like a really dark aisle but next we're gonna be going to pier 1 and then I think target oh my god wait give it to me let me see I'm not your maid what if I did get dumbo? I know but I don't know what I should get oh hello, is it fun? yeah so we just got back from target  super excited because I just found these blue glittery ranger ornaments that are gonna match the theme of my tree. 530. okay guys so we're about to go home right now but before we go home I want to go try Starbucks new Christmas trees because I heard that they're really good this year.  I come from Starbucks and what I got is the peppermint mocha and I've never had it before I've never tried Starbucks fall drinks Christmas drinks. So let's taste test Oh, it's gross I'm debating whether or not I like it. I'm quiet. Well, no, okay  When you first drink it, it tastes like a dark chocolate and then like the aftertaste is like peppermint mixed with chocolate All right, so i'm just gonna do a little haul of what I got yesterday because I didn't vlog at all yesterday And I went to t.g.max and I got this pillow that i'm gonna replace with the pillows on my bed because my When I decorated my room in summer, I did like a summer themed room And I just want to like rearrange it to make it more look like christmas and then  and the last thing that I got was just this little jingle all the way and I was thinking of just putting it right there so this is the tree that I have it is a 4 foot tree that I got I believe from Target 2 years ago and I don't really need a big tree because my room is pretty small  tree. So there's really no big change. All I did was just I replaced the orange pillow with this white pillowcase and then I just put the pillow that I got from TJ Maxx as the center pillow.  Alright, so now that I finally got my tree put up, I'm gonna start decorating the tree with the blue ornaments so it can match my room.  So I finished the tree and I decided that I wasn't gonna put the garland on this year because that literally takes forever to put on and to take off but I really like the way that the tree came out I Think the deer match really well with the glittery blue ornaments that I had from last year  Anyways, that's it for today's video. Thank you guys so much for watching. If you enjoyed, make sure to subscribe and I'll see you next time. Bye!  you"
}