{
  "video_id": "puDwfLDhAgY",
  "transcription": " There she is guys. Hit the train. See there she is. Hit the train.  We're gonna be catching the 150, 250.  Oh that was quick, we've moved already. David in there.  So the first station will be Wrexham General and then the second station will be Wrexham Central. This might be where the last time I watched Grandad.  I'd actually go the other way, going to the other floor.  Why does it say conductors can go through? Why we don't have a conductor going through? We're going under a bridge We're going to turn a corner now guys  I think we're approaching the first station.  It's so loud. It's a Sprinter. It's a class. I don't know what class it is. Class 150. Right then, we're approaching Wrexham General. First station.  This is the last station on the line, no, not this one. I've been filming, like, oh yeah, I've been filming here before. Just had to think about if I've been filming. I filmed the lift, it's not like some genuine one. But as you can see, it is.  Rexam General. Right, in a minute it's gonna come to the sign. The signs are in the shelter. An old warehouse too. Wow, this sounds like a pizzeria. Rexam General.  Oh, I think it's the USB for cutting it off. Or a door.  so  Yes, yes, you don't have to do it two times to see her. My kids come and they blow their whistle twice and I, you know, say you blow the whistle. So now it's a single track. We are arriving at Central now already. We just departed the Expo General.  In a minute guys we're going to be crossing under a bridge by the crossing if you look to this side you may just be able to see the crossing if you're lucky No No look  under a small bridge I hope he doesn't go and hit the buffers at the end right then first, last, start, all change!  Okay, here we go guys.  now we're gonna check. It's gonna close back. We've turned wild.  yes the driver's going to the other side. Can we see it departing? Why? How do you know it will? Wait. Lost person. We're gonna do the introduction to this station later on guys. See you later on."
}