{
  "video_id": "pVi2bv39w9s",
  "transcription": " Day two of VidCon let's see what we got going today All right, all right. I got my food. We're at Johnny Rockets, and I got a little uh What's up? This is called the Houston burger. We got some jalapenos and spicy sauce, you know what I'm talking about. And some fries and ketchup and ranch as usual. Alright, I'm at this iPoll thing right now with Princess and Carla. I'm gonna try it out. I'm gonna put it in this little device and see what happens.  Right so I'm back in the hotel room  with  I think or something like that. I don't know but there's music so I Think so too. I think he's on the big stage Jimmy's performance tonight. So we want to go see him and support So we're off to see the wizard All right, we've got to go get our shirts Look at the last of VidCon guys. Everyone's closing up closing up shop over here. All right, I got the shirt now we got to go Check out the music  They're having a dance party over here. They're like shoot it's the end of VidCon we gon' dance Okay, so we're walking out of VidCon and they just like handed us lip gloss from bareMinerals so hey I'm cool with that. Shoo. Goodbye VidCon I had fun with you. I will see you next shit VidCon. Uh oh, dance party. Uh oh, uh oh, breaking it down Break it down. Oh my god. Look at this guy  He's serious. Oh my god, he's getting down. Long hair don't care. That's how he felt about that dance right now. And we've come to the end of VidCon. Again, I know I said it earlier, but now they're like turning the lights off. They're like, get out. We're done. So with Zach in here, they're trying to  My feet are killing me  me so bad right now i found the seat and it was like i've been walking for five years when i saw the seat i don't want to walk anywhere else now oh and guys i'm in the green room i didn't show you guys the green room and these are my feet my feet hurt my feet hurt all right guys well um vidcon day number two has come to an end and i'm really tired and i'm just gonna  I'm gonna go to bed. So I will see you guys another day. I'm excited to go see my bubs. We're just chillin' out."
}