{
  "video_id": "PvlM8BEcsBg",
  "transcription": " Corbin six start of the year league only hitting 200 against him. First up Matt Carpenter to to pitch fastball called him out did Quinn Wolcott the home plate umpire and Matt Carpenter didn't like it. Corbin against Ozuna as Paul DeYoung walks for the eighth time.  A one upper back to Corbin gets the glove up self-defense and jogging toward first the underhand flip to Adams retires the side Michael Waka back to the Cardinal rotation. The missing is last turn. It was left knee tendonitis. So that is the front leg the plant leg if you will for a pitcher. Here's strike three over the inside half and Eaton is out looking to a way for the dangerous young one Soto. Here's a swing and a ground ball the first fair ball fielded  by Goldschmidt he veers into foul territory comes back to the bag three up three down for Waka Harrison Bader the center fielder batting eighth in the order buzzes him with the fastball inside edge to stranded by St. Louis runners on the move here. Gomes takes the walk. There's a chance to help yourself out big time. Corbin though can do some things with the bat in his hands where he balls two strikes two out runners go the pitch.  And Adams crosses the plate. It's the Nationals one and the Cardinals nothing. Here comes Adam Eaton. Now the Nats are playing with house money here in the second. Adam Eaton with a base hit left side. Home is Dozier. Here comes Gomez throw from Ozuna offline and everybody is safe. Three nothing Nationals clutch to out knock from Spanky. Great piece of hitting right. Don't you just love it when he goes that way. So lines moving here. Great at bats. Yeah. Power the stash.  Maybe one and two. Strike three call inside edge first time through the order. Cardinals go 0 for seven with two walks and three K's swing and a miss on a big Corbin curve. A call that a slider at eighty two and some big time moving on that and he struck out three in a row. Marcel Ozone to the hitter off speed Ozuna to short key boom in between hop and he never got it on his glove. And Ozuna is going to sit on second base after Carter Key  the third. Opportunity for the Cardinals to get on the board down three nothing with the dangerous Jose Martinez. That ball hammered to center Robles on a hop. Pop Warner has to hold the runner at third Ozuna there Martinez. And that's the first hit by the Cardinals. It comes with one out in the fourth inning first and third one out. So they bring the tying run to the plate. The guy with the 15 game hitting streak Yadier Molina the left hander delivers swing and a ground ball to the second baseman Dozier has it to Keybo for the out the throw to first.  The double play it took all of one pitch for Corbin to dial up to. Cardinals have just one to get Bader who was called out on strikes first time up. He's only allowed five home runs and maybe he's given up six. How about six. It's gone in the right center and a home run and a long one at the bat of Harrison Bader. Harrison's got big time power. He's shown it off before. We know he's got the wheels. We know he's got the glove. You see the distance.  distance one hundred and eight miles an hour off the bat. Cardinals are down by two three and one two on two outs the pitch to DeYoung ball for up and away and the bases are loaded for Ozuna the two one pitch. Gets away and a run will score. And the Cardinals have pulled to within one. It's now a three to Nationals lead three to pitch Ozuna hits it up the middle base.  Here comes another. And the Cardinals go on top. Marcel Ozuna drives in two. Let's see if Jose Martinez can keep the line moving. He's the eighth Cardinal batter in the inning. And that's ripped out to left. Get going Marcel. Almost tripped around the bag at second. They're going to wave him in. And Jose Martinez drives him in. 5-3 St. Louis.  in the ninth cardinal batter in the inning a swing and a smash up the middle base and that goes in the center. Martinez scores and a base hit makes it six to three cardinals a six run fifth inning. And Gomez at the right center. Patterson Bader. A line drive and Bader comes up with a beauty in right center field.  The man right there this thing just hangs up in the air Harrison full extension coming in on it. That's a difficult play. He makes it look easy Soto at second Adams at first. Oh here comes Carter tie game Kibum Carter tie boom Kibum will take the walk and the bases are loaded. And now it's up to Dozier to make it hurt one strike to count the pitch a swing and a high pop up on the infield. Rebbia gives way to the first baseman Goldschmidt who makes  leaving the bases loaded. 13th appearance, third day in a row for Jordan Hicks and trying to pick up save number nine. Eaton hits a ground ball to short. The throw by DeYoung, a Redbird winner."
}