{
  "video_id": "pVtGU9nVZbg",
  "transcription": " Party! Party! Party! Party!  and  to catch crumbs and chunks of food and stuff. So, you know, just taking a drink and swishing it around before that would just get particles lodged or dislodged and caught in the metal grill that's just hanging out up there. But now, every time that I brush my teeth or take a drink, I can swish and there's no chunks of food stuck in my mouth, which is awesome. So, some of the great things that you have to look forward to, not only straight teeth, confidence, but also being able to eat some of your  Most love foods again. I go back in about six weeks to get my teeth whitened They said right now my teeth and gums a little too sensitive to handle the whole whitening Combo I go back tomorrow and get another set of impressions made for my clear retainers for My removable ones that I'll put in at night besides those two appointments. I am completely done So obviously my braces are off a couple more appointments and I will be finished so I want to walk you through what my  appointment today was like and if you have any questions about any part of the process feel free to ask me and I love being able to help people and answer those. So this visit today I showed up and the first thing they did was they cleaned the inside the lingual side of my teeth if you will and they cleaned those so that they could put my permanent bonded or they call it a bonded retainer not a permanent because it can come out in the future and it is not  permanent in that sense. So they call it a bonded retainer. So they cleaned and prepped my teeth, put some conditioner on there so that they could go ahead and apply the permanent retainer. They put in my mouth this plastic contraption that was in the shape of a butterfly that holds your lips out and holds your tongue in the middle of your mouth so that you can't touch anything while they're working. And they call that a plastic butterfly or simply just a butterfly. So that's kind of uncomfortable, but not anything that touches your  a  on top of my wire for both my bottom and top. So my permanent retainer goes, spans six teeth on the bottom, four teeth on the top, goes from three to three and two to two for my retainer. So they did that portion, then after they got the wire bonded in top and bottom, they went ahead and popped off every little bracket. And the metal ones, albeit all of the braces being removed was pretty painful because they basically just take  pliers and pop it off. I was a little taken back by that. I thought for some reason that they're going to like melt them off or the UV rays from the light was going to remove them. But no, they just take some pliers and manhandle those sons of guns right off your teeth. So the metal ones aren't bad. They stay together. They pop off. There's a little residual glue left there that they need to polish. But the clear ones, different story. Since they're a mixture of glass  and acrylic, if I am not mistaken there, have some type of glass components to them so when they are being removed, it's not uncommon for them to shatter or for there to be some shards left behind. So there was a little bit of shards, I didn't have a bracket shatter on me when they were taking it off, so that was good. But after they got all of the brackets off top and bottom, they took quite a while  polishing off the residual glue and getting my teeth back to the smooth surface, back to what they were pre-brackets and pre-braces. So that was a little bit of a lengthy process, a little uncomfortable just because my mouth was open for so long and it had dry powder from the glue just kind of sitting on my teeth and gums and I couldn't really swallow or do anything. So that was a little uncomfortable but nothing that you could not push through on that pain side of things.  Then after they did that, then they took another set of impression, alginate impressions, I have them right here. So this is my mouth, but cast in plaster, I think. And as you can see, I'll show you, there's the permanent wires were formed to these impressions and heat treated. They heat treat the permanent wire so that it won't bend back to its original shape, original form.  the heat treatment does something with the ions in the metal that really locks it in place. So they took another set of alginate impressions for my nighttime clear retainers, and I'll pick those up in another session, another meeting that I have tomorrow with them. And that was the same same ol' alginate impressions that I spoke of in the last video. They're just a tray of white goo. This time I got watermelon flavored and bubblegum flavored for the bottom tray.  You just hold them in there for about 90 seconds and you sit there and then you're done. So it's not too bad. You can't swallow or do anything. So you're uncomfortable for 90 seconds, but it's really not that long. Then after that, I got some x-rays, got some finishing photos, a little polishing, last cleaning, and boom, I was done, sitting on my way. And so it was relatively quick. I thought it would take a little bit longer and relatively painless, sparing the pain  popping the brackets off. They're just sharp little half seconds of pain and you'll be able to get through them. It'll be worth it to have some clean teeth that you can finally sink into a steak or apple or beef jerky or chips or Laffy Taffy or popcorn or whatever. So if you have braces, stay the course and know that in months from where you are right now, you will have a beautiful smile, be able to eat whatever you want. If you're thinking about braces, it goes by so quickly. I can't believe it's already been 11 months.  since I first got these dudes on and now they are off. And if you have any other questions, feel free to ask them. Thank you and enjoy.  you  you  you"
}