{
  "video_id": "Pwb86RDw_3Q",
  "transcription": " I know many of us find it hard to get our kids to eat fruits and vegetables daily, but have you guys ever tried making a game out of it or making it fun for them? Well today we're going to get these kids to learn how to eat healthy and have fun while doing it. Are you guys ready? Yeah! I'm so excited! Okay, everybody should have three circles. One green, one yellow, and one red. It's been invented for kids to understand healthier eating.  involves is a traffic light. Green means go. Those foods you can eat as much as you want, anytime that you want. Yellow is basically slow down, have them once in a while, think about it before you eat it. And red is the stop, don't go near it, something you should really avoid. Most kids won't even touch a piece of broccoli. But by making it a game, kids actually get excited to eat their fruits and vegetables. The classes that we have taught this in, the kids really take it home and use it with their  It's been great to see not only my kids benefit from it, but all their friends and their classmates. This game teaches kids to stop, think twice, and really understand what they're eating before they pick up that next snack. I felt like we ate really well before, but once we started doing it, I think it improved her ability to know what she was eating. When I'm not around, she's able to verbalize and say to grandma, well that's a red light food, or you know, maybe I should have a green light food. It's yellow!  Oh, it's yellow. Traffic light eating helps kids be health conscious and make good decisions, even when their parents aren't watching. I don't know about you guys, but I think red light eating is extremely educational. I now see, too, as an adult, I can use the red light advice that they gave me. I don't think that it's ever too early to make kids aware of what they're putting into the bodies and get them health conscious. After all, aren't you kids the children of the future? Traffic light eating! Remember to connect with us. I'm Brittany Cascone for KTVU.  Shake arms, stop signs."
}