{
  "video_id": "q_0mTO2F5f4",
  "transcription": " Okay, I'm going to my new job at McDonald's. I forgot to tell him that my sister is  coming to stay with a stem. Can I take your order?  Dr. Pepper my brother, another for your mother, double double super sized and don't forget the fries.  I need a double cheeseburger and hold the lettuce Don't be frontin' son, no seeds on the bun We be up in this drive-thru order for two I gots a craving for a number nine black mashed shoe We need some chicken up in here in this sizzle Marizona, my missile, extra salt on the frizzle Lots of pepper, my brother, another for your mother Double, double, super-size and don't forget the fries  Big Mac  Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac? Big Mac?  Say crispy, just say crispy. CRISPY! Hey bro, I am here! Where do I sleep? This is where you sleep. Oh no, what's up with my voice? That's what you get for not liking my rap. Are you okay? Yeah, I am okay. Hello? Oh hey honey! What?  You're what? I am gonna be what? Okay, I'll see you there! Hey you, I'm S-Rapper Wannabe, is you ready for round 2? I am gonna kick your asses right here right now! It's not true, that's impossible, I was a good kid, nah! Don't change the subject, get in place!  Honey, you said this was gonna happen but now look. You're... pregnant. There is only one thing to do. I'll be right back. Honey, will you marry me? What the fuck? I get pregnant and you propose? Well you can't raise the baby by yourself. Oh then in that case... Yes I'll marry you! Oh no wait I changed my mind I changed my mind I changed my mind!  Hey Widow! What the fuck? She is moving in! Damn you, you bastard, you just had to propose! Why didn't you do what half of America did? Oh my god, Widow is engaged and the worst part is Zunni is pregnant! And I am taking a shower, you sick freak! And so what if he is engaged? Good for him! Look Rose, coming this way! Me and my friend challenge you to the arena games! We accept!  We are the champions my friends! What the hell, Sake?  I always wanted to say that.  I'm just living by my own feelings And I won't give in, won't compromise Cause I only have a steadfast heart of gold I don't know why I can't lead, oh it might be tough But I am out of control, just living by my word Don't ask me why, I don't need a reason I got my way, my own way  I  So much to do, where do I stop now? It's all blurred, so unclear Well, I don't know, but I can't be wrong It doesn't matter, now what happens I will never give up the fight Long as the voice inside drives me to run and fight Face all your bets on the one you think is right  Oh, it doesn't matter now what happens I will never give up the fight Long as the voice inside tries to run and bite It doesn't matter who is wrong  No, no, no, no It doesn't matter"
}