{
  "video_id": "QCs4Kaz88NY",
  "transcription": " The small village of Hüttingen in the Eifel region of Germany  Amongst this scattering of single-family houses sits a little architectural jewel. The owner of this seemingly unremarkable house commissioned the architect Nikolaus Bienefeld to build it entirely from brick. The point was that he loves or likes brick and wanted to use it, which I found difficult at first because  Bricks aren't common at all in this region. It was tricky finding the right company, especially because brick facing isn't used in the vicinity and there are also hardly any qualified craftsmen or bricklayers who know how to work with brick. After searching for a long time, we were lucky enough to come across a local contractor who originally comes from Münsterland and who had both the necessary experience and  Calm. This was undoubtedly necessary to achieve the accuracy which really brings the house to life. An unusual pattern of facing bricks which incorporates the finest of details. It all begins with the bricks themselves. They come from this house.  and are made from two different sorts, a mixture of lighter and darker colours. We also haven't used standard-sized bricks, but ones that only measure 6.5 cm. The mortar joints have been made at a ratio of 1 to 2, so that means the bricks measure 6.5 and the mortar 3.2 cm.  Thirdly, we've turned the lay of the brick outwards. And finally, we've laid the joints directly in line with the bricks. The choice of brick itself, I'd say, it's gnarled or not particularly sharp, creates a slight blurring, so that you could almost think the house has been plastered. Details such as the bricked post box almost seem to suggest themselves, thanks to plant  that was accurate down to the very last millimeter. By making all the facades slightly asymmetric, Nikolaus Bienefeld guarantees a barely noticeable sense of optical suspense. Brick and the massive wall dominate at all times. The construction of a wall is always important for me. It's not just a supporting structure, but a source of comfort.  and a vital element in creating atmosphere. So a permeable wall can only be made using the proper materials, in this case clay blocks which regulate humidity. The exterior view is of course also created using brick. So we've used the same materials throughout the whole of the building, which naturally aids the homogeneity of the house.  Going back to the original task of building a small house,  All the features here have been reduced to the bare minimum. For example, the stairs are functional, although they don't use standard specifications. The same goes for the doors, which are extra slim. But by reducing the house in size in this way, until you are only left with what's necessary, it brings the essence of the house to the fore. It's a small house, but it works overall, because everything has shrunk along with it.  it."
}