{
  "video_id": "qjsOcpRVuVA",
  "transcription": " Hey guys, my name is Omar, this is Zach, and this is Devin. Devin's gonna play the Caucasian man that verbally abuses him, and this is based on the events that happened in Ottawa. We're gonna see if people feel safe to be around Muslims or people that look like Muslims. Let's see what happens.  clothes or their nationality or anything else you know I mean what happened there it was an incident of fanatics I do understand everybody cannot be punished like that they did that in the States 9-11 it was crazy so I mean I'm sorry but I'm with him too I would not put a turban on I want a first person tell me I can't come down here and wear a turban or a dress he could be armed with explosives so could I  Okay, and I'm not of any religious sect. I was a fanatic. No, he's with me. No, he's with me. He's with you? You want to take responsibility for his actions? No, I can't actually. How many friends of mine are Muslims that have... You know what? True Muslims do not believe in that shit. It's fanatics. It's crazy people. You can't punish everybody in the world for a crazy person. But did you see...  I mean, you know what? I don't feel safe. So I mean, I can't take this bus here. So I mean, excuse me. Can you just come with me? I'm saying that this guy looks like a terrorist and it's not safe to go on the bus. You think that's ridiculous? Well, I'm just trying to look out for you guys. Come with me. I'll check the next bus. I want to take him to another bus.  My point is that this bus could be in danger after what happened with the terrorist attacks in Ottawa. I don't we don't Okay, so you could have mental health issues, too I Could but like I said, I don't dress like this and I don't want that to happen in Hamilton So I'm just trying to I'm trying to  Well, I'm trying to look out for you guys. I mean, I don't want him going on the bus with hope Okay, cool, okay, but I mean, you know What if he has explosive strapped to him do you guys think that Sir excuse me, you're gonna have to come with me  I want to get him away from this building. No, you stay right where you are, buddy. You stay here. No, Will. This is a social experiment. It's a social experiment. Get the f*** out of here, buddy. You're going to get f***ed up. It's a social experiment. To be honest, I don't really remember. You don't remember? No. The guy came up from behind me. Okay, no problem. You're good to go, though. Okay. Alright, sounds good. Sounds good. So, I mean, the social experiment had a negative ending to it, but you know what? It's positive because he stood up for him and I appreciate that. That's good. That's good.  You  you"
}