{
  "video_id": "qOAtCbCbQmY",
  "transcription": " You know what it is episode 3 premium palette back at you we're back at it again in the kitchen frying up some onion celery eggplant And we're gonna combine it for a beautiful spread It warms my heart just thinking about it Today, we're making a cop an odd spread gobbledy deen that some people would say  Now you came here to watch me cook it. I don't know why. So you can learn. I don't know why. Maybe it's the face. It's not the face. It's not the face. It's not the face. It's not the face. Alright, so we're gonna dice this eggplant. I got this eggplant out here. I'm in Allapin, New Jersey from a farm. Pretty big eggplant. I'm only gonna do half of it. As you can see, this is only about half and we got plenty of eggplant to make the spread. You want to cube it up nice and thin, nice and small. Is it stalks? It's a celery stick. Whatever, a couple sticks.  of  cook too much the eggplant and then when it sits in the sauce it's going to break down. You want to have texture with it. You want to just cook everything separate.  Back on the heat. We'll onion and celery fry. Add tomato sauce.  Sugar.  a little bit, let it cool down. Then I'm going to jar it up and we can get them in the fridge overnight. And you really should eat this tomorrow. You should not eat two tablespoons of this right now, even though I'm probably going to. A little bit of salt, a little bit of garlic powder, a little bit of black pepper. So now we're just going to fill these jars up.  Into the fridge it goes. Alright, we'll be back at it tomorrow and this is all nice and cold. See you then. Alright everybody, it's a new day. We're back 24 hours later.  Here it is nice and cold ready to be enjoyed we got some beautiful Italian bread All right, so I'm gonna throw some of this bread up move it all on top right out the oven  What's the Instagram? JayGodsoul, link below. Let's try it out. Nice and cold, a little bit sweet. You get that texture from the eggplant. That's what it's all about right there. How is it, Grandma? Delicious. So there you have it, Grandma approves, right? Grandma approves. Go ahead, go make it.  friends, family, it's a perfect spread to put out. You can dip it, you can make sandwiches with it. Get creative with it."
}