{
  "video_id": "QPLvhqkWHjY",
  "transcription": " Hey guys, welcome back to my channel, my name is Bethany and we are gonna be doing a nighttime cleaning video tonight It is now around 9 o'clock right now, and I definitely need to get some cleaning done I don't usually clean a lot at nighttime because I want to make sure that I am Relaxing at this time of the night, but Luke is actually working a late shift tonight  So it's just me at home. So I thought it'd be a little bit more productive than I usually am at this time of night I'm gonna be cleaning the dishes in my kitchen because that always needs to get done and sometimes I don't unload the dishwasher Dishwasher is always going in my house always always and the living room and I have a ton of clothes that I need to Be put away and folded in my bedroom I have like a definite clothes problem when it comes to like folding and putting things away So we are gonna be tackling those tonight and possibly some of the bathroom. So yeah  Let's just get started with this cleaning video and yeah, let's do it.  Yeah, but this is different, I should hide and certify some self-confirm So finally So finally So finally  We know, we know, we know, we know, we know it's all for nothing  We fight and beg and greet and then we go and act like something And our hearts burn with the heat of a thousand suns Yeah, and we cry out loud cause we just want attention  Yeah, I won't accept this life that fate has given So find a way to get lost So find a way to get lost Just find a way to get lost  So  Hashtags, likes and tweets will find a way to get lost And when I pull up to the scene I wonder what in the hell is the cause  I've never seen nothing like this before Yeah, but this is a season run I try to search and find some self-comfort  Okay, so this is exactly why you don't leave laundry for like once a week because this is exactly what happens this Massive massive pile of laundry and it is not smart because I'm gonna be doing laundry all night. I swear  So I hopefully can tackle this before my husband gets home, but we gotta power through this pile because this is absolutely insane. Just insane.  And in the fourth dimension Is where I left my broken heart And I'm still connected There's a good luck in it Keeping me alive I feel it pulsing through me The rhythm of the universe  You gotta hold on to me So we can take this ride together And we can feel like this forever  All right, so now I am finally done cleaning my house for the night that laundry honestly took the life out of me I feel so tired and sleepy now It's time to relax with a good show crawl into bed and just fall asleep  I am so so tired. Anyways you guys thank you so much for watching this after dark cleaning video I hope you guys enjoyed it give it a big thumbs up if you did Remember to subscribe because I do post videos every Tuesday Thursday and Saturday So don't forget to do that and we'll see you guys in my next video. Bye  Bye!"
}