{
  "video_id": "r6BeiY06VuQ",
  "transcription": " You know, it was a very exciting mining endeavor. First of all, it's the first time in the last 25 years of the existence of this endeavor that a state president of this country actually gave us the opportunity to have his presence, you know, by coming to talk to us as an industry.  giving us a sense of hope that this industry, under his leadership, is going to do the right thing to stimulate the growth of this industry. And therefore, thus encouraging us to continue investing in this industry. As a future leader, it means so much to me to be able to engage with people who are in various disciplines at various levels. I found myself interacting with the president of the National Union of Mine Workers all the way  to be chair of the Women in Mining Association of South Africa and to be in this space is incredible. It's such an experience and you cannot imagine the value that it has added. With us being here and promoting mining, specifically coal mining in Xaro's case, I think there's a future, a huge future for our children and for us to leave a legacy.  and to make an impact in Africa and beyond. So meeting people and collaborating is what we want to achieve from Xara perspective. And hence the Mining Endavo is so important that we actually collaborate with other stakeholders to benefit and bring those learnings into our organisation quicker and make a difference. It's been such a great week being here at the Mining Endavo. I've learned so much since from day one.  and really inspired being here and learning about what other young people are doing out there and just the exposure from our company perspective. I really enjoyed being here, I enjoyed the discussions that our leadership took part in here, so it's really been a good experience. Oh, it was great, really nice to be here and I think it was a privilege and anybody who's interested in it, I would recommend them to come.  25th anniversary was an amazing experience. Learned, engaged, was absolutely incredible. Big thank you to Xaro for including us as the young professionals. Happy to be here and we've learned so much and looking forward to taking this back to our business units and sharing what we've learned."
}