{
  "video_id": "R6dNb64RPIE",
  "transcription": " That is Vintage 10. 2004 to 2010 front strut conversion for a Jaguar XJ8.  The first thing you want to do on your Jaguar is raise the vehicle safely. Make sure that the car is stable so it doesn't fall off. Then take off the wheel. Next step is disconnect the lower control arm and remove the bottom strut bolt. Now remember you want to take time doing this because you don't want to make any mistakes because that control arm  is aluminum. You notice how he's tapping that bolt to get it out. He has the nut on there. The reason why you want to do that is not to mess up the threads on the bolt. Sometimes they're wedged in there pretty tight because you got to remember it's been riding around the road for a few years.  You want to disconnect the height sensor bracket and the upper control arm. The reason why you want to disconnect that wire is because you don't want to tear it out and then create a bigger problem. Now if you look at this shot here guys you want to make sure that you have the right allen wrench for this position. What's happening here is that allen wrench  keeps the stud from turning. This way you can disconnect the upper ball joint. It's important that you do that. Now the upper control arm is disconnected. Disconnect the air valve switch and the air line on the top of the strut.  Disconnect the brake line bracket then remove the upper strut nuts and remove the strut from the vehicle.  Remove your new strut from the StrutMasters box and prepare to install it in the vehicle.  to put the bottom in first and then you lift it up into place to mount the top nuts. That way you've got room to wiggle it around. If you do it the other way where you do the top first you may run into trouble clearing the lower control arm. Now you reconnect and tighten the upper control arm.  At this point you're going to reconnect the lower control arm and tighten the lower strut bolt.  And it's good.  Reconnect the brake line brackets and the height sensor.  Reinstall the front wheel and safely lower the vehicle to the ground.  This is the first side, go to the second. Reinstall and tighten the upper strut nuts. That concludes the mechanical portion of your installation on your 2004 to 2010 Jaguar XJ8 front strut conversion. The next step is your electronics.  You're done with the mechanical part, check your instructions. If you need help, call Strut Masters."
}