{
  "video_id": "R8N7S0evA7o",
  "transcription": " Oh my goodness! First I gotta say, Kiss FM, Team Nick, they did it big today. We're bringing you the cast of Degrassi right here to the Five Colors Universal City Walk. That's how we do it. Give it up for Team Nick real quick.  Give it up for Universal CityWalk as well guys. You know there's a new school, right? New faces, also faces that you love. How many of you guys ready to see some of the new faces? I think without further ado we should just go ahead and tell them to come out.  Get all your cameras ready. Get all your cell phones and your Twitter ready. Start tweeting the Grassy Party with the hashtag in the front. Here we go. First person, I'm excited, here we go. Are you guys excited? I know they are, they're like, oh my gosh, I don't even wanna go out on stage. Here we go. Oh, my bad, I gotta get out of the way. First up, she plays Fiona.  Her last name rhymes with Odyssey. Give it up for Jordie Taunton.  One of Degrassi's newest freshmen, Alex Steel!  And last but not least, give a big, big welcome to the Miami Pigs Eli and the other team mates.  Why is the chapter of the grassy called new beginnings  as well as some of your favorite characters all trying crazy things and just trying to earn your fame.  and even a new love interest. Can you tell me who the new love interest is? You can just whisper it. Alex, you have a special connection to the show. Tell us a little bit about it. Some of these people, they're all over you.  That's a pretty hardcore fan here. And my sister, like, my name is May. What's it like to feel like the freshman on the show? Well, meeting everybody has been so great. I used to be a huge fan. And Tori's really amazing to play. Like, we're all in each other's...  What's new with Eli?  Trying to be not as dark and not as angry. But, uh, you know, no, no, no, that's not what we're looking for. We wanna know, what's up with E-Clair? What's up with E-Clair? Well, well, right now, E-Clair's kinda got a man, right?  Hey, hey, hey, hey! Batman is one of my best friends! You never know, like, Eli and Claire, Claire and Eli, like, they, I think, that's a bond that you can't break. Is it gonna happen? I can't promise anything, but I know that they will be having scenes. Now check it out, Degrassi is in the only drama called The Teen Nick.  You guys gotta check out the new show. They've got an awesome new show next Monday, airing. It's called Dance Academy. Can we check out a clip? Look at me. It's a lovely white woman.  you"
}