{
  "video_id": "RoU-DeiYn5U",
  "transcription": " This is amazing.  So let's go ahead and get into it. Alright guys, so today we are in Byron Bay and the plan is to go swimming and have a bit of a wander and some food before we head back to Brisbane and celebrate Nick's sister's birthday. So it's gonna be a good day. I'm excited to share it with you guys and we'll see what happens. Yeah!  So this is an example of like divine timing and certain things happening so that other things can happen. We arrived to Byron Bay and Nick had an area that he wanted to park in but when we got there it was just insane.  insanely busy because I believe it was a Saturday and there were just a ton of people. There was no parking. So he was a little frustrated and decided to drive to another area. We ended up finding a spot and we were actually a lot closer to the lighthouse hike than we had originally planned to be, which was nice. Not only because was it closer, but when we actually got to the little lookout point, we again got to see whales this time even  closer than when we had been in Valenna and I was just absolutely amazed and excited because I thought, oh the day before yeah we saw whales, you know, what an awesome experience. That'll never happen again and what do you know, the next day we got to see them even closer and if we hadn't gotten there at that perfect time, we might not have seen them at all but we definitely would have seen them as close as we had. So let's take a look.  of mainland Australia here in Pirham Bay.  They're so close, Nick.  Such beautiful animals.  Oh my god. It's so amazing. This guy is just like shooting it. A small bus moving through the ocean. You're not wrong.  We have to make our way up to the lighthouse. 1901. 1902.  Wow! A caretaker's cottage and some court stuff. That's so cool. Imagine living up here. What? Just wait and imagine. It's gorgeous.  What you doing Nick? I don't know, I get what it is. It's a photo pole. So you put your camera on there. Set time delay. Must be for getting pictures of the lighthouse. Yeah, very weird.  This is amazing. Oh my god. Wig! Oh my god! Man, look. Look, look. Wow. I found a country signal. One of Australia's most famous landmarks, the woods. And I realized once we actually got to the lighthouse that if you want to  you can actually drive up to the lighthouse. However, I recommend that if you are physically capable of doing it, do the hike because it's a nice hike through the woods and you get to see lots of animals and there's beautiful views so it's totally worth it. Alright, we're back in the truck. We had a killer swim after we went on a small little hike to the lighthouse. It was amazing. Shut up, Nick. Now the plan is to get some food, coffee. Get out of here!  And head back to town. Yeah, you're good. Golden. And go celebrate Nick's sister's birthday! Yay! So we just ordered sandwiches and coffee from this little place here. It's pretty cute, there's lots of options. I love the vibe of this area. So the coffee that we had at that place was like just okay, but  But the sandwich was pretty darn good. The overall vibe of Byron Bay is extremely touristy, but I get why because it's gorgeous and of course it looks like the surfing is really good. I don't know anything about surfing. I would love to learn one day, but I don't know anything about it. So yeah, it was pretty awesome. Next in the evening we celebrated Nick's sister's birthday and here are some clips of Jackie's birthday and the dinner and spending time with them, which was also really, really great. I, again, I'm just so grateful.  I'm so grateful.  And that pretty much wraps it up for this one I hope you guys liked it if you did Please make sure to like comment subscribe and if you don't know what to comment down below you can leave a lighthouse emoji Not only does that help out my channel a lot it lets me know that you were here it gives us a chance to chat Let's me know you got to the end of the video and of course I'd love to see your faces down there So if you want another way to help out my channel down below there are also links to my merch store my website and my patreon There's zero obligation to check any of those out, but if you want to  You can and of course I appreciate it. Thank you guys so much for watching I love you all so very much, and I will see you next time. Bye Now I realized once we got to the club"
}