{
  "video_id": "RXnNFMU7YGI",
  "transcription": " So last week we went travelling to Rhodes which is in Greece and it was a really really nice break. The weather was beautiful, it was so so hot. We hired a car and sort of explored the island and we managed to get around the whole island which was really cool.  Also, I took a little sketchbook and did some sketching while I was there on the beach and just out and about. So then I'll show you some sketches in here. Okay, so here's my sketchbook from my recent travels in Rhodes. And if you're wondering what this is, that's just sun cream. So that kind of proves that I had it on with me while I went to the beach. So this was a skyline, the view that we had from the beach.  And I just wanted to capture the different colours in the waves here. And then a typical British bloke just came in and just stood in the water. And so I really wanted to capture the way he stands. And this was a view of the skyline from the other direction.  So then we went to the pool one day and I didn't really want to sketch a pool so instead I focused on a holiday maker and it was pretty funny because I'd just drawn all the chair out and the umbrella and then he got up and went for a cocktail so I used the chair and the sun lounger from One Reference and then I actually took a photo of a different man sitting on a different bed in a different place to complete the  the painting because he left. And the same with this, I got halfway through my little unicorn inflatable and then they went and took it home. So both of these pages didn't go so well because my muse on both occasions just left abruptly. So I kind of had to fill in the gaps with my imagination. In the afternoon, the sea went so still and all you saw was just reflections on the water.  I really wanted to capture just the simplicity in my sketchbook so we have two people swimming and just a little bit of reflection in the water. And the flowers were just amazing in Greece. They have these gorgeous cacti which we don't get here in the UK so that was really cool to see. And everywhere we went there was just these beautiful bright fuchsia flowers. The colour was just so happy and it just makes you feel really good.  Again, these are just some more wave paintings and trying to capture the light. Here just a couple of boats pulled up to where we were sunbathing. And I had this idea of like waves turning into birds but it didn't really work out so I kind of just ignore this bit.  This was where we went into Lindos for an evening and it was really beautiful and every little side street looked completely different but so quaint and cute and there were these scooters down every side street and I picked a red one to paint because it was so vibrant and now I really want a scooter.  and we saw this little fruit stall with an old Greek man who was serving and I just really wanted to go and buy some fruit and it was just a really really cool little place so we bought a mango and two nectarines and it was possibly the most expensive fruit I've ever bought  We went here to eat one night which is a little taverna on the beach and you could see all the sunset going on and they had these beautiful orange flowers just in the foreground and it was just so beautiful and we also had some little cat friends come and visit us. I'm guessing they just wanted a bit of my dinner. So they're all my sketches for now. Yeah, I hope that you enjoyed having a quick look at those sketches.  do"
}