{
  "video_id": "S-lGb_lnSuw",
  "transcription": " Alright guys we decided to squeeze in one more hike to see if we can get it done. We're at Fay Canyon. Let's have a look at the map real quick.  Faye Canyon looks like it's one mile in and one mile out. I don't know, it's getting pretty dark. That is the sun right there. So we gotta jam on it. Jam on it. Jam on it. There it is right there. Faye Canyon goes that-a-way. Oh my god, we're crossing the road. No! Okay, Faye Canyon, big tree. Walk this way. Ooh, this is soft.  Soft, soft stuff we're walking on. It's like dust. Like baby powder. Please read. Okay. Don't get busted. And then there's... A fed bear is a dead bear. What about a found bear that finds you? Oof. Anyway. Alright, again, well maintained trail.  One mile in, one mile out. Alright, there's another trail landmark, Dead Tree. So if you want to go to Fay Canyon, look for that Dead Tree. Okay, so we're on the trail. I'm glad all the water's drained out because this really fine sand would turn into the most crappiest mud ever. Most importantly though, it's flat.  So no heart attack ridge for anybody. Very easy. What is this thing right here? Oh. All right, getting deeper into the canyon here. Sweet. All right, here's some of the trail.  And this is about it guys this is about as rough as it's gonna get All right, here's some side canyon wall views for y'all We must almost be getting there because we're getting real close to the side of that mountain right there What do we got here  That looks like two big rocks that fell off the face up there, so it just came tumbling down Yep, so I think the waterfall might be on that side because those views are pretty sweet And we're going that way Hmm All right, so this is the end of the main  Maintained Trail  I'd go for it, but my legs are jelly because I'm old and out of shape But now this is the ending of day three officially We'll see if we feel like doing something on day four, but we're probably gonna pack up and head back home Alright guys. Catch you later"
}