{
  "video_id": "sMlvY8GLKi4",
  "transcription": " Hey everyone, before this video starts I just want to say Dantony has been through a lot of hard moments but these three are the most in his career. This first one involves a pet in a game that's really sad. It's name is Reuben.  I am so mad Rubens the hero and then instantly falls down not on down the hole as well. Okay, where's Ruben? We killed the command blocker. That's good. I'm not ready for this Ruben Ruben Did we do it where's Ruben  Jesse are you all right? We thought you were where's Ruben. I don't even care. Where's Ruben. I don't think he'd made it Ruben. Where's Ruben I thought he was with you what no Guys look my sickness is oh, that's cool. Okay, Petra. I'm so happy for you Hey, hey, please do you guys hear something please oh? No I  I swear do not do this to me Oh no Please no you can't do this  I can't even say anything. No. It's okay boy. I'm here. I'm here. Don't do it. No.  Oh my god. Really?  Really?  The second one involves his fans making a video just to say thanks to Dan. Thank you Dan for being there and for inspiring us and teaching us that it's okay to be silly. Thank you so so much. Hi Dan, after a long day of school I come home and I watch you. No matter what has happened during that day you always make me smile and I can't thank you enough for that. You mean the world to me.  Thank you for being amazing Thank you so much Danny Thank you for always I definitely met you Hey, I really want to thank you for all you've done for everyone and All those millions of people you make happy every day Including me. So thank you for making me laugh every day Thank you for making videos every day just to make other people smile. Hi dad  I've been watching your channel since I was 8. Wait, yeah. Yeah, since I was 8. And I've been a really big fan and I'm part of Team TDM. Thank you for making all these videos. We love them and so does the rest of Team TDM.  I haven't been tweeting. I haven't really said anything to you guys at all and You guys been asking if I'm okay And this is going to be the video explaining why I haven't been doing that over the past few days And what's gonna happen in the future so some of you will know this already, but through social media and stuff, but unfortunately yesterday We had to we had to say goodbye to Peggy. We had to hurt She was never really a well dog anyway So  So yesterday she was just deteriorating really badly and we made the decision to put her to sleep before it got even worse. She was not in pain, she wasn't uncomfortable but if we left her any longer then she would eventually be in pain and very uncomfortable and we didn't want that for her. So when I introduced you to her about a year ago, just under a year ago, we'd already had her for a bit and I didn't even  introduce you to her so soon, like as soon as we got her, because we had her for over a year and nine months. But I didn't introduce you to her straight away because we knew she didn't have a great outlook in life, but we managed to make it so that she could have a good outlook on life. And she managed to last way longer, like a year plus longer than we thought she would in the first place. So we always knew this day would come. We just didn't really know when. And it's come at a weird time as well, because in  in two days time on Tuesday."
}