{
  "video_id": "SNrSuTIzUzk",
  "transcription": " I'm not gonna lie to you. This is the funniest movie of 2018. So let's get into it Crazy rich Asians so first things first as always what the heck is this movie about? So Rachel Chu is living in New York with her boyfriend Nick Young She's an economics professor at NYU and Nick Young is from Singapore His best friend is getting married there and he's like hey  Babe, come with me. We're gonna go to Singapore and we're gonna go to my best friend's wedding. You're gonna meet my family.\" And she's like, babe, sounds good. Let's go. So they go there and it turns out Nick Young and his family practically own Singapore and they are global freaking billionaires and Rachel has to win over his very tight and strict kind of close family. Is she gonna do it? I guess I gotta go see it to find out. So that's the basic synopsis for it. Now we're gonna hop right into those enjoyable moments and  Movie was absolutely hilarious. I haven't laughed that hard in a movie in a long time Like that was labeled a comedy and I was so glad I did cuz I went in with such high expectations cuz I heard nothing but Amazing things about it and for me it really really did live up to all the hype The storyline was fantastic. The characters were amazing the best friend. I wish she was in the entire movie I think everyone talks about her. She made the movie. She every time she came on screen you were laughing and sometimes she say things you're like  and  They lived the life and they're going there she's eating dinner. She's like Rachel is eating dinner with her family. Sorry and then her best friends like so what's the boyfriend's name? She's like, oh Nick Young and they're all eating it all They spit out their food. I said your boyfriend's Nick Young and they're like multi multi millionaires and Rachel's like yeah, and then they're like, oh my god They're like nothing compared to the Young's which was so funny because he's got driving Audi R8s are doing it was like what the F and the Young's are just the high and mighty  They own the world basically so it was just so freaking funny how like everyone's just crazy rich hence the name crazy rich Asians and That was awesome. Everyone is movie was beautiful like every person, you know, like it was good-looking The guys were good-looking the girls were good-looking. I was like, well God, they're crazy rich beautiful Asian That's what we should call it. So that was a little side note in there for you I threw in there and it's one scene in the movie I really want to talk about is when we're at the wedding and  Walking she's the ladies about to walk down the aisle and they dump water down the aisle right and the flowers are floating there and the music all stops it goes completely silent and she's like Brides walking on water. I don't know what it is, but I was like Like literally like that like oh my god, and then the girl was singing I can't help falling in love with you, and then she starts singing no instruments and the lady was walking It was like all in slow motion showing Rachel showing Nick and showing all the characters kind of smiling crying. You're just like  And like Rachel, Nick, and Malie like I love you together And I was like I was literally shell shocked star struggle everyone caught I literally felt like the most iconic scene 2018. That's a poster I want it. I want it. I want I'm gonna tattoo to my back as a mural that shit was dope So definitely my favorite scene in the movie now, I'm gonna get into the flaws. There's only one thing I really had a problem with this in movie and that's the it's just predictable all rom-coms are or rom-coms I call them rom-coms, but  I'm honestly fine with it because it was so funny. It was so heartwarming and it's made you feel good It's a movie you want to see again. It's a movie you took your mom to your dad to your girlfriend your boyfriend Whoever to the movie you go check out some guys Crazy rich Asians is a solid overall 8 out of freaking 10 for me So guys if you've seen a comment down below, let me know your score what you thought of it Who'd your favorite character was or if you hated it? Let me know that too be sure to leave a comment down below and I'll see you guys in the next video. Peace  to smack that thumbs up button and headbutt that subscribe button if you like to headbutt things and I'll see you guys next time so go see a movie and love yourself first cuz that movie camera is the key to life I'll see you guys next time  Just bring me back to yesterday"
}