{
  "video_id": "T82s2BTIEtY",
  "transcription": " Hiking only, no motorized vehicles. Woo! Tabletop Mountain Trail!  Super fun This is a nice maintained trail It's pretty good Now how many stars I'd give it yet But we'll see we'll see depends on how green the vista views are You can clearly see that there was a forest fire here a couple years ago Everything's all burned up  I think I hear the black-beaked kookaburra bird. I'm just kidding. I'm just kidding. There's no such thing as that. Well, I mean, there might be in the world, but not here. It's so quiet out.  Man that's really cool It's only gonna get better Well, we can't dilly-dally too long the mosquitoes will eat us and I don't weigh enough So they'll probably grab me and take me away to the lair Mosquito lair, that's weird. All right. Anyways, there's the tabletop you're going to There's that one too, but that one's a little  Dunt-dunt-dun! Tabletop! I'm gonna lay a little bit further. I'm kinda... I'm kinda glad this trail's here. It's making it so much easier. I think that's a trail? Well, stick to the light-colored stuff, I guess. Sounds good to me. Oh, it's gonna look beautiful!  Such a nice day, too. Alrighty, now we're gonna go up over this on top of Tabletop Mountain! Oh, that's badass. That's cool.  Nome Valley? No, Nome Creek. Yeah, sure, Nome Valley. Okay, so I know I'm doing the Tabletop Mountain Trail, but I went to the top and now  As you can see there's no more trail. But I was an idiot and went back on the opposite side of the mountain. So now we're bushwhacking. Bushwhacking. It's nice out though. A little windy but not too bad. Alrighty and now we're headed back down to the car.  No, go away.  Anyways, but yep, this is a White Mountains and we are down now. We're headed back down towards Nome Creek, which Which I don't know maybe like 1920s or 30s there was a Big old Yuba dredge out here dredging up Nome Creek. They did pretty well and then it burned down so now if you walk through the  Valley and near the creek all the valley drainage and all that you can find pieces of the old dredge and they say you can find really nice buckets but they're buried deep and you can't take them so don't try  you"
}