{
  "video_id": "TBLQfH6-aSs",
  "transcription": " Hey, right here, let's go, bring it up. Listen, okay, we have to be better than yesterday. It starts in the weight room. Okay, get a break, we're jogging down there. Okay, get ready to work. Do you understand me? Yes, sir. Here we go. Get a break. I am. All in. I am. All in. I am. All in. We are. Family. Let's go, jog it down. Time to clock in, fellas.  Some of the tradition here at Huntington Beach High School, obviously Tony Gonzalez played here. He's the greatest tight end arguably ever. Let's get a break. Good start. We got to finish today. Here we go. Work hard all day. Let's go. Win on three. One, two, three. Win!  Couple things and then we're going to break off. You're going to go to where you were yesterday. I know it's hot, but guess what? It's hotter in Irvine. It's hotter at Western than it is here. So there should be no excuses. You understand that? Our number one goal every day, especially today, has got to be to get better. So when you go in your film room right now with your coach, learn from your mistakes and fix them.  You got that? Let's go ahead and break off. Your stance is a little high. You see, when you're high, right, we're lunging, we're reaching. We don't need to be reaching with two hands and lunging. Just put yourself in a good spot. Bend your knees, be in a good stance. That's the mentality this year. Big Bank take Little Bank. Ring season. Heard it first here. It's this man's birthday right here. He's 18.  We don't have a huge team numbers wise. So we have a lot of players, a lot of skilled players, but almost everybody's playing on both sides of the ball. So our biggest issue is going to be staying healthy, making sure we're in great shape so we can play four quarters of every football game. To be an oiler, we have this thing called win, which means work hard, integrity and no excuses. That's the code we live by.  live by as Oiler football is my favorite part of th go out and hit, have fun being physical and having a pride drill right here. a defensive guy and an of on each side of the bag. is going to have his hands he picks up the ball, he or left. He's got to go a defensive guy is going to  Let's go. Pick up the energy. Let's go. Good. Attaboy, Farron. That a way to finish a run? Good job. Drive, drive, drive, drive, drive, drive. Attaboy, Farron. Oh, and he got it. Get on it. Get down. Drive, drive, drive, drive, drive, drive. Here we go. Let's go.  The pride drill, sometimes it's kind of unfair, you know. Good. Nice catch, Eric. Eric McLaurier, number two for us, does everything. I mean, he's a tremendous athlete. He's being recruited by a bunch of schools. This will be his fourth year on varsity. Jeremiah Flanagan's number one.  He's number one for us. He's long. He's 6'4\", 180 pounds. And he's the kind of defensive player, a corner that college football coaches are looking for these days. He's just super athletic. Big play potential for us. I want to go unbeaten preseason, take a league this year, go see IF. Do you think you have the ability to do that? Oh yeah, we got a good team this year. Good. Good. There we go.  Christian Moore, number 15 for us. He's a big, physical, tough kid. He'll play tight end for us, play linebacker. We kind of move him around. For us, he's going to kind of be like a, we envision him as a Gronkowski type player. You know, he could be a fullback, a tight end. We can widen him out, split him out. So we're going to use him in a lot of different ways offensively. And then defensively, he'll be one of our enforcer type guys.  We got six 20-yard sprints. Everything you got. We got six of them. Here we go on the whistle. Ready, set, go. Go. Go. Get out and run. If we want to play 15 games, we got to get in shape. Got two left if they're good. Oilers on go. Go.  Jugging it, let's go. We learned from yesterday. We made some adjustments. We learned how to play in pads a little bit. I saw guys coming up making tackles over there, guys catching the ball in traffic and finishing runs. I like it.  not good enough. It's not good enough to be good just today. Not one day, right? We got to go the whole time tomorrow, the next day, the next day, the day after that. Continue to get a little bit better every day. You understand that? Yes, sir. Great job. Here we go. Bring it up. Give it to your position coaches before you leave. Back here at two o'clock tomorrow. Get it, James. I am! All in! I am! All in! I am! All in! We are! Family! Woo!  Yes sir. Here we go."
}