{
  "video_id": "TD2By_m9cCg",
  "transcription": " Nowadays, it seems like all rappers ever talk about is how much better they are than everyone else. Whatever happened to modesty? Manners? It's time to introduce polite rap.  I'm an average man, you lady killer, you handsome lad, you devil, you, you rascal, you've stolen every girl that I've had. Oh don't lie sir, you've got game, your dancing moves put me to shame, like the wheelchair roll and the Amish shuffle, you can have a lot of fun and stay out of trouble. Oh stop that, you make me blush, you're too much a gentleman, you've got more class than a teacher, and you've got more swaggies than a beaver. Well thanks friend, you're great at like, everything you do at life, I just wanna know, what's your secret, cause whatever you're doing, you're doing it right.  I said hey it's nice to meet ya, I'd like to shake your hand and greet ya, I admire all your features, polite, polite, polite, yeah, yeah, we're polite, polite, polite, yeah, yeah, alright now stop, hold up, you're too kind, you don't really need to be all that nice, no you stop, hold up, fine, you don't really need to be all that nice, hey yeah we're polite, we're the type of guys that you wanna meet, but not just to each other, let's take it to the street, hey girl your shoes are nice,  Your hair's tight, your candy sweet Your smile's brighter than sunshine Your laugh makes my heart beat Sup brethren, love your flow Fresh kicks, you're good to go Bump knocks, classic bro Your swag's got me all jealous though What I do to be this guy Professional and classy too Big and strong from head to toe I'm Tiny Tim, your Goku Greetings darlin', how ya doin'? Flyer land, that Michael Phelps My heart's runnin' like Usain Bolt Runnin' shoes on, that always helps Girl, no kiddin', I love your eyes More beautiful  than anything and that right there's some lucky guy that gave you that big wedding ring. Bro, how's it hangin'? Can we trade lives? What you say? If I was half as cool as you, I wouldn't make YouTube vids all day, huh?  Compliments Your beard is a beast I wish I could grow a facial hair  tonight cause we're living the thug life"
}