{
  "video_id": "tDMu9cy-Uag",
  "transcription": " We were oozing sooooud  I'm not even gonna lie  He had the game of his life. Let's talk him career at least just know man of the match performance between him and mini Esther Harry Winkerbell He was oozing pixie dust when he came on trust me after seeing our starting lineup our bench was looking dench fam Son Aldo Sony Ericsson Peli Alidino I was thinking why are they on a bench unless Lord Levy's got them all in the back finalizing new deals What's going on? We need them to start as for re the last game. He played he was man of the match for me He got injured and ever since then he's been on the bench Forrest Gump  Don't get me wrong, Whippy is my guy, Barry Beckham and all that. But you put him up against a man with Paceblood and the way he pushes up, he's letting in more plays than the Kardashians fam. I'm telling you, Maurice, if you're gonna play him, you need to give him a curfew. He needs to come back home. Even their goal, even the NFL lines were disturbing trips. Or Sterling gave him that utterly barterly, had him on toast. It's like Raheem Sterling had a restraining order against Trippier. Cause Trippier couldn't get anywhere near him. Man checkbox City with a Marres goal and three points.  And I'm not even gonna lie, we had a couple chances where we could have stole something. Especially at the end, the ball was bouncing like a chick from MC Hammer fam, through to Eric LeMessie and he skied it! Don't get me wrong, we out pepper our intervals through that game and City had a better of the chances. But between Harry Clarset and Eric LeMessie, we should have certainly scored! But to be honest, it don't even matter because Silicone FC had more than enough on their bench, blad. I didn't see Sané on the pitch, fam. Jesus, De Bruyne, I was seeing more stars than Rihanna after Chris Pratt and Pogba.  that working on her blood is peak! Even on that pitch, City were producing triangles fam. As for us, Moosa Sissoltrain had a Moosa Sissolid game! I don't know if them mans used to play football on rocks or something but that's the best performance I've seen in a Tottenham shirt, ever! City scored in the first five minutes, Stirling vs Trippier and that goal took me back to them playground days. You know when a mans running past you and you can catch him but you're wearing them trousers that your mum told you not to rip, lad? You let man pass you, they score, all your bread will start taking the mitt but you  And then City started attacking us  Second off, we were playing a lot better and I told you our bench was strong. But when it came to substitutions, it's like Maurice was waiting for Brexit fam. I would have made changes a lot sooner, especially with the players we had on the bench. But it brought on Winks, Pelly and Sony, eventually. But Spurs were unable to equalise, even when Pelly came on and he sliced the ball through to Eric Lemessie. Oh my days, bruv. That shot definitely made Sky news. So Spurs lose to City, three points down and we got to address two things. We need to get a gardener in at Wembley.  and we need to bounce back against Wolves. Come on Newspaper. In fact, we need to beat West Ham too, bruv. You get me? Because if we ain't winning this Premier League, I'll take the Carabao Cup, fam. Just know."
}