{
  "video_id": "TglHaI_7mEY",
  "transcription": " We're very, very lucky to have Coach Chun coaching the Singapore team.  And she's an Olympic champion, four-time gold medalist. We remember this woman as the queen of short track skating. Coach John is amazing. She is a mentor. Another gold medal dreamed by the short track legend. Her story begins now.  Lucas Ning  before the World Cup started brought me to another level where I managed to get a personal best for one of my distance by six seconds. Okay, next set. Two left, five times, three sets. Watch out, Brendan! The skaters have undergone significant changes while training with Coach Chun over the past year.  I never thought I would have to work again.  The athletes were confused and at times discouraged by the kind of training they had never received before.  This was Chun's strategy to make up for the shortage of skating rinks. Because of the lack of interest in winter sports and insufficient funding, the national team can only train no more than twice a week. To make matters worse, the ice rink is in poor condition.  Chun's meticulous and attentive coaching style has inspired the athlete's parents to develop more interest in skating.  Trevor Tan is a junior skater being trained by Chan. He has been dreaming of becoming a short track star by watching his coach's competition.  becoming athletes because education is a top priority in the city-state. Trevor's parents also felt that way. But since Trevor began to receive training from Coach Chun, they decided to support him with all their might.  to the kids, the Singapore kids. Singaporean skaters now have high goals. Lucas has come to Korea to train for the Winter Olympics. To him, Korea is a country that inspired him to dream of an Olympic gold medal and a land of hope where he can turn his dream into a reality.  A growing number of skaters visit Korea every year to learn winter sports like Lucas. The Pyeongchang Winter Olympics will probably serve as a big turning point. Lucas's dream is being a part of that special time. My current goal is to do my best and train as hard as I can and possibly qualify for Pyeongchang Olympics in 2018.  Anyone can participate in the Olympics. If it's possible, I hope it will be the PyeongChang Olympics.  It's huge!  hard despite the sweltering heat year-round, will receive a chance to see the beautiful nights of Pyeongchang. The fifth gold medal pursued by the four-time Olympic gold medalist is more than special.  I think I'll be very proud and it'll be a big gift for them."
}