{
  "video_id": "Ti367kD7LQ8",
  "transcription": " Hey gang, I've had some people wanting me to do a walk around of the Jeep so let's take it over to the shop and when we get there we'll do a little walk around.  so  I  painted about 12 years ago so actually the oxidized beautiful oxidization that it has on it acting kind of like a protectant for it. Toolbox mounted with my tools, got my off-road driving lights, it's got factory flares on it. This is a Renegade. A little bit of rust on each of the quarters on  the sides but from here back nothing but glass fiberglass tub fiberglass body 1978 Jeep CJ5 you know foot file seat comes all the way forward I do have the back seat for it right now I've got this locked down to the body of the Jeep to keep some other stuff in there off-road stuff one gas can I got to pick up  I  Similar to the barrel LEDs. Come in flush. And mount them with the stainless screws. We'll get back here a little bit, take a look at the whole thing. Not a bad looking Jeep. 1978 CJ5. It's got less than 50,000 miles on it all together. Stock suspension, bone stock suspension with worn auto locks on the front.  I'm sorry about that. I do have a stabilizer underneath there.  loose but it steers so easy that I wanted a little bit of resistance against the steering wheel just to keep oversteer down a little bit. But there she is, new interior, new vinyl. Nothing real special about her except she was a fully optioned for, her name's Calamity Jane by the way, she was fully optioned for 1978 which meant you got a clock  And there's the clock. You got full instruments. You got a tilt wheel. And yes, these are Craftsman handles that I put on here. The glue hasn't completely dried on the tilt yet. But, a tilt wheel was an option. And it has a 304 V8 with a 3-speed. And she ain't pretty.  These old jeeps mark their territory.  I  down the road. Really there's not a whole lot more to say. I put a quick detach steering wheel in there. It's a safety steering wheel so once I remove it I put this cap on and then I lock the steering wheel in. Take battery jump wire over to the, I'm not going to tell you, but they're really easy to hot wire and take off.  So see a lot of this work on it is stainless steel. In fact, everything all the attaching hardware There's some engine turn Steering or stainless steel Mirrors are stainless. Of course the handles already mentioned those front hinges for the windshield the hood hinges cowl The windshield stops  The windshield strap bracket.  Dove is the cover here. It does have a full top and soft doors. Soft top. Both are in real good shape. As well as a Bimini bikini top. You can get them that stop at the roll bar or you can get them that come... Let's see if I can get perspective here. You can get them that come all the way to the back. And mine comes all the way to the back. It can be strapped down to lay  on the rear of the roll bar but there's no clear plastic in it to use as a means to see behind you so you got to rely on mirrors. That's about it. She's just a fun little puddle jumper. Certainly came in handy this winter to get around in. So we got about eight and a half minutes that's long enough babbling about this  silly thing but there you go thank you guys for your interest in calamity Jane there you got her front and back. Zippo later, I'm out!"
}