{
  "video_id": "Tu8o0UZYOos",
  "transcription": " Hey guys, welcome back to my channel. Today's video is going to be a really fun video and I am inducing my labor naturally at home. So I wanted to share with you guys some of the stuff that I've been doing to hopefully get me into labor within the next couple of days. So first, we have been doing a lot of walking. I've been taking Max and Louie and obviously Lisa on walks with me every single day just to help speed things up.  up.  actually craving wings so I sent Ulises to take to bring me some wings from a wing stop and he ordered the hottest buffalo wings that Wingstop has. They did have a really nice kick to them they weren't super super hot or anything like that but I'm really hoping that this will definitely do the trick.  So for my third recommendation we will get a yoga ball this was a little bit big for my height I think this is for like somebody who's like six feet. So it's a little big I do start off by doing some squats. Obviously, I don't do squats like this. Let's try to apparently be funny and I do squats for at least  30 minutes or so just kind of giving you guys an idea and then I do bounce on the ball for at least an hour a day I just put on like one of my favorite shows if you want to watch a novella you want to watch little sidewall a little bit You know, whatever you guys want to watch just put it on TV and it will make the time go by a lot faster So you can bounce on the ball for at least an hour So for number four this is actually one of my favorite because  I love pineapple. Pineapple and mangoes are probably one of my favorite fruits and I actually have been eating pineapple throughout my whole pregnancy. I have honestly just been eating it a lot more excessively this time around. I probably ate like a whole pineapple by myself this day. I just heard that pineapple is probably like the best thing you can do to soften up your cervix. So I have been consuming a lot, a lot of pineapple.  be a part of everything I'm eating. So sometime throughout my day I will get some raspberry leaf tea and I will either heat up some water or through my filter just mix some hot and cold water to mix in my tea and honestly it tastes pretty good. It doesn't taste bad at all. I was a little skeptical about trying it at first but everybody was recommending this. They were telling me how much they loved it. A lot of people use it for even menstrual cycle.  the  next one can be done even if you're not pregnant this is just something that's definitely going to put you in such a relaxing state of mind your body is going to thank you later for this but jumping in to a nice warm bath is probably one of the best things you can do I was so relaxed this day I just popped in one of my audiobooks and kind of scrolled through my phone and just relaxed enjoyed the moment and honestly  I got out of my bath, I just felt like my whole body felt so light. I felt like so many years were just taken out of my life. So if you're not even pregnant, this is something you should definitely do. But I am trying to take baths at least every night for the next couple of days to just help my body relax. Now, last but not least, you know, I had to save the best for last. And this is having a lot, a lot of fun.  of sex. So we all know you know not everything is peaches and cream when you're pregnant but just making that effort to just try to open up that cervix is all we need so enjoy!  you"
}