{
  "video_id": "TwcvEnM8B3M",
  "transcription": " Whoa! Mr. Terry Crews! How are you? How are you? And your name is? Ra Ed. Ra Ed. All right. You look taller on TV. Yeah, I thought I was. My name is Ra Ed, and I'm a singer. I've always been eccentric. I'm the youngest of three boys in our family. And one's a doctor, one's a finance businessman, and then there was me. I love being center of attention. So do you have a team that helps you with this? I have Marco, my lovely assistant.  He makes all of this also possible. And you. When I was nine years old, I saw the three tenors on TV, and I started mimicking them. And my mother heard me, and she said, I think you might have talent. So I decided to take my singing to the next level. I went to college for singing, undergraduate, then master's. And I realized that not everybody can do what I can do. You know what would look amazing with this outfit?  confetti falling from the ceiling. Give it to him, Rahed. Thank you. Woo! That's a big, beautiful buzzer. That was an amazing performance.  Entrance Did I underdress for the show not today trust me, okay, so let's start with your name, please My name is raw ed. There's an apostrophe in the middle of my name. Okay Lebanese. It means the leader lieutenant general It's my given name. I can't help it. And what is your job? Do you know those convertible buses on Hollywood Boulevard that take? Celebrity home tours for the tourists. Yep. I drive those buses and I sing for my customers  And you normally get a good response from your passengers when you sing? They love me and if you're watching, I'm on TV guys! Do you have any pets? My apartment doesn't allow me to have pets but I love dogs, I want like three. I could feel your energy which is why I asked because I felt that you would love animals. I feel your energy too Simon. I love energy! Okay, we've connected. Good luck. Thank you.  An original for you tonight. Oh, you wrote the song you heard this song. I wrote this song. What's it called? It's called celebration. Okay, what's that? It's about you know when an artist they work so hard and finally they get a platform to be able to perform This is a celebration  I've been searching  Here's my mother.  My love, a fearless jewel. I love you.  If you guys want to click below, subscribe and watch away."
}