{
  "video_id": "U0Xg-QFdVSA",
  "transcription": " Alrighty guys, today I'm going to be talking about case savers alright. So I've got my DRZ400E and I wanted to buy some case savers for it just to protect the side of the engine. At first I got these cheap ones just off of eBay. It was 20 bucks I think and they're just made of aluminium.  They're nice and light, they are quite thin. There's the other one there. And at first I thought, you know, you could buy five of these for the price that you could get one pair of B&B case savers. But after I thought that I was also thinking the fact that, you know, it's not something you want to want to replace. It's not like an LED light where you're just going to  buy a new one and chuck it on. If you're going to have to replace it, apart from maybe it being a bit scratched, chances are it could have also damaged your engine. So I thought I'd buy these B&B ones. These were $100. I also got them off eBay, but they are the genuine B&B off-road case savers. These are a bit thicker, also a lot shinier. I'll get the other side here as well.  the other side of the B&B ones. So I'll just get them up. Put them side by side. So the B&B ones are a bit smaller. You can actually fit it inside the other ones so they don't cover as much as the surface area. But it might give it a cleaner look, I'm not too sure. But there's the difference in thickness.  If you can see that But yeah, today I'm going to be putting the B&B case savers on my DRZ Alrighty, so first things first You want to clean That as much as possible come around the other side I'm gonna clean that very well as well. Probably first using a soap and then use some alcohol on it  Alrighty, once your case is nice and clean you're gonna use some sealant. So I've got one here 3 Bond super sealant number one grey. It's good for your  gear covers, oil pans and that sort of stuff so it's a high temp RTV silicone. So once you've opened up your silicone, chop the top off of it, you're gonna put it on your case saver. Thicker in the middle and thinner towards the edges. You want to spread it all around quite evenly.  And if you're particular like me I'll probably use my finger and spread it right around. Just keeping sure to keep it quite thin around the edge.  that's what it's like can't get it perfect but I'm pretty sure that'll be enough  and just to stop it from moving while it dries put some tape over it  Alrighty, so after about 24 hours of the silicon being on there, pulled off the tape, given it a bit of a polish, looking schmeck. See if I can get around the other side.  Looks good."
}