{
  "video_id": "U9SraX8Z1m8",
  "transcription": " It's moving day!  What?  But I'm going to make it up to you. Here's a quick rundown of what my week was like being girlfriend-less and how I did welcome Savannah back to the States. So this was me being busy and productive while Savannah was away. And this is me waiting at the airport with a sign and some flowers. And this is somebody else with a sign showing me up because he decided to propose to his girlfriend  who happened to be on the same flight. Mazel Tov! Sure. But our reunion was still nice, albeit a little short-lived. We both had to leave the airport immediately and go home because it was Sunday night after 11 p.m. and we both had work and school to do.  next morning. Like I said, super busy. But I am back like I said and I am ready to make some more entertaining videos to entertain you all 15 of my wonderful subscribers. And what better way to show forward movement than with a moving episode.  Now being the strong masculine boyfriend that I am I of course did most of the heavy lifting Savannah might have helped a little bit  I don't need any help. At least I think she helped. I can't do it. I just have to take a break. Can you help me?  You're doing it I know she did something Why aren't you helping I Think she straightened up the boxes that I brought in  Woo woo! Downtime is cleanup time. You got time to lean, you got time to clean. Heck, maybe I was the only one doing any work that day. Hey, I want to grab a couple more boxes. Union break. How long are you going to be in there? Union break.  her apartment had a few issues. Namely, everything in the apartment seemed to be a little crooked. So I took it upon myself to fix some of it.  getting all of this done in one day. And now she is completely moved in and loving being on her own for the very first time. Unfortunately, that's all I've got for this week. Like I said, I've been busy. But I've got a lot of new stuff in the works and I promise it is only going to get better from here. I'm really enjoying this new hobby and I'm getting better and better with each passing episode and I'm super excited to have you guys along for the ride. As always, please leave a comment below letting me know what you thought about the video.  moving stories that you'd like to tell, or maybe something that your significant other just refuses to do or won't let you do for fun. Lastly, I really want to see how far I can take this channel, but I can't do it without your help. If you haven't already subscribed to my channel, please do that now. It's right down there. Hit the subscribe button. And if you do watch and like these videos, it would go a really long way if you would share these on your other social media pages. Facebook, Twitter, you name it. Anything to help get the word out so that other people can see 1010 Good Boyfriend 2.  Alright, I am done rambling now. I will see you all next week. Take care."
}