{
  "video_id": "Uaa-Mz84vC8",
  "transcription": " Hi everyone, welcome back to my channel I'm Nebuchadnezz and as you can tell from the title I'm going to be showing you how I laid this synthetic lace front wig. Just a disclaimer I am NOT a pro. This is just how I lay my wigs. If you would like to know the details on this wig I'll be sure to leave that down in the description box below.  Also, be sure to hit that subscribe button and if you would like to see how I achieve this look, keep watching. Excuse how I'm looking, but as you can see I'm going in with this Got2b glue gel, the clear gel, and I'm going to apply that starting from where my hairline is and I'm just going to apply that all over to make sure, you know, my wig will stay secured.  White Got2B Goo Gel  I'm just going to fan it with my Morphe palette and right now I'm about to cut off the excess cap so you know it won't show when I put on my wig.  Okay, so after I cut the front part of my lace I am applying my wig it came in 24 inches I believe and if you want to know the rest of the details on this wig be sure to check the description box down below  So what I did was I put the wig on my head and I'm about to go in with the clear got2b goo gel and I'm just going to apply that again on the perimeter or on the front part of my head where my hairline starts. I'm going to do two layers of that and make sure it dries. Not dry fully but you know it gets tacky and then I stick my wig on.  You  Okay, after I secured the wig, I just pulled out my baby hair  You can style it however you like. I just feel like you know, it looks better with baby hairs on my head. So yeah  Okay, so now I'm just cutting my baby hair shorter, so you know baby hairs aren't long They are short. You know just little hairs in the front, so I'm cutting them shorter, so they will lay better I'm not really going to go into depth about how I do my baby hairs because it's kind of pretty simple  self-explanatory but yeah and then I'm gonna go in with the got2b glue gel the clear gel and I'm just gonna lay my baby hairs with that so they'll be laid all mother f***ing day  do  Like I said earlier the wig was 24 or 22 inches and I cut it shorter and right here I'm just you know trying to show you but clearly it was not working out  but yeah it's like a little bit below my boob but yeah this is all for the video I hope you all enjoyed it be sure to like subscribe and leave your comments down below and I'll see you guys in my next video bye"
}