{
  "video_id": "UC0qJSuJM0o",
  "transcription": " How do you feel Easton? Gonna poop. It's gonna smell so bad. Think so? How bad? I know so. Scale of 1 to 10, how bad? Probably 110. I love that everyone gets a plate. Is this family dinner? It's a lake of a table. Yeah, it's a table cart.  You stokedy? No. No? Yes, but no. Good? You feel good about eating that? Are you serious? It can't be that bad. How do you feel about this Emma? I'm excited.  I'm not eating it. I'm not eating it. I'm not eating it. I'm not eating it. I'm not eating it. I'm not eating it. I'm not eating it. I'm not eating it. I'm not eating it. I'm not eating it. I'm not eating it. I'm not eating it. I'm not eating it. I'm not eating it. I'm not eating it. I'm not eating it. I'm not eating it. I'm not eating it. I'm not eating it. I'm not eating it. I'm not eating it. I'm not eating it. I'm not eating it. I'm not eating it. I'm not eating it. I'm not eating it. I'm not eating it. I'm not eating it. I'm not eating it. I'm not eating it. I'm not eating it. I'm not eating it. I'm not eating it. I'm not eating it. I'm not eating it. I'm not eating it. I'm not eating it. I'm not eating it. I'm not eating it. I'm not eating it. I'm not eating it. I'm not eating it. I'm not eating it. I'm not eating it. I'm not eating it. I'm not eating it. I'm not eating it. I'm not eating it. I'm not eating it. I'm not eating it. I'm not eating it. I'm not eating it. I'm not eating it. I'm not eating it. I'm not eating it. I'm not eating it. I'm not eating it. I'm not eating it. I'm not eating it. I'm not eating it. I'm not eating it. I'm not eating it. I'm not eating it. I'm not eating it. I'm not eating it. I'm not eating it. I'm not eating it. I'm not eating it. I'm not eating it. I'm not eating it. I'm not eating it. I'm not eating it. I'm not eating it. I'm not eating it.  Yummy! If you come over here you can smell it. Wait, why am I doing this?  Hey  That is not fair. Okay. Are you guys ready? On your mark, get set, go.  How was it Emma? Really? That good, huh? How do you feel? Worth it. Worth it? Way worth it.  I'm not getting dunked. And now, I smell like, just for a daily. What is that smell? I don't know what it is. Did you smell that? No. Is it still on your hands? I got a bone pack. I don't know what that smell is. I smell like fish bait. That was so bad.  Well now the egg can smell. It smells like what our garbage can smelled like the other day."
}