{
  "video_id": "uMN8fzfeueY",
  "transcription": " You are watching your Fast Life Motorcycle channel. This is your Fast Life Motorcycle channel and this is the brand new bike from Ducati. I'm showing you a lot of the new bikes right here in your Fast Life Motorcycle channel.  go to my main channel page and take a look at all the awesome new motorcycles. Right now, let's take a look at this new bike from Ducati. Ladies and gentlemen, the 959 Panigale with a very special guest again, Davide Giuliano. Davide. So... Hey Claudio.  I thought that today was the first time you were back on the motorcycle after a long time. So this midsize sports motorcycle offer improvement in engine design and details. Engine, again, as the name speaks for itself, will increase the capacity. And again,  almost 160 horsepower, 157, but very similar to the Hypermortard, almost 10% more torque, which will make the bike very nice to ride on the road. Number of components have been updated, because, for example, the whole bodywork and mirrors comes from the big sister, the 1299 Panigale, that, as most of you know, have been updated in terms of design, actually this year. The bike, as you see,  has been also updated to the new Euro 4 homologation. So the exhaust system is very different from what it was before. Some details have been changed, like the footpegs that are machined from the billet, or the swinging arm pivot that reflect the idea of trying to improve every detail, even listening to what customer and what you, Fan and Ducatisti, are telling us.  So, a balanced product of performance, style, ergonomics, and a note coming to almost the end of the presentation of the product, the bike will be available from a very specific market with the exhaust which is under the engine, the typical Panigale style. For all the market anyway, will be available a very unique set of accessories, one of which being for the first time  a fully homologated titanium side exhaust that will make a very beautiful shining on the motorcycle. We made already a presentation of a lot of products. So, two scramblers, the Pikes Peak, the Hyper, and the 959 Panigale. And we are now ready to enter into the third  two major big news of the show. And when I mean big, they're really big because it's a departure for our brand from the territory in which we feel normally comfortable. The first one of which is a product that you start thinking when you start considering long distance, made of road that may be paved  or  Diavel, the X Diavel, the BMW ERR electric motorcycle, the Suzuki SV650, the Yamaha MT-10 Street Fighter, and even a naked lady! If you're a pervert!  Yay yay!"
}