{
  "video_id": "uMWftJGDvGA",
  "transcription": " She's just very... She's just one of the most positive people you'll ever meet. I love volleyball.  I didn't know in high school whether I wanted to play volleyball or basketball and so I just kind of ended up deciding my senior year that I wanted to pursue a career in volleyball. I'm not a person that can sit and do a desk job and I can't like do the same thing every day and I think each day that a kid comes in and they have a different story or they're feeling a different attitude or whatever I think that just makes it worth it and just like the best place to be.  She exemplifies what we want all our head coaches to have and all of our coaches period. And that's a positive atmosphere, a positive attitude and then great relationship with the kids. She loves kids, she loves coaching, loves teaching, she does a great job in the classroom. And we're just thrilled to death she's ours. She's just very enthusiastic and energetic. I guess every sport is a momentum kind of game where like if you're the excited team, you're probably going to have the upper hand. So just like getting us all like pumped and excited and confident.  I'm a classic positive person. So I knew in my head what I wanted the program to look like and to be about. And so I just kind of want every kid to have a good experience and to come out a better volleyball player and just a person overall. I think being in a district with Prosper and Lovejoy that amps up our kids to compete and definitely since Lovejoy is the returning state champ,  a little more motivation to bust it and dish it and get it done. So I definitely think we have our eye on the whole state prize. That's where we're pushing for. I love McKinney ISD. That's cheesy, I know, but we have an amazing booster club that supports us like crazy and the kids are awesome. In a game, when you're down, having that person who's always going to talk you up and cheer you on, that's always good to have.  We really are truly a part of a family here."
}