{
  "video_id": "Up22LbG0eHU",
  "transcription": " I  Good morning pretty girl. Look at your little bathing suit. You look pretty. You got little flamingos. How do you feel? Yeah? You ready to go swim? Dude, it feels nice. You ready to go swimming? Your first pool? Talk to me mama.  You don't want to talk? You don't want to talk? Good morning everyone! What a long day we had yesterday. How do you feel this morning? Refreshed. We're gonna head to the pool right now, get some breakfast. And I think we're gonna be lazy today just by the pool. Later. Later dinner. In Ulsan I wanna think.  We're gonna be shooting differently today so hopefully the video might be looking a little different. Yeah. Hey beautiful. Mama? Hi. Madison? We keep going to the hotel that's right? It's raining now right?  So we were supposed to go to the pool, got to the pool and felt some drops. Now it's raining. She's still asleep?  I should have went to the pool without you this morning. Were you asleep? No. Come back? What happened? Nothing. Why do you smell like chlorine? Me? Chlorine? Huh?  I need some sun. I need sun. You got sun this summer. I didn't. I didn't get no sun this summer. What are you eating next?  So the rain finally stopped My shades, where are they? My shades are upstairs? My shades are upstairs? My shades... Your shades are upstairs. Damn it. Like I said, the rain finally stopped. The baby's being a little fussy though. She's tired. Was at the casino for a bit. And, oh, it's super bright out here. Baby's hasn't had a nap.  Super fussy  Madison's first pool day. One more please. In the water. Madison say hi mama. She's touching the water. You're touching the water? You like the water? Hi mommy. You like the water? Hi guys.  Madison say hi YouTube  Hi beautiful girl. Hi beautiful. Hi beautiful. So I'm trying to fly the drone from the balcony of the hotel and this comes up. It says, cannot take off. I guess we're way too close to the airport. Like I said, the airport's right next to us. Not letting me take off. That sucks. Madison, I'm vlogging.  I"
}