{
  "video_id": "UqBQqY1g-ps",
  "transcription": " Here the traditional start only Formula One cars start on the level with a hairpin in front of them. Everybody else has to measure their pace at the start and rush headlong into Eau Rouge. The field is almost completely in place. The Fords and the Peugeot arrive at the back of the grid. The revs rise. We're ready for round 11 of the World Touring Car Championship for Spa-Francorchamps. The red lights are on. Watch for the BMWs. Away they go. Andy Priot, Dirk Muller, Jürg Muller.  all going to try and pass Augusto Farfus into Eau Rouge. Prio will get the lead for the eight laps of Spa-Francorchamps that stand between him and perhaps victory in round 11. But already the SEAT facing backwards and going off. That is Ricard Rydel pushed sideways, but just avoiding the barriers from his seventh, ninth starting position. Prio leads them up the hill, but Farfus tucked in behind. And that's a very big hole in the air that Prio is giving Dirk Muller out wide, trying to come around.  the outside of the Brazilian can't do it. Farfus was resolute in pushing rivals off onto the grass up the hill last year and he is defensive of his second position. Priot's got the break he wants. David Leslie, Farfus, if he defends against Dirk and Jürg Müller, is just giving the race to Andy Priot. Yeah, he is, but the Alfa Romeo there is coming up. Another Alfa Romeo, that looks like Tarquini, now up into fourth place. And ah, that was the incident, that looks like Jeunet. That is a Ford Focus upside down.  FUNK  further around the lap as well. And that, as you see, David, the Alfa's getting up there. Oh, and into the barriers, he went running out very wide at Lecom. I've never seen anybody roll so dramatically there. He just climbed the barriers on the outside. Yeah, he just got himself onto the outside. I think it was everyone was trying to push and pull for their own position going through that chicane there, which they always do. And he just simply got himself onto the grass. Once on the grass, he didn't have the steering. He just into the barrier on the outside.  and that was the end of it. Downhill start here we see. Now the BMWs didn't have such a big advantage because of the downhill start. It did help the front-wheel drive cars rolling down that hill. One of the Chevrolets make a very bad start there. Got something wrong towards the back there, but only one BMW got there. But as it came up to the top of there, we see further back the BMWs coming past the front-wheel drive cars further back. But we get to the top here, we did see a Seat spinning around. I think that was Jordi Janier. There it goes. And that looks like the first of the Seats. That would have been Jordi Janier.  and he seemed to spin and get going again. So, off the start line here from inside Fafa's car, you can see Prigogneau just get that there and away he goes. And this is what happened. Now, Genet was the best place, but... And it does look like Genet, definitely. And Roberto Colciago, the man who was unfaithful, yes, nearly three Seats being wiped out there as Pluto and Rydell got alongside Genet. That's why Rydell was coming on so slowly, because he basically had  to come to a halt to avoid his teammate. Roberto Colciago, the man who was stuck up the back of the Genet SEAT there, but I'm not sure that it was him that actually did the rubbing. And there the replay of Michel Funke. Well, the Ford's all at sea in terms of performance, over five seconds slower than Pol, but the car, well, I'm not sure that'll be in race 12, frankly. I don't think there's much time to repair that. So... They're not going to get that car back. That car will be left out on the circuit.  the weekend."
}