{
  "video_id": "Uu1mGBeAQPg",
  "transcription": " I don't even know where to start with this Last night  Last night I don't predict what happened And I didn't think I'd be sharing it with you guys but I mean If you guys haven't already saw if you guys don't follow me on Instagram you haven't seen the photos that I've posted I'll put them right here Yeah  I've been wanting to get that car for over 2 years. People that have been following me for a while know how much that car has been through to me. So anyone that doesn't follow me on Instagram, I'm assuming that you haven't seen the photos. I'm just gonna come on here to announce it a little more. Last night, my buddy Alton that let me borrow his rollers needed them back.  and I found a really good deal on some stock wheels. It was probably like 7, 8 when I left. Got there around 8.45 and everything went smooth. Picked up the wheels, you know. Alton was there with me so he could take his wheels. Quickly swapped it over and went about my day.  I'm sorry guys, this just sucks So pretty much anyone asking me what happened someone ran a red light I Was turning on making a right turn onto a two-way road and somebody just completely just Right through the red light  But I didn't and Total disease Both airbags went off. I barely could open the door From bumper completely off left headlight completely gone Suspension components all snapped wheels  are okay in condition but other than that, you know, it's just gone and I don't know, it really makes me question if I should keep doing YouTube and stuff. It was like, that was scary man. That was really scary. I just never thought a day would come. I never thought I'd have to make a video like this but they always say it's when you least expect it, you know?  As far as part-outs, please stop asking me stop asking me I'm selling my parts, please stop it's hurts too much and Stop asking me from selling my parts no part out Guys I guess just end this video now You guys know what happened now You guys are up to date. You guys don't follow my Instagram follow my Instagram. I Don't think I'll be replacing this dude anything crazy  I'm soon but I guess you can end this video saying two things guys one I think I'm done with YouTube this is it it's my last video on on this platform and I'm sorry to everyone that wants to see me post but this is it two two  April Fools!  the  I  bad karma going away right there. Anyways guys, because I know a lot of y'all told me to knock on some wood. I pissed a lot of people off with this video, but I'm not really too upset about it because you know, you kind of have to have thick skin when you follow me because I'm very sarcastic and you know, it is what it is.  I read every comment and y'all are some fucking supporters. I tell y'all what? Thank y'all for that. Anyways guys, that's the video That's just the kind of videos. I like putting out. But anyways guys, yeah Jasmine is doing okay She's not been in a car accident. No one's hit her. No one ran a red light April fools, I know I got a couple y'all Some of y'all were actually catching on actually a lot of y'all were catching on because Instagram posts I posted the colors didn't match up I try to like actually  the warmth button or the warm slider just to cool it off to make it look more blue I kind of adjusted a little bit I try my best but you know obviously at stock wheels and stuff I couldn't find it you know a blue Z you know wrecked at nighttime like this but regardless she's okay guys don't be too mad at me I love you out of death updates coming with the Z soon and yeah that's about it peace out guys thank you guys so much for watching happy April Fool's  I'm so bad at acting y'all gonna love this one"
}