{
  "video_id": "UU302deeuic",
  "transcription": " Hi guys today I have a creative journaling session for you I was recently sent a creative kit from Joe who runs Little Rainbow Moon And I thought I'd incorporate it into a creative journaling session. Joe designs a load of products for her shop and she puts together these kits She sent me the creative kit with the add-on of the watercolors So you can buy the watercolors separately or you can buy the kit separately, but you can buy them together because they do go with one another So I'm gonna give you a little overview of what's in the kit I'm not gonna go into loads of detail because I want to get on and use it in the  creative journaling session, but I thought I'd share it. And of course I'll have links below to Jo's shop. So if you do want to get your hands on this, then you can go and have a look down there. So first of all, there's a few sheets of stickers, there's some little washi strips, there's some circles, and then there's some little hexagons. There's various different papers. There is the wax paper that she's decorated herself, and then there's some spare blank ones. There's some tissue papers, some vellum. There's this kind of like holographic-y, I don't want to call it paper, it's not paper, plasticky stuff, I don't know what it is. There's also a load  of the same sort of holographic plastic, but they're little confetti circles. Very staticky as well, so I'm gonna have to find a little bag to put them in. There's a few journaling cards and some tags. There's a little sheet of silver sticky gems. There's a holographic purple washi tape. And then there is some really pretty holographic ribbon. So that's like the main creative kit, which has all the stickers, the papers, the journaling cards, and all the other little bits and pieces. And then in here are the watercolors,  I haven't yet opened to have a look at I have seen a couple of them on her Instagram So in here we have a little swatch card with names of each of the watercolors on There's a little sticker with the name of the palette and then you have a little bit of information on them So inside the little tin we have the four watercolors I'm gonna get them open and I am gonna use them because oh my goodness I cannot wait. So you have silence spirit peace and tranquility One's a purple one is a silver and there's a blue and a pink I'm gonna get them open now and show you what they look like without the packaging on I feel like I'm  I'm opening a chocolate. Wow, that one is stunning. That one's kind of like my nail varnish. This is what they all look like without the packaging on. I think my favourites have to be these two, the silver and the turquoise. My journal that I'm using at the moment is cream paper, so it's not white. It'll be interesting to see what they turn out like on there. So yeah, those are the watercolours which match the kit. They match really, really well. She did also send me some other watercolours from previous kits. I'm going to open these ones up as well and show you what they look like.  which ones these are from and I'll pop some information down below for you. Whoa, that one is crazy. So here are those ones. This one is the one that absolutely blew me away. This is End of the Rainbow, so obviously a little pot of gold and it is just so pretty, it's so glittery. And then there is Golden Rose, there's Purple Rain and Antique Rose. I'm gonna swatch these ones as well because I just want to see what they look like. The photos that I have to document today are from a  treasure hunt, like scavenger hunt I did with a friend around town. So we had a map in the form of like questions and a little route that we had to walk. So I'm gonna get on with it and I will speak to you again at the end of the video.  do  do  do  do  do  do  do  I'm gonna finish there today. I did want to try and attach these somehow but I think what I'm gonna try and do when I next have my laminator out is laminate them onto a clear sheet of plastic and then cut that out to the width of the page and have it just like as a layered flip up thing just as like a decorative thing really. So it will kind of look like this so just overlapping everything on the page. So yeah, so that's the last thing I want to try if that works and I'll post a  I used three of the four watercolours in the background and then I used the last one to kind of like splodge little silver dots on it. The only things I used that weren't from the kit were the alphabet stickers and then obviously my date stamp. Everything else I used was from the kit. It's all come together really well and I'm really happy with it. If you're someone who struggles with choosing what works best together on a page, kits like this are really really handy because all of the colours and stuff are matched for you and because there's so many different things you can do with it.  you have like enough choice but not too much choice where you don't really know what to pick. But yeah, I really enjoyed using this kit and also the watercolours are just beautiful and I'm really impressed with them. They are so, so nice. Jo makes them herself, so she pours these watercolours herself into the little pans. If you follow her on Instagram, she does share little sneak peeks each month of making the watercolours and putting them all in packaging. So if that interests you, then definitely check out her Instagram. But yeah, as always, if you do have any questions, then let me know below. Like I said before, I'll have links to Jo's  shop in the description so make sure you check that out. I want to say a massive thank you to Jo for sending me this kit and the watercolors, I have loved using it. I love how my page has turned out, I will share some photos on Instagram regardless of whether my little laminating dots thing works so you can see a closer look of the watercolors and stuff. But yeah I hope you all enjoyed seeing it come together, thank you all so much for watching and I will see you in my next video.  you"
}