{
  "video_id": "uvGeD_OavjI",
  "transcription": " Welcome to vlogmas day 15. Today is Friday. Yay! Let's do open the advent calendar. And here is number 15. I really need to take this to the bathroom. But let's open this.  Look at this! A coconut hand cream! It is so boring! Just one hour ago it was snowing like real Christmas snow and now it's one degrees plus so it's just raining. I really need some snow.  Now I just got home from work and now we're gonna celebrate the weekend and I can show you. This is my outfit today. I have a dress, a black dress with some pockets. I love them. And I have my own jewelry line. It's the Clinton collection. It's a lasso chain in light gold. And then I have two bracelets.  Mini Paris with a greyish stone and then Mini Trebecca in gunmetal I can see here. It's all messed up now with all the stuff from the calendars Now we just stopped by the grocery store and we did get some tacos so As everyone else in Sweden we do tacos in the Friday  Okay, I'm coming!  Nacho chips, chips? Nachos! Then we have some nacho cheese and I have a glass of wine. And here is the meat. And we just do some spices by ourselves. So this will be our dinner tonight and we will serve this with tortilla.  Now, Javi is making me my very own ginger chops. So we start with... What do you call it? I don't know. We start with this ginger.  And it will be like my little shots. So we'll make a large... AHH! Ah, you're so spooky! The ingredients for this shot is just 300 grams ginger, three lemons, half...  of a deciliter, I don't know the measurements in cups. And then one liter of water. Now the ginger is in the water and we will heat it up to 60 degrees for 20 minutes. It is important that it doesn't go over 60 degrees because then all the healthy stuff is going away. So we call it a Swedish nyttig. Yes, very nyttig.  So Habbe is squeezing the lemons. Let's go see how the ginger is going. We need to turn down the stove. There goes the honey. Now this will chill down and then we will take the lemon.  Now we have a full bottle of ginger drinks shots to take every morning to keep us healthy. Let's get this one out and shave  Bye bye!"
}