{
  "video_id": "uz4t7zA1z8c",
  "transcription": " Take my mind where it's never gone before. Rope like a mushroom in cow shit. And I'm taking it just to get the ultimate high, baby. The ultimate high. Excuse me as I kiss the sky.  take it out TJ. Here's Man Tazawa and Tazawa look at this bad shoulder and oh suicide dive by Tazawa. There we go. Austin Aries went for it. He paid for it. Starting to feel it. Could we be seeing? Suicide dive diving Neville into the barricade. Slap to the throat. Pentagon on the move now. It's out of the way. Nicely done.  Noam Dar backpedaling. Oh no. Cedric Alexander bad intentions. Wow. Stereo. Sizing up the welcoming committee.  6 minute tag champions perhaps. Woah! Watch out! 1, 2, 3! Right down on that ring apron as well and here we go! Now Starr! Starr between the top and middle ropes! My goodness! Mundo sent to the floor and now El Dragon has taken World Series!  So we have a lot of doors of primate primate primate takes out what four of his opponents kick in the chops will knock you stupid Phoenix now To the wind and Phoenix falls at the self he gets up to the top taking a moment to the outside  Don't like this picture right here. Ben Baller flies! Boot there to Noam Dar. Off the top and down goes Noam Dar. Thank goodness. He's charging in and Grand Metalik. Oh my god! One step ahead of Nese. You've got two maniacal luchadors. Wow! Stereo moonsaults!  I would say out of harm's way, but that's not the case when Metalik's around. Alexander the legal man for his team. Stereo suicide dives. The boot right to the jaw. Slater. Oh no. Up and over down to the floor.  The momentum. Oh my god! A beautiful- High five flow! Spring to the top! High five flow!  Poetry and motion over the top rope. Jeff Hart. The fact that the Lucha Underground title belongs to him is what drives Johnny Mundo.  Was the weapon of mass destruction whether he's anthrax searing or mustard gas the damage will be done Down  What a loser! Like each and every one of them!  lost his balance but it was part of the plan and keep your eye on Aztec Dragon Jr.  again. Swan could be taken to the skies again. It's one up and over the top. What a layup. Look like she's gonna fly and connecting wiping out all of his opponents with that suicide dive right through. Here come Dean and Seth. Suicide dive. Wow in stereo.  Oh, look at this. This is the essay Beautiful Cabello see Baba. Well, the most Cabello see the la mascara. He quit a lot to figure out Handsome Xavier Woods tag made the official signal  Who's all the oozros it does now? Medics in the back are on call watching on the monitor Huge dive by Nick Jackson. Oh, hang on a second. Hang on a second back. Oh, thanks Well, the bell is barely wrong. We're back out of the ring  you"
}