{
  "video_id": "uZBpGSkFzFQ",
  "transcription": " We've all heard of windshield wipers, but when was the last time you thought about lid wipers? In this episode, we'll tell you all about it.  Lid wiper epitheliopathy is becoming an increasingly important finding to monitor. But in order to understand lid wiper epitheliopathy, it's first important to understand certain anatomical landmarks. The lid wiper is a portion of the marginal conjunctiva of the upper eyelid that acts as a wiping surface to spread the tear film over the ocular surface or in contact lens wearers, the surface of the conjunctiva.  contact lens. This is evident in this cross-sectional picture of the eyelid. But this area needs to be differentiated from the line of marks, which is where the palpebral conjunctiva drapes over the posterior edge of the lid margin and meets the anterior keratinized portion of the lid margin. It's actually a narrow zone located at the surface of this mucocutaneous junction. Clinically, this can be easily visualized by utilizing lisamine green. On the left side is a slit lamp video looking at  this area upon eyelid aversion. But as you can see on the right, lid aversion isn't necessary to view this anatomical landmark. Now, lid aversion is required to view the lid wiper. Lid wiper epitheliopathy is simply staining of the lid wiper. This can be visualized with either lisamine green, which can be seen on the left, and fluorescein stain, which can be seen on the right. We feel that this is a critical structure to examine because of its known association with dry eye symptoms in both  and non-contact lens wearers. The level of lid wiper epitheliopathy can also be graded depending on the horizontal length and sagittal width of the staining. Measuring the length of the lid wiper staining is done from the horizontal margins of the lid wiper staining. The nasal margin of the staining is shown here in the top picture. In severe cases, lid wiper epitheliopathy will actually extend to the line of marks as can be seen here as well. Measuring the sagittal  is done as a percentage area of staining to the total area of the lid wiper. In the lower picture, lid wiper epitheliopathy is outlined. Now, the total lid wiper area is defined. In this case, the lid wiper epitheliopathy is approximately 80% of the total lid wiper. When a value for each of these is given, you grade the level of horizontal length and sagittal width and simply take the average of these two numbers  for the final grade of lid wiper epitheliopathy. In addition to assessing lid wiper area, tongue cover epitheliopathy, it is also valuable to monitor it over time as you can manage your dry eye patients. In this patient in particular, you can see significant improvement in the lid wiper epitheliopathy over time with the left video demonstrating the lid wiper epitheliopathy noted prior to treatment and the right video demonstrating lid wiper staining after three months of treatment. Because of the importance  of the lid wiper area, we recommend assessing it on every patient at every encounter. Remember that the line of marks is a different structure than the lid wiper. The lid wiper is a portion of the marginal conjunctiva of the upper eyelid that acts as a wiping surface to spread the tear film over the eye. Lid wiper epitheliopathy at present is easily seen with fluorescein or lisamine green staining upon lid aversion and gives us an important anterior segment marker to monitor over time  contact lens wearers and our dry eye patients. Ultimately, we should attempt to avoid the development of lid-white prepitheliopathy or eliminate its presence in our patients through ocular surface wellness. We feel that this will improve visual and ocular health outcomes for our patients, which is ultimately why we do what we do. We hope that this has been clinically insightful.  you"
}