{
  "video_id": "uZGytT7bOUc",
  "transcription": " Welcome to the  Okay guys, let's go back up! No, Chris, don't throw that in the car, please.  Damnit!  Wait, where do they have it Alex put it in reverse come with me Chris. That's not motion is right here Alex. We're going into one stolen child island. Oh We're filming a pageration I know  $10 for this and if he has the good motion I'm going to come with me. We're going to set up. Where are you guys gonna go? We know what we know a spot You know what it's for That was getting all the footage  No. Get Cumees for us. Are you vlogging? Yeah. Yeah. Put out by YouTube. No, what is it? At PogoBitchTobacco. Pop it. Twist it. Kiss it. Yo, Bob Ross has his own game? Comment it. No. When your bitch doesn't shave her armpits for two weeks. Cassette. Dogue. I'm here to see you guys. Alright. I gotta get the room light ready.  Hello anybody there wanna buy some like a kumis for skin Dylan I can offer you  I can't hear it.  Now we're on the pilgrimage to JC Penny You know, I never understood how I guess said they got kicked out and then I'm like, oh wait Think about your hockey team you're not doing them good enough damn it  I'm dead-ass gonna put it all by story. What a great pilgrimage to Becca Jimmy get you offended  on it  Y'all want to see me go full get you me do it keep safe my child Yo, I want to try that actually  You know I kind of don't want to get my ass  Let's go well, I want to take a well, let's go down Dillon want to slide down Yeah, I told my mom sick yeah  Move, move! I'm not kissing that shit. I fucking kissed it, I'm gonna get hate! Yeah. Gross, I kissed it. Christian, you and me both. Wear it like a hoodie! Yeah, yeah, no, no, no. Stay warm. Stay warm, my Buddha.  Got some kids playing basketball over there. What losers.  Same time everybody same time Goodbye Becca, we will be back We'll be back to Becca  I feel like things got crazy today in Caillou's house. Go for it, go for it. Things are getting a little wild in Caillou's house."
}