{
  "video_id": "UZQZ2fAoTn4",
  "transcription": " I  you  so  Oh, you're nearly halfway there.  Best of three. Ready? Winners! There you go. What's the score on the door?  about what you consider a hero, who a hero is to you. I want you to add on these sheets, cut in pairs, along every history, in every way, because who do you consider to be a hero? Whether you, yourself, have been a hero at some point, and then as a group, you've seen it.  In the ALZ, students use books,  videos, CDs, computers and work independently. My dream was to learn. My name is Katrina. I helped to produce this short movie and would like to share an insight into the difficult and challenging times in my life. During school, I was labelled as factory fodder since I could not read or write. But as an adult, found out I had dyslexia.  I never felt as unintelligent as people told me I was and set out to improve my education and life chances, but my first attempts at college failed. I then met a fellow service user who attended a specialist course at Burnley College for people with mental illness, like myself, and this is where my new academic life began.  I studied many subjects on the Stepping into Access course but found Information Technology enlightening. Using a computer was like having a guide dog. My eyes were opened. Everything I ever wanted to convey to anyone could be written down on paper and people could actually read it. I cannot begin to tell you how wonderful this was.  made me believe in myself. I felt valued, safe and had a voice. I then progressed onto mainstream IT course. Before it was suggested, I looked at entering higher education. My studies culminated in a foundation degree in information technology through the University of Central Lancashire, UCLan, at Burnley College.  self-esteem had risen and my potential recognised. At last I was achieving my educational aspirations, with continued support emotionally from the Stepping into Access programme. A person with a mental illness and learning disabilities is as equally proficient as the next person given the chance to prove it. I graduated from university  a Bachelor of Science in Computing in September 2009. I am now employed at Burnley College, helping others within the same division that I started my studies in. Every day is wonderful and my dream came true.  You  so  Squeeze, two times, squeeze. And four, three,  Two. Back to your bottoms. Come on, into your squats. And push.  so  You  you"
}