{
  "video_id": "v2_4v8t_IY8",
  "transcription": " By employing methodologies beyond the classroom. By focusing on learning beyond academics. By teaching beyond the text book. One can nurture leaders beyond citizens. Exploring the new world of education. Kandor Shrine iSchool. Affiliated to CBSE New Delhi.  Kandur Shrine, an emerging school established in 2013 in Hyderabad, is adjudged the second best school by Times of India Survey 2015 Hyderabad with challenging standards of education among international schools.  is a school of academic excellence with a unique blend of skeptic credibility and ethical engagements. Located at the cutting edge of knowledge, CSIS has kept pace with the changing world and the pioneering spirit behind many innovations in the field of education.  Chairman Mr. E. Malayariddy, a pragmatic and resourceful person with high ideals, have blended the best practice in school.  but also all competitive examinations like NSO, IEO, IMO and IBT etc. and IIT main thrust will be given IIT foundation and medical foundation courses also. Now in future we try our level best to provide very better holistic education. Now every child is our child, every examination is our child.  our examination, we do it better in future.  in everyday life and not merely in evaluations and exams. The school offers an excellent array of curricular, co-curricular and extra-curricular activities.  This school offers quality education, internal and external, even the competitive exams and all the achievements and the credentials of all the children proves that this school is the best school in Twin Cities.  social and emotional development. At CSIS, we create a conjus ambience that enables the comprehensive development of the students. All teachers are honey-tongued, geared to carry out their job with vision and with effective employment plan needed for the student support. The classrooms are equipped with a computer projector, connectivity for smart digital boards to make learning fun, interesting and  Everlasting, state-of-the-art technology enabled computer, science, robotics and ICT labs with exhaustively stocked library of advanced stature. Children at CSIS are introduced to role-play, art, craft, dance and music to develop and enhance their intuitive and imaginative skills.  clearly stated that this is the second best upcoming schools in Twin Cities survey done by Times of India because it gives quality education with the best faculty and make the children a holistic development with all personality development with sports, games and all extracurricular activities. The school has internationally reputed professionals for myriads of sports and  and game activities like basketball, net cricket, soccer, volleyball, athletics, table tennis, karate, badminton, and also indoor games like chess, carroms, meditation, yoga, etc.  Kandor Shrine Ice School The school provides AC and non-AC residential facilities separately for boys, an hygienically maintained kitchen, and a variety of multi-cuisine menus.  And we also have all the facilities like residential facility with AC and non-AC from the classes 5th grade to 10th grade and the transport also is available a fleet of 22 buses coming across the twin cities. Transport facility well train drivers to ferry staff and students with safety and security.  Supplementing world class resources for the young minds to explore and expand their quest for knowledge. Grand Road Shrine iSchool  will be served with admission and finally the management is really dedicated to give quality education and also seeks the safety and security of the students and management is cocksure to give the all-round development and above all now the admissions are under the process for the academic year 2016 and 17.  I will see you in the next video."
}