{
  "video_id": "vCxRAAJ8_do",
  "transcription": " Hey guys, welcome back to my channel. This makeup tutorial is an orange and purple look. I think it's great for end of summer, beginning of fall, so keep watching.  by using this Algenist primer and then I went in with Born This Way foundation and filled in my brows with Anastasia brow powder in soft brown and then I topped it off with the L'Oreal brow stylist plumper and then before I went in to do my eyes I just added some concealer underneath my eyes on the bridge of my nose, my forehead and my chin next I'm just adding the Laneige lip sleeping mask on my lips this is really hydrating, it's a Korean beauty product and I'm using this now because  up  deeper orangey red and add that also into that V just to give it some definition. Next, for the rest of my lid I'm using this light colored shade and I'm just packing it on. I'm going in with that same brush, no product, just to blend everything out and make it all look cohesive. Now I'm just going to take off that tape and you're going to see the really sharp line that it creates.  The purple shade on that lower lash line, I'm going into the Anastasia Self Made palette and using that purple shade on the corner. And I'm just going to buff this in with a pencil brush. And then I'm going to follow up with Kat Von D's liner in Trooper. Next I'm just going to curl my lashes and add some mascara. I'm using the Maybelline Falsies Push Up Drama and I really like this wand. After the mascara, we're going to be going in with some falsies. I'm going to be using the Luxe Faux Mink Glow Gloss from iLor.  I'm going to add some L'Oreal Voluminous Eye Primer and then use that same mascara. And then I'm going to add Colourpop's Get Paid eyeliner right into my waterline. And this is the finished eye look. I think that once you add the lashes and the mascara and the eyeliner, it's not too colorful. I think it's just a beautiful mix of the two. Now I'm just going to set the rest of my face with a little bit of concealer.  face with MAC Mineralize Skin Finish. And I'm going to use the Wet n Wild bronzer in this contour palette just to bronze up my face. Next I'm going to go in with some Coty Airspun Powder and just clean up underneath that bronzer just to give it a little bit  definition and kind of like a contoured look but nothing super harsh. So this will just clean everything up if you were a little messy with that bronzer. And then I wait a couple seconds and just wipe that away with a powder brush. I'm going to use the Tarte Exposed Highlight and a damp beauty sponge to apply  my highlight on the high points of my cheeks and I don't show it but I also apply it to my nose. I'm using this NARS blush in Glue. I like it because it doesn't have too much shimmer or sparkle in it but it does have a little bit of a sheen to it so it just looks really nice on the cheeks. Now I'm just going to wipe off that lip mask that I had sitting on my lips the entire time so that I can go in and apply my lip product. I'm going in with this Milani Retractable Lip Liner in Most Natural.  And now I'm going to go in with Out Loud by Smashbox. It's their Always On Matte Liquid Lipstick. I love this formula. It is my favorite liquid lipstick of all time, especially if you go in with that lip mask right before. It's a matte look, but you feel so hydrated, you can't beat it.  And here is what that completed lip looks like. Now I'm just going to top it off with some Wet n Wild setting spray just to make sure my makeup stays in place. And that's the completed look. Thank you so much for watching."
}