{
  "video_id": "VeD--7mvGo0",
  "transcription": " [\"Tagandi Si I Ita\"]  I know.  I'm  Zinaa la mulungu Zinaa la mulungu Zinaa la mulungu Ndilole mekezedwa Zinaa Zinaa Zinaa Ndilole mekezedwa  Zinaa la murungu, zinaa la murungu, zinaa la murungu, di lole mekezedua.  Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina Zina  See.  Siyan, jirazakom, jirazakozoipa.  See you.  Let's pray.  and we thank you Lord that you have given us an opportunity to enter into 2019. Lord, we commit ourselves unto thee as individuals, as an institution, and we pray that Lord, may you come into our midst. Lord, we pray that you forgive us our trespasses and cleanse us from all unrighteousness and reside in our midst, oh Lord. We pray for the students, that Lord may you touch every  students on this campus. May you continue to guide, may you shower blessings upon all of them, and may you lead them, provide them with the resources so that Lord, they may be able to complete their education on this campus and they may glorify you for the wonderful things that you have done in their lives. And Lord, we also pray for faculty and staff that Lord, may you continue to bind us together. As we serve in this institution, we pray that Lord, may you give us the knowledge and the wisdom that we need  to serve you to the glory of your name. Impress upon those who are not having that desire that Lord they need to be focused and have the desire to worship you and serve you to their best of their abilities. And Lord we pray that as an institution continue to protect this institution from harm and danger, continue to lead us, continue to guide us, give us the ability to know more about you. And Lord we pray that you prepare us for your soon coming so that Lord when you come again  we'll be part of those who will inherit the kingdom that you have gone to prepare for us. For today's activities, we commit everything into thy care. Lead us and guide us. In Jesus' name we pray, amen."
}