{
  "video_id": "vGcAoQ5K47M",
  "transcription": " Let me remind you heights I would fly to depths I would die too  What's up you guys? Today we are doing a photo shoot and we do this every two weeks but we do a different location every time and today we're at a loft in downtown LA and it's so cute. So I'm just gonna show you guys a bit. Hello! Like it's honestly, like can you? That looks honestly so pretty right now. Wow.  So we're gonna take some photos and then maybe go get some piercings, maybe go get some food. We'll give you guys some updates to come.  So we left the photo shoot about About 30 minutes ago Say hello And now we're going to Mama's shelter which is supposed to be one of the best places to eat in the area and we still have not been so what better timing than the last few days that we're here and the shoot went really well anybody have anything else to say  Super fun. Harry got some cute pics. We got some good photos. This is where we're going. It's a lovely day. Oh yeah.  We all got matching food. We got chicken sandwiches.  Chipotle lime mayo coleslaw Pickles and then these bomb fries I look amazing. We're satisfied. No complaints Okay, we just finished eating fabulous meal It was so good. We're all very full because I was a very large chicken sandwich  Margaritas were fantastic and now We're going to get piercings potentially, but we need to see if we actually like the jewelry If we feel like it makes sense when we get there, you know We need to go places to know if it's the right decision So that's what we're gonna get do We're excited Indian yellow trying to get matching conch piercings, which means it's like here straight here  Anyways, we'll see  We're actually gonna think about it more like we're not really sure and he was like well make sure whoever does it is doing it like cleanly I was just like goodbye sir. Goodbye, so we decided To end that and our night well because he was a buzzkill Came for afters if you live in California and the afters yet, you're making a big mistake a big mistake and then tomorrow We're gonna potentially get piercings and go to the fair and we're all so excited  So yeah for tonight vlog out Hello good afternoon Cheers say hello to Nicole and Danielle We're here It is now  I mean you guys didn't know what day it was last time I vlogged but it's the next day and we are going for our second attempt at piercings so I called a few places and we're gonna hope for the best but I think I explained this last night a bit but last night was just a fail because the guy was very rude and it was just not a good vibe and you just can't get a piercing from somebody when you're not having fun so We're at this really cool place. I think I'm feeling good about it  it and and then after this we're going to the Orange County Fair so if we end up getting piercings and having a blast at the fair it'll just be a really good day. We made it girls! Also just a quick recommendation if you guys have not had the salted cream cold foam cold brew from Starbucks highly recommend. That's all!  Okay, we're getting a conch I'm scared, but I'm excited and we can't video in there, but we'll see pictures and videos after  How do you feel? Oh my gosh, you guys, this is a little scary, but... It's so cute, I love it. I'm so excited, I did it. I'm so proud of you. It's so cool. Oh my god, wait, that was so different than what you wanted, but I love it. I know, because I can't do hoops. I love it. It looks so good. Yeah. Let's see, Nicole just got her  It's only throbbing a little. It's only like kind of right. It only hurts just like kind of a lot. We're at the fair! And I have a piercing. This is so exciting. We just got fried Oreos. Looking for a corn dog. We're trying to decide what rides we want to ride right now.  hard to choose. This is the biggest fair I think I've ever attended.  So baby light me up, you can breathe me in I'ma love you up, until the quiet comes"
}