{
  "video_id": "Vj8gzj1LSFo",
  "transcription": " My name is Blake Moore. I'm a physician with Virginia Urology. I specialize in robotic oncology and reconstructive surgery. I currently practice at Retreat Doctors' Hospital. Here at Retreat Hospital, we have extensive experience with partial nephrectomy. It is the process of removing just the tumor from the kidney while sparing the rest of it. Preserving renal function or maintaining good kidney function is essential for patients with a solitary kidney or  or those who have a compromised kidney function to begin with. But there are many other patients that benefit, those with a history of diabetes, high blood pressure, and even young patients who don't know their future medical issues. Certainly, any time you can preserve renal function, it simplifies their medical needs in the future. We deal with all sorts of complex renal masses, ranging from one centimeter all the way up to 20, and many of those cases we're able to preserve healthy kidney tissue. Traditionally, surgery that was done on kidneys  open was quite painful and prolonged recovery. One advantage with robotic or laparoscopic surgery is a quicker time to recovery. Many patients are able to leave the hospital after one night and even return to work one to two weeks after surgery with limited lifting. After the patient is brought into the operating room, they are put asleep under general anesthesia. They are positioned on their side with the kidney being worked on facing up. The surgeon then places trocars into the abdomen which hold the robotic arms and the  is then brought in over top of the patient. The surgeon then sits down at the console and has the advantage of magnified 3D vision. A surgical assistant is also used at the bedside to aid the surgeon who is on the console. After the tumor is excised, it is removed in a bag through one of the ports. The length of time for removal of a kidney tumor really varies based on the size and complexity. Generally speaking, it can take anywhere between one and two hours. In this particular case,  a 16 centimeter tumor that we were able to remove while preserving healthy kidney tissue. The patient was able to leave on postoperative day number one. The overall benefits of robotic partial nephrectomy is that you are able to remove the entire tumor, preserve renal function, and hopefully have a very quick recovery time so that you can get back to the things you enjoy. Virginia Urology has more experience with partial nephrectomy than anywhere in central Virginia. When a patient presents to us, we are always looking to  to preserve renal function whenever possible."
}