{
  "video_id": "vqcRHk9eu94",
  "transcription": " Randy's got really great cars. I mean, 50, what, 55? Old Fiat, old Bel Air. He's got some hot rods. He used to drive Vipers. That used to be his fun thing. Yeah. Well, yeah, he's an enthusiast. He's a driver. But the other reason that we're in Arizona is his discussion of the fact, his comment,  us was, I can't make gasoline. I live in Arizona. I can make electricity. So he's gone to solar so he can power his Teslas. That's one of the reasons that he loves them. So he is self-contained in that regard, which is impressive. We've been around Tesla owners that have essentially written Dear John letters to Big Oil and completely said we're off the grid, which we know is not true. If you have that desire, OK, yes, you're not using gasoline at the pump, but your tires, all the plastics in here, this is still petroleum product.  Petrochemical products. Yeah, they're still petroleum products. So it's not like you have left all oil. It's just yes, you aren't using gasoline, which is great. My favorite story is how the Teslas are delivered. So you order one, you hit send and deliver to my house on a giant hulking auto transporter powered by what kind of engine? That's right. Yeah, true. So, until they make their entire fleet delivery all electric. Well, yeah, this is still a car that consumes for its existence. It just doesn't consume gasoline.  And like like the Model S I do love the drive with one foot thing Yeah, and they've got more regeneration to it. They've got more regeneration here So it's even more braking and you really can drive almost all the time and never use anything but the gas pedal Randy says that's help you properly drive a Tesla Tesla are safe. You really want to know you're driving a Tesla properly You're just one foot off time even come to a complete stop. Well, and you know the the auto drive  navigated a four-way stop just fine. It was bizarre to do that and to barely touch the wheel, just because it was a tiny bit confused when the car in front of us actually turned left. But as soon as I touched the wheel so that it needed to stay straight, that was the only thing I did in the entire process of a four-way stop. That's amazing, the whole auto drive thing. They really are way ahead on autonomous driving.  driving for people to use right now."
}