{
  "video_id": "vt3IuJCKOMQ",
  "transcription": " Good good. Good. What's your name? Sonia? Yeah, that's a nice name. Where you from? I'm from Manhattan Beach, Manhattan Beach Okay, good you want to win some money yeah, okay I got ten pictures on the board every time you  I'm gonna give you a hundred bucks if you match all ten of these pictures in 60 seconds You could walk out of here with a thousand dollars. Stop it Yes, so flip them over okay, let's scramble them up All right, the time will start after your first two numbers go. Oh the lights are down. Okay 12 19 12 19 9 10 9 10 14 15 14 15  It's one seven one seven eight Seven fourteen. Oh, it's nine nine nine nine nine seven fourteen Sixteen thirteen sixteen thirteen sixteen sixteen nineteen sixteen nineteen sixteen fifteen sixteen fifteen sixteen fifteen  111  You did good, you got seven matches. You got $700. One, two, three, four, five, six, seven. And guess what? I don't know if you noticed, but one of those matches that you made was a picture of a master spa hot tub. And since you got that match, we wanted you to have what's behind that door over there. That's yours, yeah. That's yours.  Dr. Gadget gonna tell you about the hot tub. Yeah, go ahead. Hey, everybody, how are you? So one of my favorite features that I really love about this spa is its amazing extreme therapy seat. It literally surrounds you with over 20 therapy jets and massages every muscle on your back and your hips, baby. Now, this also has the Masterforce Biomagnetic Therapy with the stress relief neck and shoulder seat. You're gonna love that. And so not only do you get an amazing  amazing massage in this seat, increase your blood flow, and reduce swelling. This is an awesome tub, you're gonna love it. Congratulations, it's all yours. Thank you! Thanks Dr. Gadget, congratulations Sonja for more information about MasterSpa. Head over to MasterSpas.com, we'll be right back.  to watch the next one. And make sure you subscribe to always know what's happening."
}