{
  "video_id": "W2u6SC3CxgE",
  "transcription": " So off they go, now we have pink and grey at the branches here and the runner leading the way out of the base grey is orange on the good one and let's see the runners, let's concentrate on the runners coming through now. Four left to go now, the runner in green, Sam Anderson will be pretty hard to find  The  that  the next runner through in the yellow Marcus Oseman from Moriarty. Now have a feeling Marcus might be the son of Antonio, he was a very good circle runner back in the 1890s. And then moving through past Marcus Oseman to the red is Benjamin Rodney, then the white there is Zach Thornton and at the rear is Andrew Sait. So the race with just over two laps to run, our leader still Ingrid Woodward and the  She's out in front of second place is still is Catherine Van Ede and Anderson in the green is making steady progress. Woodward doing alright here round the front. She had 30 metres on Catherine Van Ede. She certainly put a space in her. So she may be hard to beat this leader. Anderson coming around to second now. That's Sam Anderson. Third Catherine Van Ede. Overman in fourth breaking away from the other back markers at the moment.  led by in fifth place in Benjamin Rock for White Jack North in sixth and seventh is the blue-coloured there of Andrew Saint. So they work into the back straight or she works into the back straight, Ingrid Woodward, and still has a very good margin. On the second runner now, which is Sam Anderson and his brother Jack made it into the 800 final just a bit too soon in fact. So both Anderson boys riding the Abnur today, getting around to third.  R87 Semi  Sam Anderson  40 metres on Sam Anderson. She's showing no signs of stopping at the moment. She's bound a bit down the back straight, Ingrid Woodward. And Anderson putting down the front on now. So this will be a fascinating finish. Grover with the back marker is running on strongly but the margin will probably be too great. So Woodward goes around the top bend but Anderson is starting to make up the ground now. Remember he carries the great forward of this race, Sam Anderson, with placings in the harnable mile. And he's starting to run out after Woodward who's put up a game effort. But Sam Anderson  1. Andrews  And then coming in now, Zach Norton will take out the fifth place. And there's still two more runners to finish off, ladies and gentlemen. So if you can keep the track clear."
}