{
  "video_id": "W5Wh4xCmPC4",
  "transcription": " We're in the waiting room waiting to get into the doctor's office. This is a secret log mission. People are looking at me, but I can't film. It's a very busy waiting room and everybody is looking at me and wondering why I'm talking to a camera. Just kidding, nobody's in the room.  We have the whole place to ourselves but I still feel like this is a place to whisper. Also they don't want you to have a cell phone. This is a cell phone for you. So there's no cell phones. Stop. I don't know. Catherine forgot to put the cheese in the fridge. I closed it. I hate you guys right now but I stopped. Catherine is embarrassed. She said I can't sit in one place because I have to go pee.  She's gonna pee her pants. Stop. You know what James, she's gonna show up. Look at the little squishy. I'm so excited. I wanna cry.  They wouldn't let us film it. They wouldn't let us film it, dang it. So we're gonna do another one. A private place to get the filming. I know you guys wanna see it behind me. Yeah. Okay, I gotta go pee. Everyone wants to see it.  He was just like, nope, can't do that, can't film, can't do this, nope, don't even do anything. Don't even smile, in fact. He said don't smile. So, yeah, but everything looks normal, so that's a good sign. There's only one, as far as he knows, but I don't know if I trust his credibility or not. He seemed quick and rushed us right out, so I just hope he's not gonna do anything else.  have the keys so that's it we're off to our next adventure if i can find the keys i don't have the keys as long as you don't put your finger on the mic you're good what are we going to talk about baby names baby names we're fighting over baby names guys we're not fighting well we're arguing no  We're not agreeing. Fine. We're the opposite of agreeing on baby names and we need your input. Like there's so many baby names out there. Yeah. There's tons. We like cool names. We're not gonna name our baby a color like blue. So if that's your idea, we're not doing that. But give us good baby names that you like and even like foreign style names are cool too. Like I don't care. Like just something that's cool. Maybe we should list off a few genres.  I think you might be drunk.  Don't pressure yourself. Don't worry about it. No, I'm pressuring you. Just give us a name. I want you to stick to the themes. Everyone give a list of a name. If we choose your name, you're definitely getting a shout out. And you're going to be the godparent. We love you. Yes. We're going to keep pointing at you like this. Yeah, for a whole pregnancy. I don't know why we're pointing at you. Do you want to tell everyone what we're going to eat? We're going to go to Hapa Itzakaya. It's like our favourite spot that we rarely... Oh, it's your favourite spot. Oh, I thought we were one flesh.  So it's our favorite spot, but we only go there like once in a blue moon But when we get there they act like we go there all the time. It's really unusual. That's we know you guys yeah, and I'm like come in here a lot don't you and we're like Well the time that she recognized us we had actually only been there that was our second that was our second time and the first time was on Valentine's Day and then I think the second time was like a year later and she's like you guys have been here before and she tried to offer a shot so I'm like we don't drink  She probably recognizes us from the camera. Bring it in. We're gonna bring it in. Anyways, um, and then after we go eat, we're gonna go pick up what? No, we're going right now to pick up the camera thing. Oh! The lens, and I already told everyone about the lens. This is my birthday present to Anthony because I love him so much. I'm gonna let him spend all the money that we own. The thing is, she's not gonna complain about how much money I'm spending tonight. I don't know.  What's it called? It's very, very expensive. A Canon 24-70? Is that what it's called? Yeah. Really? L-series lens. It's very expensive. Ooh, tell everyone how much money you spent. I spent a lot of money on a camera lens. There's a lens right here on this box. That's all we get. You guys at home are gonna help me make it all back by hitting that like button. Ooh.  That now looks sweet. It is a heavy balance. Okay, show it to me. Let me see it so I can put it on the camera. So this is the bad boy that he got. Let's connect it. Let's put it in there. Looks pretty sweet. Okay, connect it to the base. This is a must-have.  Boom, connected. And there you have it, folks.  you"
}