{
  "video_id": "wC2NIclo8Bw",
  "transcription": " Good morning good people welcome to my channel Martina Ella B. I am on my way to work This is gonna be my first day because yesterday I was not feeling well I'm still not up to par and I should stay my butt home trying to get myself ready because Things just got real real but these people when I called them yesterday  See they already got their stuff up Good evening everybody good evening. How you guys doing? Okay? I'm trying I'm trying to look cute for y'all cuz my hair is a mess. I'm just I just came from Work, and I just ran to Walmart trying to get some more water at this point in time Yes, ladies and gentlemen and the people of the people of the United States  The government of every damn body where the damn water at Okay, why is it that you go in the store and you still can't find no water? It can't be that bad. No, it can't be that bad. Okay, cuz if I'm gonna get me at least I'm not gonna be thirsty All right, I'm not gonna be thirsty and where is the gasoline honey, there's no gasoline either there's no gas there's no gas  My mom waited two hours in line for gas when she got there. They told her no more gas She's still upset about that y'all I told that lady Tuesday go put gas in her car. She sat there talking about oh It ain't gonna be that bad Well, it is that bad and now she's complaining I'm like I don't feel sorry for you  and now  neighborhood has evacuated and you know Martine you wrong honey you don't see no damn body there and you trying to go get you some gas you might just maybe fooling your damn self cuz I know in no damn order and yes I'm talking to my damn self okay yes I'm talking to myself everything is sorry let me shut up  Hey y'all I am in Walmart. This is not our local happy This is not actually our Walmart this is hey, yeah, this is Martine. Sorry. I'm a miss I just came from Getting some more water came from  VJ's they had water Excuse my nails, but nobody cares about that right now This is September 8th on the eve of Hurricane Irma Hopefully it doesn't get us that bad  I'm right here trying to get Burger King because everything else that is Thank you Yeah, everything else that's we can really eat is closed I usually eat  I'm taking up heat. This is what Hurricane Irma so far has really kind of, um, you see the thing, the bridge fell. I don't know what other damage there is. As you can see the winds are not letting up.  Hey y'all, this is what we have we have  Oh"
}