{
  "video_id": "Wn8K4O7EFcE",
  "transcription": " 1am in the heart of West Virginia. 3.30am somewhere in Stauntonville, Virginia. I've been asleep for like two hours. Katie is trucking along through the Appalachian foothills. Actually this isn't really foothills, we're in the middle of the mountains. On a break. It's 3am. Let's go back to sleep.  We made it to Virginia Beach. So I've never been to Virginia Beach, but Katie has been many times. All through my whole life. I'm excited for her to kind of show me around and then I'll finally understand some of the places that they talk about when they talk about coming to Virginia Beach. You're trying to clean up the beach. I dropped it. Clean up your own mess. You're more responsible than 90% of the people that probably come to the beach. I left the lid in my wand.  It's crowded up in this thing. I know, I'm glad we got here early. How's the water? It's okay. Yeah? It's a little colder than we maybe thought but it's good. You ready to test out that new boogie board? Look at that, wood paneled and everything. Spared no expense.  Oh my god, it's so hot. You're going too slow. It's too hot. I'm in a wet spot. Recharge. Go, go, go. He's got a nice little path for us. That was nice of him. He didn't know he was being so generous when he was after me. It's too hot.  Oh, your safety. Don't fall, are you okay? I caught you.  I hope it lives up! Well, you're in for a surprise.  and the campsite is even better than we could have imagined. I mean, yeah, yeah. It's secluded. It literally, the ocean is like steps away. It's sandy. John Smith and Pocahontas legit were like right here. I mean, this is,  better than we could have imagined so let's get camp set up let's get let's get this started you ready babe I'm getting bit by flies. I'm getting bit by flies the cameras not working but it nothing beats this.  This is the best campground we have ever been to we've only gone camping twice the last time we went was when we were sophomores we were 19 and it was just like a park in Ohio and this is like amazing I booked it last week I booked it this week and there was one spot left and we met some dude that said he booked 10 months ago and it was full so this was like meant to be it's something we've been wanting to do for a really long time to go camping to just go on like a spontaneous adventure and we decided  You know what, what the heck, let's just go do it. And so we did it and it- And look around us. Oh my gosh, it was so worth it. If there's something you want to do, go do it. Ground that intention. Do it. Just live it. Create the life you want to live. Yes! Finally the camera is working. I am so pumped. You guys have no idea how frustrated I was getting. I'm gonna stop now before I lose this. Bye.  I'm gonna break out!  Hey, we're gonna go make s'mores now, okay? Have fun! Morning guys, meal of breakfast, PB&J. Gonna head back down to the water for a little bit and then head out. Hope to get home, you know, about 8 or 9 tonight. So, we got 9 hours ahead of us, so we're gonna enjoy this morning while we can. Back from the beach!  Of course the GoPro was dead, must have forgot to turn it off yesterday. I have a lot of problems with that with the GoPro specifically, forgetting to turn it off. This is kind of hard to remember sometimes, because you got to hold that button down for so long. But anyways, time to get this cleaned up, because we got to hit the road, because we got a long drive ahead of us. So, here we go! All gone. And now to go meet some old friends for lunch. Please excuse how sweaty I am. It's really hot out here.  And I'm really looking forward to this air conditioning in this car. You ready? Yeah, let's roll. Let's go get some lunch.  I also hate it because going up those things, my car feels like it is struggling hard, like driving through sand or something, and it just makes me nervous. But we survived. Anyways, thank you guys for coming on this little adventure with us. It's something that we kind of felt like we needed to do. It's something we've wanted to do for a while, and it's definitely something that we want to continue doing, hopefully even more often than what we've done now. And it just,  It feels right. So thank you guys for watching. Hope you enjoyed this vlog. Remember to create the life that you love and we will see you later. Bye."
}