{
  "video_id": "Wpz7F-Hk6jU",
  "transcription": " Music  So this is the kindergarten room. It's partially carpeted. And just some of the features of that is we have the smart board, which has an adjustable height based on the grade level it's used at. So our lowest level is at kindergarten, so kids can access use to that technology. And the wall behind that actually lets you staple, use push pins without having to worry about wrecking any paint or anything along those lines.  The classroom also has a second exit to be up with fire code and then in this kindergarten room the bathroom is actually inside the room around the corner here. The locker bay right in conjunction with the room, it's in about a hallway. So the new rooms each kind of have their own hallway that supports the lockers and then we have extra space for students to utilize for intervention or when we're getting groups.  And we just have an arrow system so that the line leader who has the sign for the bus can see that the arrow that bus one is here so that the bus one kids know to come out and start getting outside. So here's the bus loop, all six buses. They pull in at the end of the day on the far end working down and then they don't have to back up or anything they just come in. As they're waiting for the kids they shut down the buses  so they're not idling with exhaust going into the street. And then once we have the six buses loaded, starting with the first bus, they just pull right out. They make a U-shaped turn and get out to the street so there's no backing up or anything like that.  the new part of Kaposia. I do have to point out in the old kindergarten wing we have two preschool classrooms that are used as half-day options and full-day options. And as we walk down here too we also have spaces for two kids choice rooms that we're going to step into here. So as we enter this  Classroom here. This is a kids choice space which would offer during the day daycare for families who choose to go to the half-day preschool option and Then they stay with kids choice staff in the afternoon or in the morning sometimes So because we are in kind of reshuffling mold and we have six third grade classrooms two of our third grade classrooms are now located in the new section and  And in the future, they will be all together in two of the pods on the other side of the building. But in this year of transition, two third grade classrooms are located here. In addition to the six classrooms, we have six office spaces as well. And we have our behavior specialist right here.  who's working hard preparing for her day. And we have early childhood screening that has their own room. So we have an early childhood family support worker and we have a K-6 family support worker provided through 360 communities. This will eventually be workstations for kids and there's the capability of desktops.  to be plugged in here. That's our favorite part, so we can refill water bottles and save the environment."
}