{
  "video_id": "Wtnw9ooAW98",
  "transcription": " Happy Sunday ladies and gentlemen. I am back. If you guys don't know what's going on with me, I was diagnosed back in April with lymphoma, stage 3, and put me out of commission to do this because I've been running this show for six months.  My name's Ryan Talmo. I host Liquid Zoo on Sunday nights and I run a show at Petey's Place on Monday nights. When the doctor told me, oh yeah, it's very simple. You got a 70, 80% chance of surviving. And it's to a lot of people, like, oh, it's nothing.  That's great. You got it. It still gave me a percentage. It's pretty horrific right there. And that changed everything. Just the fear. What do you have to lose? What do you have to lose in getting on stage and saying what you feel? Guys, next comic coming up. Give it up for Drew Landry, ladies and gentlemen. All right. All right. What's going on, guys? My name's Drew Landry. I'm a comic. I'm from Baltimore. Live in LA now.  comedians feel the need to perform even when they have cancer. To me it's therapy just because it's so fun. So I can imagine going through chemo and just looking forward to get on stage because it's fun. Give it up for the very funny Ahmed ladies and gentlemen. He's one of the few people in LA that actually cares about the art and he actually cares about stand-up. That's how you see like you see how genuine he is. That's why I always come back. Guys next comic coming up. I love this guy. Guys give it up for Amir Khalid ladies and gentlemen.  I'm Amir, via Miracle, what's up? We're all going through something. Life is just always happening and the best place to vent out about it is on stage. Getting it off your chest is almost like a way of just letting go of the pain. Yeah, I ask my work, like, are you guys okay? I'm still doing comedy and they're like, yeah, whatever you need to keep your brain working. Because they know I'm not lifting, I'm adding stress to myself. And that's like the beauty of it too, is that there is no stress doing this right now.  When you realize that you're literally on your deathbed, you figure that comedy is not easy, but it's easier because there's no fear anymore. It's clearly just out of passion and loving it, which is beautiful in a way. As corny as that sounds, the idea that you don't know how much longer you have left, so you're not doing stand-up searching for success or money or fame. You're doing it because you love doing stand-up. So there's something interesting about that.  My name is Eve. I'm a bartender here like around like three years, three-ish. I know Brian since I work here. Every Sunday he do like comedy night. He very, very sweet heart. Everybody love him here. He's very, very kind. He's gentle. Couple months ago I saw him here with like a big bump right here. I feel like, oh my God, my heart broken. This is always like, always like been sweet to me.  He's very hard and gentle. He never being mean at all. With Ryan, it's undeniable that it's helped his comedy and it's helped him grow as a man because we all have vices. We all want to eat tacos and McDonald's all the time. And that's fun, especially when you're in your 20s because you don't think anything bad is going to happen to you. But when it does, it's like I'm getting older and my body can't handle all the bad stuff anymore. I got to take care of myself so I can do what I love.  And so he's a living testament that, you know, yeah, yeah, he's doing it, man. I'm happy for him. It was horrifying. Everything else goes in the back burner. And my biggest fear was comedy going in the back burner. It took me a couple months to get back to what I was. So in the very beginning, I was not, I was bedridden. I couldn't do comedy at all. I just knew in the very beginning, I was like, I got to document myself going through this. Not many people do that. Not many people do that at all.  And then I had this feeling of I'm not going to get on stage. So this is what I'm going to do. I'm going to write out my day to these people because I'm going to be stuck in bed. And the stronger I got, I was eventually I got myself back to Petey's Place and I was hosting Petey's Place every other week because I was building my strength up. I can do this. I can get back up and do comedy the day after. It was just pushing my strength because it was all also a very mental thing too because the chemo kind of eats up your brain.  So if I sat in bed for all these months, I mean, my speech would have been awful, my memory would have been awful. So it's just to keep things going. He's really like that prime example of like no excuses. It's like this dude is going through cancer and he's getting treatments and then when he's done, he's still hitting the mic. Ryan is just very, I don't know, gregarious. Like he's just good around people. Yeah. People are drawn to him. He's just, he's easy to be around. He's easy to talk to.  I was super intimidated and a lot of comics around here, you know, there's a it can be territorial and that can be kind of douchey especially if you're new here and he was just never like that and he was one of the first comics I met out here that really felt welcoming.  Of course, I'm telling him like keep having sex and then you're gonna be better. Cancer is a secret society at the end of the day. We stick out for each other. If you lose one, it hurts.  And so even when it comes down to a celebrity, to me, you've got cancer. You're one of me now."
}