{
  "video_id": "wXFs1TTGSPI",
  "transcription": " Well, it's interesting to know what the ladies have to say about sex, but we also have a male panel. Male panel, could you please introduce yourselves? Hi, I'm Dijonyeu. Hi, I'm Gino. I'm Jeffrey. Ladies, give him a big applause.  Good to have you guys here and very brave of you because we have some spicy questions for you, too And some spicy women and some very spicy women I'm sorry. What did you say? That was purpose why we came? Very smart Well a question for you I think everyone knows that women do fake their orgasms once in a while if a woman fakes an orgasm  Do you think you guys would notice? Well, to be honest, up to this moment, I believe that no one has taken it. Me too. I think I'm in that same boat. But let's say you're with a certain person or you do it regularly with a certain person, you recognize a certain way they orgasm and then all of a sudden they orgasm at a point where you know or you feel they shouldn't. That might raise some questions.  questions actually. Do you ask these questions? Yeah, that's a good one. No. You just let her act it out. Exactly. I don't want to know if she's faking it or not. You don't want to know? Why would I want to know? Because you want to give her pleasure. I've had a... You've had a what? Let me be... I need to say this correctly. I don't want to be misunderstood. I've had a moment where  There was complaints that she needs to reach her climax, so get to it. That's what she said, now get to it. Yeah, so usually it would be like, okay, I get there, but today I'm not getting there, what's wrong? I've had that before, so. Okay, so they're usually quite open with you. Yeah. And you're open to communication? I just had to perform more. It's like you're still sweating.  You know, sometimes you give an Olympic gold medal performance. Today you think, hmm, I'm going to go for silver. No, she wants gold. Oh, well. All the time. All the time she wants gold. But listen, in four years there's another Olympic, so... Tell that to her. Tell that to her. I don't think women would like to hear that. No, that's OK. You see, they are spicy. Be careful what you say. Very, very thoughtful. Thank you.  Well, and another question. Do you guys think it's a good idea to experiment with lots of different men or just with one? For a female to... Yeah, for a female. Okay. To experience better sex?  will not climax. So you can try on many different guys or men, how you will call them, but if you only do it one or twice and you're not giving yourself openly, you don't feel secure with the guy, then it's a lousy experience. Interesting to know. Thank you so much for your openness and we'll see you the next time. Thank you. Thank you for having us.  This week in Styles and Stuff I've got Nadia next to me and she's going to get a makeover from Tatiana. Welcome, Nadia! Thank you. Nadia, it's so good to have you in the show because we have the same name. Exactly, it's really nice. And why do you want a makeover? Just to feel better and pretty. I don't know, I just need it. We can do that for you. And what do you hope she's going to do for you?  amazing, I don't know, surprise me. Surprise you? Well that's what Tachana can do. So I'm going to send you to Tachana and she's going to make you even more pretty. Thank you. Big hand of applause for Nadia."
}