{
  "video_id": "WyXJK36bw78",
  "transcription": " I'm very excited that we do actually have a surprise caller for you, Jake. Are you ready for your caller that I've arranged for you? I'm always ready. OK. Hi, caller, are you on the line? Hi, yeah, I'm calling to talk to Jake. It's Rosie. Is he there? Hey, Rosie. Wow. Oh, my gosh. What an honor. The great Rosie O'Donnell is calling in to the show. You know, I was just listening to the replay of that interview and I realized I didn't get  him a chance to explain when he said that women weren't oppressed around the world. So Jake, I didn't give you a chance to talk. What did you want to say? That's a really good Rosie, by the way. What are you talking about? Okay, good. Explain to Miss O'Donnell why she's asking. Well, my darling Rosie, that segment of the interview, that was hard for me to be quiet. Do you want me to give my philosophy here again?  You'd be fine.  I heard you tell the host of the show that I had problems with men. Yes, well, you're a lesbian. That's what I'm saying. So what does that have to do with having problems with men? You know, I was with men. I was with Michael for years. Who's Michael? Michael was my boyfriend for three years. I was with a man. Don't you know this? What kind of research are you doing? Here's what I got. Women in America, I'll say it again. Let me ask you this, Rosie. Do you understand the difference between  the physical limitations of women and nature, talking about oppressive society and being in danger for men and oppressive society of rules and laws and restrictions that are outright set to keep you oppressed like the Middle East like I mentioned. Yes, we're talking about the Middle East, yes, there's a societal oppression in the Middle East that we don't have here but what you don't understand is that we have vaginas and it's you can put something in a vagina but you can't put anything in you. That's true Rosie, burn his butt hole, right? True, I could put something in me if I  If I was if I desire when you're walking to your car late at night when it's dark outside You don't worry about getting thrown up against the car and raped brutally painfully. It won't happen to you. No, because I'm six foot one. No, because you're a man and men are not going to rape each other on the street. It just it doesn't happen. And then every time they leave the house have to be in danger of getting penetrated in some hole or another. Why do you think I don't have to worry about getting raped? Do you walk outside and worried about getting raped?  No, I'm asking you why do you think I don't worry about it? Why do you think it doesn't happen to me? Because you're a man. You don't have to worry about it. The only place men are raping other men is in prison. They don't rape each other on the street. And why is that? Because rape is for power. It's not about sex. And there's always going to be women that are raped. Women have all the holes. Well, yeah, they do have more holes. Well, Rosie, I hate to digress. I'm so happy you're calling into our show. I've been trying to get a... I'm trying to have fun.  I have to tell you, I'm being honest, and I think this is a testament to his mother. He was very wonderful, and he got a lot out of me. We talked about a lot of serious things. I felt very comfortable telling him a lot of things. And the kid's good. I think he's got potential to go places.  I have a little bit of a cold. You can see it's a mucus. I have a little bit of a cold since the last time I talked to you. But it's me. What are you talking about? Well, I'm glad you enjoyed it. I enjoyed it very much. You're a dog. You know, I love you. And sometime I'd like to talk to you again about how you want to fuck me and not marry me. You got it. Well, actually, thank you. It's actually the great Rachel Butera calling in. Have you heard of her? No, but that was incredible. I was so nervous.  Oh yeah! Oh, fuck yeah! Oh, how kind.  wouldn't know it was you would know it wasn't Rosie means you just talked to her. I knew it wasn't but I wasn't sure if it was a I didn't know where it was gone. I'm sorry. That was an amazing Rosie though. Yeah. You know what's cool? I got so many hits for my Rosie interview. I'm just gonna have Rachel just pretend to be Rosie. Can she do other celebrities? Yeah. Oh, actually. Yeah. Would you like to interview the great Wanda Sykes? Yeah.  You're so good. Would you do the interview as Wanda and not tell anyone? Yes, absolutely."
}