{
  "video_id": "x08xZ_FT_mI",
  "transcription": " Hey guys, I've been a little bit MIA. It's been about three weeks and now I'm doing this on the beach. Why? Let me just explain a little bit. About three weeks ago I said to you guys that I was going to come to the Philippines and run a motivational forum and that's exactly what's happened. Here we're going to go take a seat and we're going to talk about this. Alright? So what's been going on? I've come here to the Philippines. We've finally run the forum and a few days after that I went off to the Southern Islands, a place which  isn't commonly visited because of the news you know on the news they're always saying don't go there you're gonna get kidnapped blah blah blah I have a couple of friends who live there who've been asking me to come they say it's beautiful so I stopped listening to the news I listened to my friends and we went there this is what it looked like  How good was that? Not even joking I don't even think that that video does any justice to how beautiful it actually is in real life  real life. Let me show you the other things that have happened since I've been here. Hi, thank you guys so much for arriving and being here today. Turn to the person next to you or a neighbour and share who you are, how you found out about this event and something good that happened to you today. What do you think about this? Yeah, that's fine.  6.07am, oh my god I am so sleepy right now I'm off to a remote island so I've told everyone if you can't get in touch with me it's because there's no internet Bye, where are you going? It's a secret beach It is so, so beautiful  It is 9 I think p.m. And we've just come back from the whole trip and now I'm at a hotel which I'm staying at before the workshop for tomorrow  This is the Almond City Hotel.  So we're gonna go and have some lunch. How nice is it?  busy like there's a lot of updates in those social media platforms yeah my insta stories are pretty up-to-date so come through this is my Instagram handle come here give me this emoji the waving one if you've come from this video and say hello if you liked this video give me a thumbs up if you have any comments or questions pop them in the comment section down below I'll see you guys really soon  you"
}