{
  "video_id": "X40MPQXah9U",
  "transcription": " Relax fat  Hello! Hello! Hi! Oh, honey. Look how cute she is. Oh, thank you. Hi. He's a very nice man. Vincenzo. Vincenzo, I'm... Oh, sisters. How nice.  The new Fiat 500L. With four doors and five seats, it's very family friendly. You left Rusty alone in your apartment? It's okay, I got him one of those shock collars. Oh, that's so cruel. No, no, no, no. It's part of his training. Can I get you a Bud Light? My roommate's got some in the fridge. Thanks, Rusty. Cool.  smooth, real, Bud Light. So what's up? You wanna hang in or you wanna go- It's all here. Boy, what an exciting game, Bob. That's right, Jim. What could be better than this? Hey, baby. Do we know? Dude, what are you doing? Bumble!  Hi, Georgia, I just wanted to apologize again for what happened at the company picnic Hi, Georgia, this is hot try Jack's hottest sandwich yet His new blazing chicken sandwich has spicy crispy chicken ghost pepper ranch sauce and sliced jalapenos  You better be holding a sandwich.  Reebok Skyscape. So comfortable, you'll forget you have them on.  Hello? Who is this? I'm here with the boys now.  Hey! Hey!  I'm going to lunch. Any suggestions? Do not get what I got. I'm way too full! My lunch was a little light. I'm still kind of hungry. How about Arby's new Market Fresh Grilled Chicken and Pecan Salad? Mmm. Not too heavy, not too light. Perfect lunch harmony. Uh-oh.  Choose Honey Wheat Bread or our new whole grain flatbread wrap. Arby's. It's good mood food.  Starting on a slope can be much more risky than we imagine. Citroën C4 with help to start on a slope and intelligent traction control.  Sit down, Benjamin. Okay. With the taste of bourbon... Mrs. Robinson, you're trying to seduce me. It'll make a man out of you. Aren't you? The Jim Beam Bourbon Burger. New at Carl's Jr. The Manga Tonoka River provides fresh water for the Tui Brewery and a refreshing dip for the workers. Gorgeous workers.  I don't make it out.  Quack.  I would tell you you're the brightest star in the sky. Yes, you are. Everything I ever wanted.  you"
}