{
  "video_id": "x4QU-Ds4px0",
  "transcription": " My lovely wife Claudia was diagnosed with a sort of brain cancer that held no hope for a cure or remission. She was traveling alone and collapsed while changing planes in Newark. I found someone to look after the kids and flew there by the next morning. Back home, life was somewhat normal at first. She stepped back slowly from the kids' daily care. We traveled some.  She continued to visit daily with her friends. She was from Columbia, South America, and we had lived in several countries, and at each transition in life, she'd gained more friends and rarely left any behind. A time came when Claudia could no longer stand without falling. Her treatment ended. We were told to look for a hospice. She needed that continual support and care. She decided on one particular hospice because the chef told her that he would make her paella.  We had visited every restaurant in the city that made paella in the previous few months, searching for the best one. She continued her life in the hospice. Friends visited every day, several from out of town and out of country, bringing their stories and their food reminiscent of her home. Her weekly women's Bible study continued in the hospice chapel. Every day we would do something, go out behind the hospice to pick and eat raspberries, push her wheelchair through the neighborhood and dream of our next house.  decorate the room for Christmas, very prematurely. I managed twice to get Claudia home for visits. I rented a ramp, got her a wheelchair taxi, and a dozen friends came for potluck dinners. She loved the daily trips to the bathtub. As the months wore on, she could barely move, but when she was in the tub, she could float freely. I would play Shakira on the speakers, and we would dance.  bit more. One day she sent a flurry of text messages. The next day she could no longer do that. She lost her ability to speak. From then on, I was the one speaking with her friends as she listened, and in that way, she was a part of the conversation. To the end, her room was crowded, busy, and full of life. She lived for more than a year at home after the diagnosis and was in hospice for almost six months. She was alive every single one of those days.  except the last. Claudia had long told me that when the time came, she wanted to go before me, since she would not know how to live alone. She never was alone."
}