{
  "video_id": "X9ms7D2XF4k",
  "transcription": " Hi everyone, so today we're going to be solving this really neat puzzle called the pyraminx. This is a very easy puzzle to solve. I kind of am self-taught on this except for maybe a couple of like two algorithms and there's only two algorithms that I really need to know to be able to solve this really neat puzzle. By the way, the one I'm using here is the MoYu Magnetic Pyraminx. It has nice smooth turns to it.  and I find this a really nice hair mix. I don't know if I'd recommend it to beginners though because of the fact that it is maybe uncontrollable to them. So, alright anyway, let's get into this tutorial. So, obviously the first thing we need to do is scramble it up. There's many moves you can use. These moves like this, moves on top here. You can move these little corners as well. And you can move this whole edge which is basically the same.  thing is moving this but it just ends up a different color. Now I'm going to scramble it. And I suggest moving the tips quite a bit to look sort of different than the colors that you're seeing a lot like yellow on this side. It just helps vary, variate, you know, the colors. So here we have a nice scramble.  So, let's begin step number one. The first step is solving the first side, obviously. And what we're gonna be solving is the blue side. That's at least the side that I like to solve first. So you have to go to a side, the color solving I suggest for, I mean, it would be easier for you to follow along if you're solving the blue side as well. I mean, you don't have to, but here we go. Anyway, you start off with finding the side  that has all three of the corners of the color. So this is the color blue. Like this side wouldn't work because you see you have two blues here but you don't have the third blue. So it has to be this side because it has all three blue corners. Which these are the corners up here. These little things. So yeah. The next step is we're going to be inserting certain pieces into our pyramids. So that's  these pieces in the middle. We already have a couple, which is probably likely. So, we're going to sort of act as this is the bottom of the pyramids. We're going to put it down. And we're going to look around this layer to see if we have a blue piece. If you have a blue piece, there's going to be a blue and there's obviously going to be another color on it too. My color is red. So now you know that the red color  goes into here because this has red and blue so this has red and blue so this needs to go down there to match up right? but if you do that it'll mess up your pure mix and it will this one wasn't too bad but sometimes it can end up making all sorts of funky things happen so I'm going to teach you how to get this piece down into here  simple moves. And it goes like this. Now, that puts that piece in there. And now I have another piece that I can find the corners that it goes in between and do it. But this time it's on this side so you have to do it twice. So it goes down with the right, down with the left, up with the right, up with the left. And that puts that in. So I'm going to keep doing this until  all of them are in. And now I'm gonna... I think those are all of the ones on here. So now comes the next part which we have to put... we have to get these two in. But you realize this is right next to it and that makes these two go out of the way and you can't figure out how to quite get this in because it's not on this layer. Well this is not  hard to figure out. All I did was I just matched up these corners and put it in like that and then I took this and I inserted it like I normally would. Like that. And then I found the other one that was here and then I inserted that one like that. So now that got that done and we have to find this last one. Okay so we're gonna do  the same exact thing. I'm trying to go slow for y'all. And now we have this one, so it goes in this one. So now we have one more to put in, and the first layer is going to be done. Okay, this is when it becomes very easy. All you have to do is match up the colors. So we have that one, that one, and that one. And now we have to match up the colors to the actual thing itself. So green, or yellow, green, red. Now you realize that  So we have these corners out of position. This one is in position. This is the first case, or parity. So all it means is that these two edges in the front need to be flipped. This is really easy to solve, and it's one of my favorites. So this is how it's done. It just goes a little something like this. So it's basically the same thing as we did to insert the edge, but we're doing this for parity.  And now, here comes the next step. All you have to do is hold the pyramid, and then you're going to basically rotate it this way. And now you're gonna do the exact opposite, which is like this. So it was right side up, and then the left side up, and then the right side down, and then the left side down. And now I'm gonna show you some more cases. Before we move on to that next case, I do want to address that when you're building up this part, this might occur where you have something like this.  This is easily fixed by a simple move. You just move this whole part out and then you move it out to the side. And that basically breaks it off and then you can do the same thing to insert it and then you're done. So now I'm going to show you that. Okay so here we are at the third case or basically actually the second case and this is the only other thing that you might see is when all the pieces are either flipped wrong or just in the wrong position. All you have to do is  algorithm you might have to end up doing it two times but that's not gonna really be a problem all it is is so you want to hold it with these two facing you the two that are both incorrect and then if you don't have that just hold it anywhere and do this algorithm so it goes like this it goes right up right inverted up right sorry up and then right inverted and then  It might look a little something like this, which means you have to do it one more time. Or it might be where all the edges just need to be flipped, which is easy to fix too. So all you have to do is one more time.  Bye bye."
}