{
  "video_id": "xAfG9GHJ3Tk",
  "transcription": " Will and Grace are back. There's only one problem though. I hate that shit.  Somebody at NBC hates me because Will & Grace is back on TV.  The 16-time Emmy winner is back.  So this show just keeps sauntering in. Coming to NBC Thursday, Thursday, September 28th, the classic returns. The cast of Will and Grace reunites. I think it's really nice that we seem to have fan. City of Angels proclaim today Will and Grace date. Will, a sexually repressed fussbudget made of eyebrows, and Grace, dim New York spaz, are a hilariously boring couple of old friends who used to date.  until Will comes out as gay, dates one guy, and then never dates again. Meanwhile, Grace gets to do it with every celebrity cameo available. Their friends, Gross Queen Jack and Rich Grace Karen are present so the audience has something to laugh at. The theme song, the titles.  I think I have this option on iMovie. Is this the best they could do? Could it be any more stock and generic? A good time sure isn't coming when I hear this music. I wish I was gay. It looks like f***ing Dan Rather. I hate Will and Grace the characters. I feel like they're under some sort of 96  Makes them too stupid to accomplish anything in their lives. Watching Will seldom date was almost as painful as watching Grace date everybody who came through.  I'm Grace and I'm actually not sorry I'm late I just had to finish making my hot cocoa with homemade marshmallows I'm Grace and I'm an alcoholic I'm a boat full of hot gay guys in an open bar and might as well put on a bathing suit and start crying now I think I should start doing yoga I could get rid of all these negative feelings and open up and maybe I'll just start getting high again I don't have Grace I don't want Grace I don't even say Grace okay  So sad!  overwhelming selfish tendencies and monofocus. Either way, I wanted him to die. What the hell? Will and Grace, the series can't make up its mind if any of its characters are supposed to be punished for their sins or awarded for their bullshit.  I'm not interested in starring in a reality show, but thank you. On Seinfeld or All Way Sunny, you know the greedy gang is going to get their comeuppance and pay for their terrible deeds. On Ellen or The Drew Carey Show, even as our hapless stars get into one bucket of syrup after another, their behavior is deemed as likable and therefore deserving of a happy outcome. On Will & Grace, whatever.  Karen. Why isn't this show about Karen? American TV series just can't seem to wrap themselves around a wealthy, monstrous person that we still root for. Britain had absolutely fabulous, but on US shows, these type of characters are always regulated to the sidelines in favor of our boring protagonists.  Get with it, rich bitches! Why can't you headline a series? Barry. The horrible episode, Fagmalion, features Dan, Asshole's son, and the birdcage, Futterman, as bearded dork Barry, who's just getting his feet wet in the gay pool and has to endure Will's constant  over not being a living stereotype.  I'm a high fairy lady. So what do you two have to teach me? You got a 15 year head start and you're both alone. Now who's good then?  million identical queers in this series.  I'll see you around.  I say check out HBO's Looking, and if that's too dull and quiet for you sitcom fans, watch Please Like Me, it was great. Or The Real O'Neils was okay, I mean, it didn't really have anything else but a gay character, so if you liked that but want something better, you should check out Beautiful People from Britain. It captures the gay Malcolm in the middle feeling it clearly was going for.  leave them in their tickled ivories in the past and maybe write some sort of new gay character that, oh I don't know, can get laid? Not that there's anything wrong with it. Wills! My father's great. I get it. Bad gay men.  I went out and got a BJ from a guy."
}