{
  "video_id": "xOlcLqh-1nY",
  "transcription": " You  You've got 2,100 riders, you've got 600 volunteers. All of them have a story about Children's Hospital and throughout the weekend we hear so many of them. I had cancer a little while back in 2002. I had a malignant brain tumor called a choriocarcinoma and I had roughly six months of treatment. That's four months of chemo and almost two months of radiation. It's a lot of fun, this ride.  very well supported, but also that it benefits Children's Hospital and I owe so much to them that it's a good way to try and pay back what I owe. There's no way I can really pay back. I just always think it's great to see the kids, you know, finish a ride, complete something that's difficult and challenging for everybody else. It just gives them something to kind of build on for themselves for the year. How did it feel when you turned the corner and you hear everyone shouting? That's the best part. It makes all the kids feel, you know, that they're really doing something important.  I was riding alongside somebody who was in Team Courage, a survivor. I was just struggling up the hill and having a hard time of it. Then I saw this person there that was a survivor that was given back for what had been done for them. It was very moving. There was a little girl diagnosed with leukemia the same time I was.  She was totally cured, everything was great, and her lungs failed. So she passed away about six months later, and she's just been a real inspiration. She's been my hero. It's amazing to see all these people coming together around this one cause, and that's the Children's Hospital. And it's people who might not have ever been touched by children's before, but they see the kids, they hear other people's stories about their children being treated, their grandchildren being treated.  and they get addicted, just like we all are to this cause. Kanna was born a year ago, June, and everything seemed to be okay. And then at about two and a half months, she got a virus and she seemed to be okay, but her mother was very intuitive and felt something was not quite right. She was at Children's for five months. They did phenomenal things.  They worked with her and worked with her, but her disease was very, very rare. And finally she passed away in February. To think that that many people are out here with the single focus of trying to raise money for such a great cause, it really is very inspirational.  you"
}