{
  "video_id": "XWAehAfDsHg",
  "transcription": " You guys, so as you all know the Champions League has just happened. I just finished watching the final two matches. Manchester City vs Tottenham and Liverpool vs Porto. And a lot of this stuff didn't really go to plan as I thought it would. So I recorded a video with my buddy Zeeshan a while ago and I never actually put out the video. We predicted the Champions League quarterfinals. Never managed to put it on my channel but today I'm going to be reacting to what your  talking about and give you a little scoop of what happened in the previous games. Let's do this. So, first up is Tottenham vs Manchester City. Three, two, one, Manchester City.  after like 25 minutes and then the freaking offside goal that Sterling scored at the very end. Super unlucky but props to Tottenham for getting through. I'm kind of happy that's the case. I'm really surprised they did it without Harry Kane as well. Lorente stepped up against Manchester City. Really didn't see that coming. All right, next one. Liverpool versus Porto. Crazy. 3, 2, 1. Liverpool.  Yeah boy! Alright, this is probably one of the easier predictions. Liverpool beat Bayern Munich. If they lost against Porto, it would be a pretty bad slip. I'm sure most of us predicted Porto. I mean, Liverpool. I'm happy, you know, that they're in the semi-finals against Barcelona, which is the match we're looking up next. Barcelona vs Manchester United. 3, 2, 1. Manchester United!  Get the f*** out of here you guys.  Real Madrid and now Juventus?  already beat two massive teams. Who do I think is going to win the Champions League at the end? I'm going to give it to Barcelona. I feel like it's going to be tight against Liverpool and then they're just going to go all out in the final. Everything's up for grabs obviously. I didn't think Ajax or Tottenham would reach this far and they did. In order of which team is more likely to win and which one isn't, I'm going to say Barcelona number one, Liverpool number two, Ajax number three, Tottenham number four. What do you guys think? Let me know in the comments below. I hope you enjoyed this video.  If you did, please hit the like button, subscribe if you're new, and I'll see ya all later. Peace."
}