{
  "video_id": "xzjc8pPu1ZI",
  "transcription": " God, we just thank you Lord for this beautiful day. God, I thank you for the privilege that you've given me to spend time with Joelle and Jen. God, I pray that you would bless us with your grace and your love.  that as of right now Lord, you would start to bless their marriage, their family, their future. God, I pray Lord that you would leave your throne tonight. Lord, that you would be our guest of honor. Lord, that you would be in the midst, that you would be seen and felt by everyone who is here. And God, we pray Lord that you would be a witness to the vows that Joelle and Jen will exchange later. And God, I pray Lord that you would just bind them and knit their hearts.  God, I pray Lord that you would protect their marriage. God, that you would not let the enemy have anything to do with them. So God, whatever we do today, whatever is said and done, we pray Lord that it would bless you. We pray all this in Jesus' name, amen.  you  Jaron, the first week I met you, I knew I was gonna marry you. I'm still not sure whether God gave me a supernatural confidence or I was dumb and got lucky. Probably both. Either way, I get to stand here before you today and become your husband.  Jen, one of the first things I noticed about you, other than your Chinese accent, was your wisdom and maturity. The wisdom that the Bible calls us to ask for, I saw that in you. I could tell immediately from our first Bible study at camp that you truly walk with God. You are incredibly beautiful inside and out. Joel, you always call me your Taiwanese princess. I know part of it is because you're making fun of me, but you indeed are.  You treasure me starting the way that you look at me. Your gentle words, your consistent company in all seasons of my life, your relentless pursuit which started back in camp. Through you Joel, I have been restored to believe and see myself as beautiful and loved by God. I promise to continuously devote myself in the Word of God and in prayer because I know only when I'm filled with His love, I'm able to learn.  Love you, right wing. I'm honored to have someone like you finish this race with me. And I'm humbled to lead someone amazing as you. I promise to lend you my shoulder to lean on when you tire. I promise to pray for you. And I promise to lead you only once God leads me. Well and Jen, by the power vested in me in the state of Texas, and as a minister of the gospel, I now pronounce you husband and wife.  Wherever God has joined, together let no man separate. Give me a kiss, you beautiful young wife. Now, would you all please rise. Join me in welcoming your guest of honor. A big round of applause for you, Mr. and Mrs. Joelle and Jennifer George.  so  so  Oh  you"
}