{
  "video_id": "XzN4MfKGwAo",
  "transcription": " Every day, McDermid® Enthone® anti-corrosion coatings are hard at work protecting consumer products, such as passenger vehicles, from premature corrosion. As well as protecting, these coatings must meet other tough requirements. No change in the dimensional tolerance, environmental compliance, global availability and consistency.  What makes up these high-performance coatings? At the heart is a sacrificial zinc or zinc alloy coating typically 8 microns thick. This coating is then protected by a very thin passivate layer consisting of chemically formed mixed metal oxide films. Finally, a top coat can be applied to further enhance properties such as corrosion resistance of friction control. Depending on the specific application,  Coating engineers choose Enthrobrite, Envirozin, or Ken-level zinc plating systems. Alternatively, for the ultimate in corrosion-resistant coatings, they can select from Almac, Enviroloy, or Zincrolite zinc alloy systems. These coatings are approved and specified by most leading automotive manufacturers and component suppliers. They can be found on components such as fasteners, braking systems, and fluid transfer tubes, areas which are typically subject to road dirt and  salt, as well as temperature extremes from cold winters to the heat generated from the engine and transmission systems. For joining aluminum metal body sheets and inhibiting galvanic corrosion, ALMAC-coated high-tensile rivets have been proven to meet industry demands. To protect the zinc-rich layer from white rust corrosion, trivalent chromium-based passivate coatings measuring less than half a micron are applied. These passivates convert the metal surface into a complex mixture of chromium  compounds, giving outstanding corrosion resistance. Another area that McDermid Enthone rigorously tests their TriPass passivation technology is the freedom from prescribed materials, such as hexavalent chromium compounds. Research continues into new TriPass passivation systems to ensure that McDermid Enthone customers have the next generation technology available to meet future environmental legislation.  Pioneer the new breed of mixed inorganic and organic topcoats which give the benefits of higher corrosion resistance and compatibility with trivalent chromium passivation. These topcoats adhere tightly to the passivate film and give a tough barrier coating. Where modification of the coefficient of friction is required, our torque and tension range of dry film lubricants offer a very low standard deviation and an integrated UV tracer for batch identification.  to develop these technologies, helping our industry partners deliver consistent coefficient of friction properties on new fastener systems such as self-cutting thread screws. Our anti-corrosion coatings are also used for protecting heavy construction equipment, architectural components, and window fittings. Whether protecting automotive components, equipment for the construction industry, or helping to ensure electrical conductivity, our zinc-based systems, trivalent passivation,  and topcoats continue to consistently perform, even in the most demanding applications. We are proud of our heritage in anti-corrosion coatings. However, we continue to develop new sacrificial coatings, passivates, and topcoats to improve corrosion resistance and meet environmental regulations. McDermott Enthone are the global partner for high-performance corrosion-resistant coatings. Contact us for further information on satisfying  your requirements."
}