{
  "video_id": "xZQCrBEWOOM",
  "transcription": " Virtual reality is going to be part of our world. I think when Mark Zuckerberg bought Oculus Rift for over $2 billion, just a few weeks after he met me,  Palmer Luckey, the 19-year-old kid who created Oculus Rift, I think he changed what was going on in virtual reality. And he brought it from the labs of academia and the Department of Defense and aerospace, and he made it possible for today. Mark thinks that virtual reality, or he's gone on record as saying that virtual reality is going to be the next new computing platform. I don't know if it's going to be the next new computing platform, but  it's for sure going to be the next new media. There are literally hundreds of studies about how virtual reality can change behavior. So there's actually an opportunity for people who really care about solving society's big problems to actually have a new tool to be able to do that. So what we're doing, for example, and we're the only  people we know who are trying to build this at scale. There are others who are using it in small clinical practices, but we're unaware of anybody else who's trying to build this at scale. We're using fully immersive experiential technology, like virtual reality, to go and target society's biggest problems and see if we can make a difference in that way.  interest from large corporations like Travelers, Capital One, Ford Motor Company, H&R Block. We're having big interest from some of the most prolific hospitals in the country like Children's Hospital of Philadelphia, CHOP, Children's Hospital Los Angeles, Cedars-Sinai Medical Center. There's an opportunity to make a real difference in the world with virtual reality and I think that that's the big opportunity.  and hopefully will be a part of it.  can create applications. So there's lots of cool, quote, cool applications being developed by one-person shops, by a young person that's trying to make his mark. What's different about what we're doing, and I think what really needs to happen, if in fact we're actually going to use this to address some of society's big problems,  is that you actually have to know and understand the science behind it. And that's why at Applied VR, what we've done is we've connected with and developed relationships with the leading academics in virtual reality. With people like Jeremy Balenson, with people like Skip Rizzo at USC, probably the leading expert on the use of virtual reality and PTSD. With people like Walter Greenleaf, a neuroscience researcher up at Stanford, who spent 27 years doing medical research in virtual reality.  reality. And I think what's happening right now is there's lots of demo applications being released, some even around things like anxiety, some or others are really just games. But they're being developed by people that know how to code but don't know the science. What's really important is merging the science behind it all with the technical capabilities to create something that really can effectively change human behavior in the  this possible."
}