{
  "video_id": "XZYJBN5goeM",
  "transcription": " My name's Ben Williams. I'm in second year at Oxford University, Hertford College. I played on the MCCU scheme last year. This year I was appointed captain of the MCCU and I'm also captain of Blues cricket at Oxford so I've got the balance of both.  What is the scheme for university students?  allows students to have a shop window to show their abilities and their skills on the cricket field and hopefully get picked up by a county. So on the one hand it's a stepping stone into county cricket and professional cricket, and on the other hand it's a competition within the universities including a two day competition, a one day competition and the T20 competition. Today we have a game of first class cricket between Oxford MCCU and Worcestershire County Cricket Club.  The count is at this stage of the season do bring their first teams down to play against us, which is a great experience for the students. First day of three days and we're in the field. We have a huge amount of academic commitment and getting on the scheme didn't affect us getting into university itself. It was first of all you have to get into the university and then you can get onto the scheme. That's one of the biggest things which a scheme teaches you is the way in which you  you need to manage your time to be able to spread yourself across two or three different disciplines without sacrificing too much on one I suppose. The programme starts November and right the way through to the end of June the guys are basically living the life of a professional cricketer. They're in probably six times a week in the winter, training, either fitness training or skills training or that type of thing and then come summertime it's a busy time. They've got exams, they've got essays to do, they've got lectures to get to and they've got lots of cricket to play so time management becomes quite important.  But the opportunities cricket-wise are there. The objective is to get county contracts and they've been very successful. Quite a lot have gone on to play county cricket and got county contracts. It's hard work for them because it's a bit like the men against the boys actually, but that's the best way to learn about the game and that's how they will learn. It's an ideal situation that they've got a chance of getting a degree and they've got a chance of forwarding their cricketing careers at the same time. They're very, very lucky. Particularly if you want to try and make a go of it as a professional cricketer.  all the opportunities are here and it really is the next step so it's fantastically exciting if that is your aim."
}