{
  "video_id": "yIVDslDpXF4",
  "transcription": " In the summer we do a little bit of a combination of different things in our curriculum. We have students ages 2 up to age 12. We break our children into groups by age because it's a physical day so we want them to be with their peers on a physical level. Every child has a swimming lesson every day so five days a week they have a 40-minute swimming lesson. We have certified lifeguards and swimming instructors and our very uniquely designed  designed swimming pools. So even our younger students, our two-year-olds, can stand comfortably. You're going to see a huge improvement with your children in swimming. It's all individualized based on the child's ability. And they rotate throughout the day to different activities. So they do swimming, they'll do arts and crafts, we'll do organized games and sports, simple cooking projects, music and dance. We've added drama to that class. So now our children are able to use our stages and put on little plays and skits and get very comfortable with  public speaking. We work on sentence structure and proper grammar and diction. Our teachers in Apple work year-round, so our summer camps are actually run by teachers. In the summer, we also do Super Kids, and Super Kids is the time when we continue with the Montessori as we do during the school year. They have Fast Track Kids, which is a gifted and talented program that we offer during our school year, where they can interact with a smart board. The children who are four years and older go on field trips throughout the summer. We have in-house events. We have the Reptile Man come and  brings all kinds of great reptiles. Carnival Day, face painting, the Jumpy Castle, which is one of the favorites. And then we also have our counselor and training program, which goes up to age 15. We're working on leadership as well as responsibility. We also introduce them to CPR and first aid so they can learn those skills as well. So this is very beneficial for all the children, which also helps with that summertime slump because we don't have that in essence because we're continuing where we left off in June and so there's no gaps in terms of their learning.  learning."
}