{
  "video_id": "YkM_ZlUI5J8",
  "transcription": " Vice President under Abraham Lincoln moved to North Bridgton from West Virginia when he was a young boy. Bridgton was his local high school where he attended for all four years. A dutiful citizen, James enlisted in the Navy during World War I and served his country proudly. After his honorable discharge from the service, James returned to Maine where he went on to study at Bates College.  James next set out as a merchant seaman. An experience that saw him travel through the Straits of Magellan. After returning to the States, James tried his hand at a number of different ventures, including trading with the New York Telephone Company and eventually entering its engineering division. Acknowledging a real estate boom at the time, James also dipped his feet into the real estate waters. A venture that  was short-lived after the Great Depression reared its ugly head. As the saying goes, when one door closes, another one opens. Throughout this time, James remained loyal to his academy, serving as a member of our board of trustees for over two decades. He would eventually go on to donate his home as well as 30 acres of property to the school. Next time you walk past Hamlin Woods, across  the from the tennis courts you may want to pause a moment and thank Mr. Hamlin for his generous gift. James passed away on July 12, 1994, only months before his 97th birthday. For his extraordinary contributions to the art of silver and metalworking and for his long-standing commitment to Bridgton Academy, James Hamlin is being posthumously inducted into the Bridgton Hall of, Bridgton Academy Hall of Fame in the  Tribular category. At this time, I'd like to invite to the stage Mr. Kit Dover, Bridgeton Academy class of 1968 and stepson to James Hamlin to accept his posthumous honor on behalf of his stepfather.  Thank you Owen and good evening everybody and I didn't realize this was going to be such an event Tom. Tom asked me to do this and I was very happy to and I'm very happy to be here and to be able to share some some stories about Jim and my relationship with Jim and and so on.  It must have been around 1965. My mother met Jim. And my mother at the time was 39 years old. Jim was my age, okay? So there was quite an age difference. And she came in and helped him in the shop. And he asked her to be his assistant. And that's how she got to know him. Well, one thing led to another, and there was a romance, and well, you know how that happens.  They shortly thereafter got married. And me and my my two brothers, teenagers and my mother all came to live with Jim Hamlin. And Jim had never had children before. So can you imagine? We showed up and he took us into his home and great, great guy, unbelievable human being. I'm honored to have lived with  Jim and known Jim and remarkable personal story. Jim as Owen said, Jim was was born in Thacker, West Virginia in 1897. And during his lifetime, he went from horse and buggy to seeing a man put on the moon. And Jim was a man of the times. I mean, it was a time in America when he was a younger man, when it was an age of puberty.  where there were no limits. I think Albert Einstein said it was a time of innovative minds. And Jim, you know, was made of that fabric. He was so interested in science and nature and everything to do with progress and achievement. And at the same time, just a very warm human being. You know, some of the things, as  teenage children. It must have been his worst nightmare to see us, us come. But he, you know, he took us in and he was like a second father. And he, we always had fun with Jim, my brothers and I. And he had a lot of cool things, sayings that we thought were, were funny. If we were here today, he might say something like, oh gosh, all hemlock. I mean, that was one of the things he'd say, gosh, all hemlock.  Or you know some of his other things it's a It asked him how are you today Jim and he might say I'm as keen as a barn rat That was one of his favorite sayings or he was he was as fine as frogs here That was another one Would be sitting at the dinner table and you know instead of saying pastor brother. He would say pastor Montague What's my idea? Well? I don't know what Monica is I actually  Google it and I still don't know but he was butter. I guess it was butter. So we passed him on again. Okay. So he was he was a good sense of humor. I had the opportunity to to be his student in the shop, the silversmithing shop. And he taught me how to make a bowl from a disc of copper, how to raise it with a raising hammer. You know,  his shop, many of the tools that we used, he made himself. Remarkable tools. And to watch him work, he was left-handed. And when he was working, you know, he'd work with hammers. He had all kinds of hammers, raising hammers, planishing hammers. And when you saw him swing the hammer, it was unbelievable. So, quite a guy. And I'm very happy to be here. And I'm sorry that my mother can't be here. She's still alive. She's  She's gonna be 94 next month. She's in Fountain Hills, Arizona. She would be here if she could be here. But I had a whole list of things to say, but I'm kind of way off script and I don't know what I've left out. But remarkable human being. He would have been very honored to be here. One other thing I'll share is when I graduated from BA, he was the president of the board of trustees.  And I was a townie, I didn't have the same experience as many of you guys have had because when I came here I was a junior because they had junior, senior, PG. So I was a junior and I was a senior and when I graduated my stepfather Jim was on the podium and he did the, you know, he was the president of the board of trustees, he did the presidents of board of trustees do. I can't remember what he said. And I had a chance to speak to it at that  graduation so we're on the on the dais together and I don't know who was more nervous me or him he he hated public speaking but he would do it and uh so it's just a very memorable memorable uh thing but I would also add that uh to what Owen said and that is if you get a chance you can take a walk through the Hamlin woods uh it's beautiful the trees are huge now much bigger than they were when I was in there last but um  Anyway, I'm very honored to be here to accept this award on behalf of my stepfather. I just want to thank the Bridgton family for their kindness in asking me to be here for this event. And I know Jim would be very, very honored to be part of this. So thank you all very much. Much appreciated.  Thank you."
}