{
  "video_id": "YPqNYBuUguY",
  "transcription": " Well, this is what you look like after four hours of sleep Yeah, we're off to Amsterdam today excited about that. We're going to Schiphol. Yeah, we're going to fly to Schiphol anyway. Yeah, so we're currently in Heathrow right now and we're going to Schiphol. So Amsterdam is a city that we've been to several times and I feel like every time you go there's always a plan or there's  there is something you want to do and stuff and I think this time it's just through the plaza to the window. Right, I guess it's time to go then.  We are finally in Amsterdam just left Schiphol Airport and we are headed to the hotel  which is coincidentally called the Lloyd Hotel which someone is quite pleased about. Ubers here are not like Ubers in London. Actually the Uber is Jaguar. London goes for sensible, they go for like Toyota Priuses and like reasonable cars or kind of used cars that the owners had before. But they're good there as well because they're hybrid cars. Everyone knows they're good. They're still not swanky. We're not talking about good here. We're talking about fancy.  The style of a substance. Yeah. You ready to paint the town red? Yes. This is incredible. You don't even expect to see this here at all.  Hey, hey right As you can tell I have been napping But it's so good. I think it's one of the biggest things like  When you're traveling that you really need but you never make the time to do as well So I think because like we left London quite early and we've been traveling before this as well. It was just nice to just Arrive here, especially we have a bed because I have huge that is when you have a bed that huge to just actually just relax just make the most of it But then again, this is in keeping with the plans that we have though to just actually just lean into things a bit more Stop trying to make things happen and just relax and see just go with the flow really  I think the next couple of days with life it's just feel like a holiday like less of less of kind of like a Mission to check every single thing and see everything and just more to just relax really enjoy the city I am hungry and so I think we're gonna go out now and look for some food  We're just gonna head into lunch at Bokkers which is just here. Apparently it's really good, we got that from a local in Amsterdam. Who is here? There she is!  Hey! You sneak in and put a photo of my eye there. So this is Milu's recommendation here. So we're going to have to give her all the credit. Not us.  I promise I will be so good Hold me in your hands Take a glass Don't be scared I'm right here Even though You don't roll Trust me girl  So it has been freezing outside and we have taken that as our cue to head back to the hotel and warm up before dinner because there is nowhere I can do that cold in this jumper. It just has a t-shirt on and the jumper as well. So yeah in the spirit of kind of doing things as directed by the city, the city  So we should come back to the hotel now. Good morning. It's our final day in Amsterdam this morning. Yeah, I figured we might as well have a laid back morning this morning.  You don't know what's in store But you know what you hear Close your eyes, lay yourself beside me Hold tight  We don't need  The slowest possible speed at London.  You"
}