{
  "video_id": "Yw5_IfvHueo",
  "transcription": " But if you recall the temple that we saw, or the model of the temple that we saw at that Jerusalem miniature city.  You  This is where things happened.  The shop is on the right.  the mud masks and the products from the Dead Sea and also there's all these beauty things. I always pass through this area pretty quick but the women get lost in here. But then out here there's jewelry. This is at Qumran by the way. There's jewelry and then my favorite section of course is the books. This is my favorite place. Ah, somebody else's. But my favorite place is the books. Got a lot of books on scripture and the temple and  This is just a lot of fun here. And then they have t-shirts and a lot of other things. Oh, there's one of our pilgrims. And there's a tour of the shop that we're at here in Qumran.  We can start with the Hasmoneans, who were the first to discover the advantages of this isolated cliff in the heart of the desert. Or we can start at the end, with a dramatic project of Assad excavations, where the aliens saw a magnificent fortress here on the mountain, which was to be a sanctuary in troubled times. And believe me, he really had troubles. Herod, like any other king, built his palaces to the highest standards of his day.  Okay, everybody's on Masada getting ready to go on the cable car. And there it is. Swiss made. It is going to take its long journey and zoom all the way up to the top on those cables just like this. And then swoop up to the station.  And there they go up the mountain  And there's the other one coming down. And here they come back down.  I don't.  We've just arrived at the Temptation restaurant here in Jericho and I'll show you where everybody's going. It's a nice place. Nice shops with a lot of the Dead Sea products here and all kinds of other things. Temptation restaurant.  Here's an idea what everybody gets to eat today a lot of nice foods Everything is very fresh here in Jericho because of the oasis and a lot of drinks and wine Things like this so Here we are oh more falafels chicken kebabs  rice, different kinds of vegetables again. So, and then down there is the first level. There's Amr and our group is coming in. We're getting off the bus here and here's the preacher.  Deacon Larry is going to do the preaching here today. We're going in the door here to the Church of the Good Samaritan in Jericho. This is the School of Santa Maria of Jericho. And we're going to have Mass here with the sisters in the chapel. Out of 40,000 people who live here, only 500 Christians.  You the priest? Not yet. This is a very nice Christian school here and it's mostly all Muslim children too. I don't think there's very, very few. And here's where we're going to have mass.  you"
}