{
  "video_id": "Yy7lpWBualA",
  "transcription": " 30 hours later and we finally made it to Thailand  24 hours stomach bug labor and we are out of our hotel in Beijing, finally. So we came out to the Grand Palace, the temple of the Emerald Buddha. So I hear it's just nuts in terms of decoration and in terms of people everywhere. And nuts in terms of how hot and muggy it is also. Not expected coming from the fall weather.  But so there's a couple of things like we couldn't show our knees while we're here, so I had to go buy some of these These crazy pants to cover up my knees Had to pay a hundred baht on the street there's people all over the streets trying to get us to pay different prices But I asked It's like some guys from the UK who knew some cheaper stores along the way so we went there but anyways  Now we're just kind of chilling still recovering a little bit from our stomachs from all the travel, but hopefully we'll get over that soon  You can see right behind me, this is where everybody takes their shoes off to go inside of the Buddha temple. They just leave them out here and they say that if somebody steals your shoes, it's not their fault.  this  right on the verge of fall. We're kind of getting that mindset of getting excited for fall. But instead now we're having to readjust to extreme humidity and heat. But yeah, I mean we're having a good time so far and we're enjoying ourselves here in Thailand.  Just went out and got some snacks. We're gonna go back in for the night. Probably just take it easy because Aubrey still isn't feeling super great. Just, I think dehydrated and jet lagged. But I went and got us some various snacks. The 7-Eleven, that's a cross-contact, that's Expressway that we're right on. You know, not maybe super entirely sure what all I got, but we're gonna give it a shot and see what we can eat a little bit.  I haven't really gotten out and tried too many crazy things yet, but I don't know. We'll see. Is this thing on? Hello. I was awakened early this morning by Donnie and told to do a video, so here I am. Cheers!  So, the plan for the day is... what was I planning again? We are going to take it easy this morning, go get lunch, and then go see the temple of the reclining Buddha. It's supposed to be really cool. And then get dinner. That's pretty much the game plan for today. Feeling a lot better today.  so hopefully... ouch! Hot tea! Hopefully we'll be doing pretty good today. I think that is it. Is that it, Donnie? Okay, he's going back to bed. Bye!  so  So I really don't know what that dance was. It came with no explanation but there were some nice leg lifts, some nice jumping on each other, some sword swinging. But man, right when we walked in, that's exactly what we saw immediately. There was just music playing so we walked right over there. We passed the giant Buddha to go see what the show was. But yeah, then we checked out the giant Buddha so you'll see the clips of that.  that  behind us. It's a big Buddha.  He's huge! We're on the back side now so that's Buddha booty. But here's his big feet. It's really cool and it's like pretty paintings all around too. There's a lot to look at. But it's really neat.  This is one of the most famous markets in the world.  So I'm pretty sure he's not supposed to be doing that  you"
}