{
  "video_id": "ZdH9w5-xPZY",
  "transcription": " Down here sentinel optimus forget your place I Bring you Cybertron your home and Still you choose humanity You were the one who taught me freedom is everyone's, right?  Then you'll have to go through me. Okay, I gotta try to help. I have to. We need to stay here, stop. You're gonna be fine. Okay? I promise. I gotta get to that pillar. Charge the pillar! We got autobots!  Reinforcements! Decepticon ships! Fire Optimus! We took an effective fire! I need those tow-hawks on scene, now! I got a cover for Optimus!  Trigger the pillar! Restart that pillar! Trigger the pillars! I can't hold them! The ships have us pinned! No!  Ten seconds! Danger close! Spark Lima, Echo Echo, one sword, two five zero. Positive service contact. Target ID. Target acquired.  Dylan! Wait! No! Shit! Dylan! Stop! Stop! No! You can't do this! Okay? There's only one future for me.  Cybertron, you are saved. At last.  Oh, have you come to surrender? Was it all worth it? Obviously. All your work to bring Sentinel back, and now clearly he has all the power. It's actually almost tragic. You dare lecture me, slave? Your Decepticons finally conquering this planet, and yet their leader won't be you. It will be me. It will always be me. In any minute now, you'll be nothing.  But Sentinels bitch. Racket! Die! You chose sides? You chose wrong.  Always the bravest of us. But you could never make the hard decisions. Our planet will survive.  We were gods once, all of us. But here, please, there will only be one. This is my planet.  I just saved the whole of the world. You think you're a hero? Huh? You think you're a hero? No. I'm just a messenger. The pillar's still connected! Kevin, swing it up! Speed! Get through, get through! Let's do this! The pillar's still connected!  No! We need a truce. All of us.  I want it to be back in charge. Besides, who would you be without me, Prime? Time to find out.  Optimus, all I ever wanted was the survival of our race. You must see why I had to betray you. You didn't betray me. You betrayed yourself. No, Optimus!  I"
}