{
  "video_id": "ZIdFAGJrlCw",
  "transcription": " Wow, what a great sound that is. This is the sound of the new Cayenne Coupe. Do you hear the sports exhaust pipe? This is how a true Porsche is supposed to sound.  The Coupé looks much more progressive and athletic than the Cayenne. Although the Cayenne can stand up for itself of course. Its development is based on the third generation of the Cayenne, which already  looks very progressive. The coupe is longer, flatter and almost 2cm wider at the rear. These minimal changes have a big effect. The coupe simply looks more dynamic. It wants to leap forward, you can really feel that. It just really, really looks fast. Even at first glance, it's obvious that this is a real Porsche. The lines are classic, traditional but at the same time forward thinking.  The roofline drops off very quickly to the rear and shouts out dynamism, power and speed.  coupe look more sturdy and more muscular. To keep the rear end so sexy and to give the car a great handling, the development department came up with an extra spoiler. So above 90 km in hour, the adaptive rear spoiler extends and provides even more downforce on the rear axle. Exactly.  will be excellent and in this department the Cayenne Coupé has a whole lot to offer.  in 3.9 seconds with a top speed of a staggering 286 km an hour. Awesome! As soon as I get into the car, I immediately feel at home. The carbon fiber elements are really cool. The Alcantara accent give it a unique and classy feel. The seating position is perfect, exactly as I want it. The Cayenne Coupé offers four people plenty of space. In the back, the passenger sits 3 cm away.  lower than in the Cayenne and this is a plus for headroom. The rear seating with two individual seats can be replaced by a comfort format. I love the panoramic fixed glass sunroof which by the way is standard. 2.16 square meters with an integrated roller blind. This carbon fiber roof similar to the one of the GT3 RS is available as an option enhancing the sports car look. The carbon fiber roof is one of three  lightweight sport packages.  this in one car for all those who require something special. That's it from me, if you want more information about the Cayenne Coupé, check out newsroom.porsche.com"
}