{
  "video_id": "ZVUAC3m48G0",
  "transcription": " Today I'm making the amazing Slimming World Chicken Casserole. This is super easy, you can all do it in one pan and then leave it for the day to cook down and then have it for tea. It's awesome. As well as being easy, it's sin free! Yes! Which is brilliant. You can also freeze it. If you could do a big batch, portion it all out and freeze it so it's ready for whenever you need it. You will need three medium onions,  3 carrots 1 leek 1.5 of swede 1 litre of chicken stock 2 chicken breasts Some salt and pepper Some Worcestershire sauce 2 teaspoons of tomato puree You'll need some garlic or some garlic powder 2 teaspoons of paprika 2 teaspoons of thyme and 2 teaspoons of rosemary First off you need to prep your chicken so cut it up into nice big chunks Once your chicken is prepped  Cut up your onion, your carrot, your swede and your leeks into nice big chunks. If you're adding mushrooms to this recipe, make sure you cut your mushrooms up at this point as well. Use a bit of your trusty fry light to spray the bottom of your pan that you're cooking it all in and add your chicken and then cook it until it's brined. Once the chicken's brined, take it out and add to the pan.  into the pan, your onions and your garlic or garlic powder. Once your onions have started browning, add your tomato puree and Worcestershire sauce.  all a mix together and add your chicken stock. Bring the mixture up to the boil and add your chicken back in. Give it a big stir and add all your cut up veg, so that's your carrots, your leeks and your swede.  Now it's time to add all your herbs, so pop in your paprika, that's two teaspoons. Pop in your rosemary, that's two teaspoons. And also your thyme, another two teaspoons. Again, give it a good mix all together.  Add a bit of salt and a bit of pepper Give it one big last stir Pop the lid on and then simmer for 30 minutes After 30 minutes take the lid off give it a stir and add your mushrooms if you want to pop some in You don't have to pop them in I love mushrooms, so I'm just putting whatever I've got left in the fridge Once you've put your mushrooms in if you're gonna put them in give it one final big stir  Stir and leave to simmer for about an hour with the lid off.  amazingly easy chicken casserole, perfect for Slimming World."
}