{
  "video_id": "ZYbw9M8RD7Y",
  "transcription": " Hi everybody, it's Letitia from Look What I Wear here. Today is the kickstart of one of the many DIYs that I have for you guys. And it all started on a stupidly cold and windy day. And I tie my hair up in a bun a lot when I don't wash my hair. But that's not the issue. The issue is that my ears were freezing.  and I wanted to find a chic way to wear your hair in the bun in the winter but also keep your ears warm. And I was inspired by Karl Lagerfeld and Dury with their fall winter collections with these really awesome leather headbands. So today I have a warm fleece lined hairband for you guys and it's great for the winter time. It's super easy to make. You're welcome to add designs to it. You can stud it however way you like. But I really love the simplicity of just the leather headband.  I thought it was super classy and very easy to wear everywhere else. So I hope you guys enjoy this video and I will talk to you later. Bye!  is slightly smaller so that it doesn't peek past the leather once you complete it. Place the fleece on top of the right side of the leather and sew a base stitch down both sides. I set my stitch length to 3.5 and add a looser tension to accommodate for its thickness. Don't forget to backstitch at the beginning and end.  After that, turn the headband inside out. If you've been a subscriber for a while, you know I love giving my projects a few good whacks to turn it right side out. You can give it a very light press at this point, just use a piece of fabric in between the iron and leather.  headband in and tuck the other end into it for a finished look. Make sure you test whether it fits or not because leather isn't terribly stretchy it's safer to go a little looser. Then hand sew on the fleece side to secure the ends and do not puncture the leather. I used an extra scrap because it was difficult to push the needle through. You can see my scrappy hand sewing methods but the good thing is that no one will see this side and as long as it's secure  It's all good! And now you're done! This would be a super easy and inexpensive gift to make for loved ones for the holidays and you don't even need to learn how to knit! I hope you guys liked this video.  video and I'll talk to you later. Bye!"
}