{
    "w2nmzwknVco": {
        "level": 0,
        "start_time": 0.0,
        "end_time": 81.76,
        "children": [
            {
                "level": 1,
                "start_time": 0.0,
                "end_time": 10.5,
                "children": [
                    {
                        "level": 2,
                        "start_time": 0.0,
                        "end_time": 3.5,
                        "children": [],
                        "caption": "In a stadium, a female athlete in a red and white uniform stands poised, holding a javelin with her eyes closed, as if in deep concentration."
                    },
                    {
                        "level": 2,
                        "start_time": 3.5,
                        "end_time": 10.5,
                        "children": [],
                        "caption": "The female athlete, dressed in a vibrant red and blue uniform, stands poised on the track, her gaze fixed on the scoreboard displaying her score of 16.91, as the crowd cheers her on."
                    }
                ],
                "caption": "Female athlete in a red and white uniform holds javelin with her eyes closed as if in deep concentration . The athlete, dressed in a vibrant red and blue uniform, stands poised on the track ."
            },
            {
                "level": 1,
                "start_time": 10.5,
                "end_time": 25.5,
                "caption": "The female athlete, wearing a red and blue uniform, stands poised on the track, her gaze fixed on the finish line as the crowd cheers and the announcer's voice echoes through the stadium.",
                "children": []
            },
            {
                "level": 1,
                "start_time": 25.5,
                "end_time": 30.5,
                "children": [],
                "caption": "In the stadium, a female athlete in a red and white uniform stands poised, her gaze fixed on the track ahead as she prepares to run."
            },
            {
                "level": 1,
                "start_time": 30.5,
                "end_time": 34.5,
                "children": [],
                "caption": "In a stadium filled with spectators, a female athlete in a red and white uniform prepares to throw a javelin, her focus evident as she takes a step forward and releases the javelin into the air."
            },
            {
                "level": 1,
                "start_time": 34.5,
                "end_time": 38.5,
                "children": [],
                "caption": "As the crowd cheers, the woman in the red and white uniform, number 12 visible on her chest, prepares to throw the javelin, her focus evident as she takes a step forward."
            },
            {
                "level": 1,
                "start_time": 38.5,
                "end_time": 48.5,
                "caption": "The crowd erupts in cheers as a female athlete, wearing a red and white uniform, sprints down the track, her determined stride and focused expression reflecting the intensity of the race.",
                "children": []
            },
            {
                "level": 1,
                "start_time": 48.5,
                "end_time": 53.5,
                "children": [],
                "caption": "The woman, wearing a red and white uniform, sprints down the track, her long hair flowing behind her, as the crowd cheers and a man announces the results of the women's javelin throw."
            },
            {
                "level": 1,
                "start_time": 53.5,
                "end_time": 61.5,
                "children": [],
                "caption": "The female athlete, wearing a red and white uniform, sprints down the track, her long hair flowing behind her, as the crowd cheers and the announcer excitedly describes the ongoing javelin throw event."
            },
            {
                "level": 1,
                "start_time": 61.5,
                "end_time": 65.5,
                "children": [],
                "caption": "The female athlete, wearing a red and white uniform, sprints down the track, her determined expression and focused gaze conveying her determination as she approaches the finish line."
            },
            {
                "level": 1,
                "start_time": 65.5,
                "end_time": 78.5,
                "caption": "The female athlete, wearing a blue and red uniform, stands on the track, her gaze fixed on the scoreboard that displays her personal best of 12.91 seconds, as the crowd cheers her on.",
                "children": []
            },
            {
                "level": 1,
                "start_time": 78.5,
                "end_time": 81.76,
                "children": [],
                "caption": "As the crowd cheers, the female athlete, wearing a red and blue uniform, raises her arms in triumph, her face beaming with joy as she crosses the finish line of the javelin throw event."
            }
        ],
        "caption": "Female athlete in a red and white uniform holds javelin with her eyes closed as if in deep concentration . The athlete, dressed in a vibrant red and blue uniform, stands poised on the track ."
    },
    "wq9wywa4xiM": {
        "level": 0,
        "start_time": 0.0,
        "end_time": 58.166667,
        "children": [
            {
                "level": 1,
                "start_time": 0.0,
                "end_time": 8.5,
                "children": [],
                "caption": "The video opens with a close-up of the \"Ram Truck\" logo, a stylized ram's head, before panning out to reveal the Ram 1500 pickup truck, parked on a snowy road. A woman's voice begins to describe the truck's features."
            },
            {
                "level": 1,
                "start_time": 8.5,
                "end_time": 48.5,
                "children": [
                    {
                        "level": 2,
                        "start_time": 8.5,
                        "end_time": 25.5,
                        "children": [],
                        "caption": "The video showcases a white Jeep Grand Cherokee parked in a snowy lot, highlighting its sleek design and modern features, while a woman's voice encourages viewers to visit their dealership for a test drive."
                    },
                    {
                        "level": 2,
                        "start_time": 25.5,
                        "end_time": 44.5,
                        "children": [
                            {
                                "level": 3,
                                "start_time": 25.5,
                                "end_time": 31.5,
                                "children": [],
                                "caption": "The video showcases the interior of a white SUV, highlighting its spaciousness and modern design, while a woman's voice continues to describe its features."
                            },
                            {
                                "level": 3,
                                "start_time": 31.5,
                                "end_time": 44.5,
                                "children": [],
                                "caption": "The video showcases the interior of a white minivan, highlighting its spaciousness and modern design, while a woman's voice continues to describe its features."
                            }
                        ],
                        "caption": "The video showcases the interior of a white minivan, highlighting its spaciousness and modern design, while a woman's voice continues to describe its features ."
                    },
                    {
                        "level": 2,
                        "start_time": 44.5,
                        "end_time": 48.5,
                        "children": [],
                        "caption": "The video showcases the interior of a modern car, highlighting its sleek design and spaciousness, while a woman's voice continues to describe the vehicle's features."
                    }
                ],
                "caption": "The video showcases a white Jeep Grand Cherokee parked in a snowy lot, highlighting its sleek design and modern features . A woman's voice encourages viewers to visit their dealership for a test drive ."
            },
            {
                "level": 1,
                "start_time": 48.5,
                "end_time": 58.166667,
                "children": [
                    {
                        "level": 2,
                        "start_time": 48.5,
                        "end_time": 55.5,
                        "children": [],
                        "caption": "The video transitions from a close-up of the car's dashboard to a wider shot of the vehicle driving down a road, while a woman's voice continues to describe its features, including the backup camera and Bluetooth connectivity."
                    },
                    {
                        "level": 2,
                        "start_time": 55.5,
                        "end_time": 58.166667,
                        "children": [],
                        "caption": "The video transitions from a close-up of the \"River Country Chrysler Jeep\" logo to a wider shot of the dealership, showcasing its modern building and well-maintained parking lot, all while a woman's voice continues to advertise the dealership's commitment to customer satisfaction."
                    }
                ],
                "caption": "The video transitions from a close-up of the \"River Country Chrysler Jeep\" logo to a wider shot of the dealership, showcasing its modern building and well-maintained parking lot . A woman's voice continues to describe the dealership's commitment to customer satisfaction ."
            }
        ],
        "caption": "The video opens with a close-up of the \"Ram Truck\" logo, a stylized ram's head, before panning out to reveal the Ram 1500 pickup truck . The video showcases a white Jeep Grand Cherokee parked in a snowy lot ."
    },
    "x8G-pQ4b6aM": {
        "level": 0,
        "start_time": 0.0,
        "end_time": 128.333,
        "children": [
            {
                "level": 1,
                "start_time": 0.0,
                "end_time": 7.5,
                "children": [
                    {
                        "level": 2,
                        "start_time": 0.0,
                        "end_time": 3.5,
                        "children": [],
                        "caption": "The video opens with a close-up of a vibrant garden, the camera panning out to reveal a person tending to the lush greenery. As the camera continues to pan, the person's voice begins to explain the process of growing garlic."
                    },
                    {
                        "level": 2,
                        "start_time": 3.5,
                        "end_time": 7.5,
                        "children": [],
                        "caption": "A man and a woman are working together in a garden, the woman gently guiding a small plant into the ground as the man explains how to plant it."
                    }
                ],
                "caption": "The video opens with a close-up of a garden, the camera panning out to reveal a person tending to the greenery . As the camera continues to pan, the person's voice begins to explain the process of growing garlic ."
            },
            {
                "level": 1,
                "start_time": 7.5,
                "end_time": 11.5,
                "children": [],
                "caption": "In a garden bed filled with vibrant green plants, a person's hands gently tend to the soil, carefully placing seeds and tending to the plants as a woman's voice explains the process of planting seeds."
            },
            {
                "level": 1,
                "start_time": 11.5,
                "end_time": 15.5,
                "children": [],
                "caption": "In a garden, a person's hands gently tend to a patch of vibrant green plants, carefully removing weeds and adding nutrients to the soil."
            },
            {
                "level": 1,
                "start_time": 15.5,
                "end_time": 19.5,
                "children": [],
                "caption": "A man's voice explains how to plant seeds in the raised garden beds, as the camera focuses on the bare soil, ready for planting."
            },
            {
                "level": 1,
                "start_time": 19.5,
                "end_time": 34.5,
                "caption": "A pair of hands wearing gloves carefully tend to a patch of dirt, preparing the ground for planting as a woman's voice explains the process of planting seeds.",
                "children": []
            },
            {
                "level": 1,
                "start_time": 34.5,
                "end_time": 38.5,
                "children": [],
                "caption": "A man's voice explains how to plant the seeds in the raised garden bed, as the camera focuses on the bare soil, ready for the seeds to be sown."
            },
            {
                "level": 1,
                "start_time": 38.5,
                "end_time": 42.5,
                "children": [],
                "caption": "The camera pans across a lush garden, following the path of a dirt road through a field of vibrant green plants, as a woman's voice explains how to plant the seeds in the raised beds."
            },
            {
                "level": 1,
                "start_time": 42.5,
                "end_time": 57.5,
                "caption": "The camera pans across a vibrant garden, showcasing a variety of plants and flowers in bloom, while a woman's voice explains how to plant a row of tomato plants in a raised bed.",
                "children": []
            },
            {
                "level": 1,
                "start_time": 57.5,
                "end_time": 63.5,
                "children": [],
                "caption": "The camera pans across a garden bed filled with vibrant green plants, following the path of a garden hose as it waters the thirsty plants."
            },
            {
                "level": 1,
                "start_time": 63.5,
                "end_time": 68.5,
                "children": [],
                "caption": "The camera pans across a garden bed filled with vibrant green plants, following the path of a person's hand as they reach out to touch the leaves, while a woman's voice explains how to plant the seeds."
            },
            {
                "level": 1,
                "start_time": 68.5,
                "end_time": 72.5,
                "children": [],
                "caption": "The camera pans across a garden bed filled with vibrant green plants, following the path of a person's hand as they reach out to touch the leaves."
            },
            {
                "level": 1,
                "start_time": 72.5,
                "end_time": 77.5,
                "children": [],
                "caption": "The camera pans across a garden bed filled with vibrant green plants, following the path of a person's hand as they reach out to touch the leaves, while a woman's voice explains how to plant the seeds."
            },
            {
                "level": 1,
                "start_time": 77.5,
                "end_time": 85.5,
                "caption": "The camera pans across a vibrant garden, showcasing a variety of plants and flowers in bloom, while a woman's voice continues to provide instructions on planting a specific variety of onion.",
                "children": []
            },
            {
                "level": 1,
                "start_time": 85.5,
                "end_time": 97.5,
                "caption": "The camera pans across a vibrant garden, showcasing a variety of plants and flowers in bloom, while a woman's voice explains how to plant a specific type of vegetable.",
                "children": []
            },
            {
                "level": 1,
                "start_time": 97.5,
                "end_time": 104.5,
                "children": [],
                "caption": "The camera pans across a vibrant garden, showcasing a variety of plants and flowers in bloom, while a woman's voice continues to provide instructions on planting a specific variety of basil."
            },
            {
                "level": 1,
                "start_time": 104.5,
                "end_time": 108.5,
                "children": [],
                "caption": "The camera pans across a vibrant garden, showcasing a variety of plants and flowers in bloom, while a woman's voice explains how to plant garlic bulbs in the fall."
            },
            {
                "level": 1,
                "start_time": 108.5,
                "end_time": 112.5,
                "children": [],
                "caption": "The camera pans across a vibrant garden, showcasing a variety of plants and flowers in bloom, while a woman's voice can be heard faintly in the background."
            },
            {
                "level": 1,
                "start_time": 112.5,
                "end_time": 118.5,
                "children": [],
                "caption": "The camera pans across a vibrant garden, showcasing a variety of plants and flowers in bloom, while a woman's voice explains how to grow garlic chives, her voice occasionally drowned out by the sound of a car engine starting up."
            },
            {
                "level": 1,
                "start_time": 118.5,
                "end_time": 128.333,
                "children": [
                    {
                        "level": 2,
                        "start_time": 118.5,
                        "end_time": 124.5,
                        "children": [],
                        "caption": "The camera pans across a vibrant garden, showcasing a variety of plants and flowers in bloom, while a woman's voice provides instructions on how to grow a specific plant from seed."
                    },
                    {
                        "level": 2,
                        "start_time": 124.5,
                        "end_time": 128.333,
                        "children": [],
                        "caption": "The video transitions from a close-up of a vibrant garden to a wider shot, revealing a person's hands gently tending to the plants, as a woman's voice begins to speak."
                    }
                ],
                "caption": "The camera pans across a garden, showcasing a variety of plants and flowers in bloom, while a woman's voice provides instructions on how to grow a specific plant from seed . The video transitions from a close-up of a garden to a wider shot, revealing a person's hands gently tending"
            }
        ],
        "caption": "The video opens with a close-up of a garden, the camera panning out to reveal a person tending to the greenery . A man's voice explains how to plant seeds in the raised garden beds, as the camera focuses on the bare soil, ready for planting ."
    },
    "v4-zBR7aXFU": {
        "level": 0,
        "start_time": 0.0,
        "end_time": 46.92,
        "children": [
            {
                "level": 1,
                "start_time": 0.0,
                "end_time": 9.5,
                "children": [
                    {
                        "level": 2,
                        "start_time": 0.0,
                        "end_time": 4.5,
                        "children": [],
                        "caption": "A police officer, standing beside a parked car, hands a red key to a driver, who is about to start the car."
                    },
                    {
                        "level": 2,
                        "start_time": 4.5,
                        "end_time": 9.5,
                        "children": [],
                        "caption": "A man, standing in front of a red and white \"LOCKSMITH KIT\" truck, smiles at the camera as he explains that he's a locksmith and can help customers with any lock-related issues."
                    }
                ],
                "caption": "A police officer hands a key to a driver, who is about to start the car . A man explains that he's a locksmith and can help customers with lock-related issues ."
            },
            {
                "level": 1,
                "start_time": 9.5,
                "end_time": 14.5,
                "children": [],
                "caption": "A man, standing in front of a red door with the word \"MARKET\" on it, smiles at the camera as he explains that he's a locksmith and can help customers with any lock-related issues."
            },
            {
                "level": 1,
                "start_time": 14.5,
                "end_time": 25.5,
                "children": [
                    {
                        "level": 2,
                        "start_time": 14.5,
                        "end_time": 18.5,
                        "children": [],
                        "caption": "A pair of hands, wearing a dark jacket, carefully fold a pair of blue jeans on a bed as a man's voice continues to promote the security of Master Locks."
                    },
                    {
                        "level": 2,
                        "start_time": 18.5,
                        "end_time": 22.5,
                        "children": [],
                        "caption": "A man, standing in front of a red door with the word \"STORE\" on it, continues his speech about the importance of securing car doors, his voice echoing slightly in the room."
                    },
                    {
                        "level": 2,
                        "start_time": 22.5,
                        "end_time": 25.5,
                        "children": [],
                        "caption": "A man in a red shirt, standing in front of a brick wall with a company logo, continues his speech about the importance of securing car doors, his voice echoing slightly in the room."
                    }
                ],
                "caption": "A pair of hands, wearing a dark jacket, carefully fold a pair of blue jeans on a bed as a man's voice continues to promote the security of Master Locks . A man, standing in front of a red door with the word \"STORE\" on it, continues his"
            },
            {
                "level": 1,
                "start_time": 25.5,
                "end_time": 32.5,
                "children": [],
                "caption": "A man in a red shirt, standing in front of a brick wall with a company logo, continues his speech about the importance of securing car doors, his voice echoing slightly in the room."
            },
            {
                "level": 1,
                "start_time": 32.5,
                "end_time": 36.5,
                "children": [],
                "caption": "Two men, one in a red shirt and the other in a black shirt, stand side by side, smiling at the camera as a woman's voice encourages viewers to \"give them a call\" for their locksmith services."
            },
            {
                "level": 1,
                "start_time": 36.5,
                "end_time": 40.5,
                "children": [],
                "caption": "Three men in matching red shirts and black ties stand in front of a brick wall, smiling and waving at the camera as a woman's voice encourages viewers to contact them for their locksmith needs."
            },
            {
                "level": 1,
                "start_time": 40.5,
                "end_time": 46.92,
                "children": [],
                "caption": "The video transitions from a close-up of a man's face to a wider shot of him standing in front of a brick wall, as a woman's voice encourages viewers to contact a locksmith for assistance."
            }
        ],
        "caption": "A police officer hands a key to a driver, who is about to start the car . A man explains that he's a locksmith and can help customers with lock-related issues . A woman's voice encourages viewers to \"give them a call\" for their locksmith services ."
    },
    "vHTfzg4dBsY": {
        "level": 0,
        "start_time": 0.0,
        "end_time": 58.600208,
        "children": [
            {
                "level": 1,
                "start_time": 0.0,
                "end_time": 5.5,
                "children": [],
                "caption": "The video begins with a close-up shot of a man in a black cap and a woman in a white top, both seated in front of a brightly lit stage. The man is speaking into a microphone, his voice clear and audible as he introduces the event."
            },
            {
                "level": 1,
                "start_time": 5.5,
                "end_time": 10.5,
                "children": [],
                "caption": "The woman, illuminated by the stage lights, continues her speech, her voice clear and audible as she addresses the audience."
            },
            {
                "level": 1,
                "start_time": 10.5,
                "end_time": 14.5,
                "children": [],
                "caption": "The woman, now wearing a black top, sits on the stage, listening intently as a man off-screen asks about her experience working with a director named \"B.\""
            },
            {
                "level": 1,
                "start_time": 14.5,
                "end_time": 20.5,
                "children": [],
                "caption": "The man in the black cap and the woman in the black top are seated on a stage, listening intently to a speaker who is addressing the audience about the importance of being present in the moment."
            },
            {
                "level": 1,
                "start_time": 20.5,
                "end_time": 24.5,
                "children": [],
                "caption": "The man in the black cap and the man in the black cap and white cap are seated on a stage, listening intently to a woman's voice as she speaks about the importance of being yourself."
            },
            {
                "level": 1,
                "start_time": 24.5,
                "end_time": 29.5,
                "children": [],
                "caption": "The man in the black cap and the man in the black cap and white cap are both wearing headphones and listening intently to a speaker at the podium, who is addressing the audience about the importance of being present in the moment."
            },
            {
                "level": 1,
                "start_time": 29.5,
                "end_time": 33.5,
                "children": [],
                "caption": "The man in the black cap, seated on the left, listens intently as the man in the black cap on the right speaks into the microphone, his voice amplified by the sound system."
            },
            {
                "level": 1,
                "start_time": 33.5,
                "end_time": 37.5,
                "children": [],
                "caption": "The man in the black cap and t-shirt, seated on the stage, listens intently as a woman's voice, barely audible over the cheers of the crowd, asks a question about the film's message."
            },
            {
                "level": 1,
                "start_time": 37.5,
                "end_time": 42.5,
                "children": [],
                "caption": "The man in the black cap, seated on the right side of the panel, listens intently as the woman in the black top, seated on the left, speaks about the importance of being yourself."
            },
            {
                "level": 1,
                "start_time": 42.5,
                "end_time": 46.5,
                "children": [],
                "caption": "The man in the black cap, seated on the right, listens intently as the man in the black cap on the left speaks into the microphone, his voice clear and audible over the quiet room."
            },
            {
                "level": 1,
                "start_time": 46.5,
                "end_time": 50.5,
                "children": [],
                "caption": "Two men, one in a black cap and the other in a black cap and white cap, are seated on a stage, listening intently to a woman's voice as she speaks about the importance of being yourself."
            },
            {
                "level": 1,
                "start_time": 50.5,
                "end_time": 58.600208,
                "caption": "Two men, one in a black cap and the other in a black cap and a black jacket, are seated on a stage, engaged in a lively conversation, their laughter and animated gestures filling the room as they discuss something amusing.",
                "children": []
            }
        ],
        "caption": "The video begins with a close-up shot of a man in a black cap and a woman in a white top, both seated in front of a brightly lit stage . The woman, illuminated by the stage lights, continues her speech, her voice clear and audible as she addresses the audience"
    },
    "vMInBBN_5Ts": {
        "level": 0,
        "start_time": 0.0,
        "end_time": 140.266667,
        "children": [
            {
                "level": 1,
                "start_time": 0.0,
                "end_time": 12.5,
                "caption": "Two young girls, one in a black jacket and the other in a white shirt, stand close together in a brightly lit room, smiling and chatting as one of them holds up her phone to record the moment.",
                "children": []
            },
            {
                "level": 1,
                "start_time": 12.5,
                "end_time": 24.5,
                "caption": "A young man with short, dark hair, wearing a black t-shirt, smiles at the camera as a woman's voice can be heard off-screen, playfully asking if he's ready to record a video.",
                "children": []
            },
            {
                "level": 1,
                "start_time": 24.5,
                "end_time": 28.5,
                "children": [],
                "caption": "A young man with short, dark hair, wearing a black t-shirt, smiles at the camera as a woman's voice can be heard off-screen, playfully asking if he's \"ready to go\" and \"ready to go home.\""
            },
            {
                "level": 1,
                "start_time": 28.5,
                "end_time": 33.5,
                "children": [],
                "caption": "A young woman with long, wavy hair, wearing a black jacket, smiles at the camera as a man's voice can be heard off-screen, playfully asking if she's ready to \"get this party started.\""
            },
            {
                "level": 1,
                "start_time": 33.5,
                "end_time": 37.5,
                "children": [],
                "caption": "A young woman with long, wavy hair, wearing a black jacket, smiles at the camera as a man's voice can be heard off-screen, saying \"Bye, bye\" and \"I'll see you later.\""
            },
            {
                "level": 1,
                "start_time": 37.5,
                "end_time": 45.5,
                "caption": "A young woman, wearing a black jacket, smiles at the camera as she holds up a small, rectangular object, possibly a phone, while a man's voice can be heard in the background.",
                "children": []
            },
            {
                "level": 1,
                "start_time": 45.5,
                "end_time": 58.5,
                "caption": "A young woman, wearing a black jacket, smiles at the camera as she holds up her phone, showing a selfie of her and a friend, while a man's voice can be heard in the background.",
                "children": []
            },
            {
                "level": 1,
                "start_time": 58.5,
                "end_time": 88.5,
                "caption": "A young man, wearing a red and white striped shirt, smiles at the camera as a woman's voice can be heard off-screen, playfully asking if he's \"ready to go\" and \"ready to go home.\"",
                "children": []
            },
            {
                "level": 1,
                "start_time": 88.5,
                "end_time": 96.5,
                "caption": "The young woman, wearing a black jacket, smiles at the camera as she holds up her phone, showing a selfie of her friend with long, wavy hair, while a man's voice can be heard in the background.",
                "children": []
            },
            {
                "level": 1,
                "start_time": 96.5,
                "end_time": 111.5,
                "caption": "A young woman with long, dark hair, wearing a black jacket, smiles at the camera as a woman's voice can be heard off-screen, playfully asking if she's \"ready to go\" and \"ready to go home.\"",
                "children": []
            },
            {
                "level": 1,
                "start_time": 111.5,
                "end_time": 131.5,
                "caption": "Two young girls, one in a black jacket and the other in a white jacket, stand close together in a brightly lit room, smiling and chatting as one of them playfully covers the other's mouth with her hand.",
                "children": []
            },
            {
                "level": 1,
                "start_time": 131.5,
                "end_time": 140.266667,
                "caption": "Two young girls, one in a black jacket and the other in a white shirt, stand close together in a brightly lit room, smiling and waving at the camera as a woman's voice can be heard off-screen.",
                "children": []
            }
        ],
        "caption": "A young man with short, dark hair, wearing a black t-shirt, smiles at the camera as a woman's voice can be heard off-screen . Two girls, one in a black jacket and the other in a white shirt, stand close together in a brightly lit room,"
    },
    "vRO8vWryVx4": {
        "level": 0,
        "start_time": 0.0,
        "end_time": 32.365667,
        "children": [
            {
                "level": 1,
                "start_time": 0.0,
                "end_time": 3.5,
                "children": [],
                "caption": "In a bustling city street at night, a man in a cowboy hat and a red shirt stands in front of a large neon sign that reads \"Las Vegas,\" while a woman in a red dress walks by, her gaze fixed on him."
            },
            {
                "level": 1,
                "start_time": 3.5,
                "end_time": 7.5,
                "children": [],
                "caption": "In a dimly lit bar, a man in a cowboy hat and a woman in a red dress stand close together, their faces illuminated by the warm glow of the bar's neon lights as they engage in a lively conversation."
            },
            {
                "level": 1,
                "start_time": 7.5,
                "end_time": 15.5,
                "children": [
                    {
                        "level": 2,
                        "start_time": 7.5,
                        "end_time": 12.5,
                        "children": [],
                        "caption": "In a dimly lit bar, a man in a white shirt and black vest stands before a woman in a red dress, their conversation drowned out by the lively chatter of the crowd and the rhythmic pulse of electronic music."
                    },
                    {
                        "level": 2,
                        "start_time": 12.5,
                        "end_time": 15.5,
                        "children": [],
                        "caption": "A man and a woman, illuminated by the neon lights of a bustling city street, stand before a large, illuminated cowboy boot sculpture, the woman smiling as she gazes up at it."
                    }
                ],
                "caption": "A man and a woman, illuminated by the neon lights of a busy city street, stand before a large, illuminated cowboy boot sculpture . Their conversation drowned out by the rhythmic pulse of electronic music . The woman smiling as she gazes up at it ."
            },
            {
                "level": 1,
                "start_time": 15.5,
                "end_time": 20.5,
                "children": [],
                "caption": "A man and a woman, illuminated by the neon lights of a vibrant arcade, reach for a bottle of Budweiser, their hands almost touching as a woman's voice encourages them to \"take a sip.\""
            },
            {
                "level": 1,
                "start_time": 20.5,
                "end_time": 25.5,
                "children": [],
                "caption": "The man and woman, illuminated by the neon lights of the city, stand close together, their faces reflecting the excitement of the moment as they watch the man in the cowboy hat and red shirt ride a mechanical bull."
            },
            {
                "level": 1,
                "start_time": 25.5,
                "end_time": 32.365667,
                "children": [
                    {
                        "level": 2,
                        "start_time": 25.5,
                        "end_time": 29.5,
                        "children": [],
                        "caption": "In a dimly lit room, a man and a woman stand close together, their hands clasped, as a pop song plays in the background, its lyrics about love and longing echoing the intimate moment."
                    },
                    {
                        "level": 2,
                        "start_time": 29.5,
                        "end_time": 32.365667,
                        "children": [],
                        "caption": "The video transitions from a close-up of a car's dashboard to a wider shot of the car driving down a snowy road, as a man's voice can be heard saying \"I'm gonna get you.\""
                    }
                ],
                "caption": "In a dimly lit room, a man and a woman stand close together, their hands clasped, as a pop song plays in the background . The video transitions from a close-up of a car's dashboard to a wider shot of a snowy road ."
            }
        ],
        "caption": "In a bustling city street at night, a man in a cowboy hat and a red shirt stands in front of a large neon sign that reads \"Las Vegas\" The video transitions from a close-up of a car's dashboard to a wider shot of a snowy road ."
    },
    "t-sHfZ9upSs": {
        "level": 0,
        "start_time": 0.0,
        "end_time": 30.096733,
        "children": [
            {
                "level": 1,
                "start_time": 0.0,
                "end_time": 3.5,
                "children": [],
                "caption": "A cartoon character, dressed in a yellow and black striped outfit, dances energetically against a vibrant yellow background, their arms raised in a joyful expression as a woman's voice excitedly announces \"KIDS' CHANNEL\" over the upbeat music."
            },
            {
                "level": 1,
                "start_time": 3.5,
                "end_time": 7.5,
                "children": [],
                "caption": "A young girl, wearing a pink shirt and a blue headband, dances energetically in a brightly lit room, her joyful movements captured in a close-up shot."
            },
            {
                "level": 1,
                "start_time": 7.5,
                "end_time": 14.5,
                "children": [],
                "caption": "A young boy in a blue shirt and white pants dances energetically in a brightly lit room, his joyous movements captured in a close-up shot as a woman's voice excitedly announces the start of \"KIDS CLUB COUNTDOWN\" on Channel 2."
            },
            {
                "level": 1,
                "start_time": 14.5,
                "end_time": 18.5,
                "children": [],
                "caption": "The video transitions from a vibrant, colorful graphic to a close-up of a man with a mustache and glasses, who smiles and gestures as if speaking to the camera, while a woman's voice can be heard in the background."
            },
            {
                "level": 1,
                "start_time": 18.5,
                "end_time": 22.5,
                "children": [],
                "caption": "A man with a mustache and sunglasses, wearing a blue shirt, stands in a dimly lit room, his serious expression illuminated by a single light source as he speaks directly to the camera."
            },
            {
                "level": 1,
                "start_time": 22.5,
                "end_time": 30.096733,
                "children": [
                    {
                        "level": 2,
                        "start_time": 22.5,
                        "end_time": 27.5,
                        "children": [],
                        "caption": "The video transitions from a vibrant, animated sequence to a static graphic advertising \"Kids' Fun TV,\" featuring a stylized cartoon character and the show's logo against a colorful background."
                    },
                    {
                        "level": 2,
                        "start_time": 27.5,
                        "end_time": 30.096733,
                        "children": [],
                        "caption": "The video transitions from a vibrant montage of children to a static image of two cartoon characters, a boy and a girl, against a plain background, while a woman's voice can be heard faintly in the background."
                    }
                ],
                "caption": "The video transitions from a vibrant montage of children to a static image of two cartoon characters, a boy and a girl, against a plain background . A woman's voice can be heard faintly in the background ."
            }
        ],
        "caption": "A cartoon character, dressed in a yellow and black striped outfit, dances energetically against a vibrant yellow background . A woman's voice excitedly announces \"KIDS' CHANNEL\" over the upbeat music ."
    },
    "tDMu9cy-Uag": {
        "level": 0,
        "start_time": 0.0,
        "end_time": 267.24,
        "children": [
            {
                "level": 1,
                "start_time": 0.0,
                "end_time": 11.5,
                "children": [
                    {
                        "level": 2,
                        "start_time": 0.0,
                        "end_time": 3.5,
                        "children": [],
                        "caption": "A man wearing a blue \"DO IT FOR THE LOVE\" t-shirt stands in front of a brick building, adjusting his shirt and looking directly at the camera as a woman's voice can be heard in the background."
                    },
                    {
                        "level": 2,
                        "start_time": 3.5,
                        "end_time": 7.5,
                        "children": [],
                        "caption": "A man in a blue and white striped shirt, with the number 17 on the back, stands in front of a brick building, smiling and gesturing as if he's about to speak."
                    },
                    {
                        "level": 2,
                        "start_time": 7.5,
                        "end_time": 11.5,
                        "children": [],
                        "caption": "A man in a blue and white striped shirt, number 17 on his back, stands in front of a brick building, his serious expression and the \"STOP\" sign in the background hinting at a potential conflict."
                    }
                ],
                "caption": "A man wearing a blue \"DO IT FOR THE LOVE\" t-shirt stands in front of a brick building, adjusting his shirt and looking directly at the camera . A woman's voice can be heard in the background ."
            },
            {
                "level": 1,
                "start_time": 11.5,
                "end_time": 18.5,
                "children": [],
                "caption": "A man in a blue and white striped shirt, number 17 on his chest, stands in front of a brick wall, his serious expression illuminated by the bright sunlight as he speaks directly to the camera."
            },
            {
                "level": 1,
                "start_time": 18.5,
                "end_time": 24.5,
                "children": [],
                "caption": "The man in the blue and white jersey, number 17, stands in front of a brick wall, his serious expression illuminated by the bright sunlight as he listens to a woman's voice off-camera."
            },
            {
                "level": 1,
                "start_time": 24.5,
                "end_time": 29.5,
                "children": [],
                "caption": "The man in the blue jersey, standing in front of a wall of jerseys, continues his animated speech, gesturing with his hands as he talks about the Chelsea players' lack of experience."
            },
            {
                "level": 1,
                "start_time": 29.5,
                "end_time": 108.5,
                "caption": "The man in the blue and white jersey, standing in front of a wall of jerseys, continues his animated speech, gesturing with his hands as he discusses the Chelsea and Arsenal rivalry.",
                "children": []
            },
            {
                "level": 1,
                "start_time": 108.5,
                "end_time": 138.5,
                "caption": "The man in the blue and white jersey, illuminated by the bright stadium lights, continues his animated speech, gesturing with his hands as he discusses the Chelsea player's recent form.",
                "children": []
            },
            {
                "level": 1,
                "start_time": 138.5,
                "end_time": 142.5,
                "children": [],
                "caption": "The man in the blue and white jersey, standing in front of a wall of jerseys, continues his animated speech, gesturing with his hands as he discusses the impact of a player's departure on the team's performance."
            },
            {
                "level": 1,
                "start_time": 142.5,
                "end_time": 148.5,
                "children": [],
                "caption": "The man in the blue and white jersey, illuminated by the bright stadium lights, continues his animated speech, gesturing with his hands as he discusses the Chelsea player's recent form."
            },
            {
                "level": 1,
                "start_time": 148.5,
                "end_time": 239.5,
                "caption": "The man in the blue and white jersey, standing in front of a wall of jerseys, continues his animated speech, gesturing with his hands as he discusses the impact of a player's departure on the team's performance.",
                "children": []
            },
            {
                "level": 1,
                "start_time": 239.5,
                "end_time": 247.5,
                "caption": "The video transitions from a black screen with white text to a close-up of a person's face, their expression shifting from neutral to a slight smile as a man's voice begins to speak.",
                "children": []
            },
            {
                "level": 1,
                "start_time": 247.5,
                "end_time": 267.24,
                "children": [],
                "caption": "The video transitions from a black screen to a white one, displaying the website address \"www.oboee.com\" in bold white letters against a black background ."
            }
        ],
        "caption": "A man wearing a blue \"DO IT FOR THE LOVE\" t-shirt stands in front of a brick wall, adjusting his shirt and looking directly at the camera . A woman's voice can be heard in the background . The video transitions from a black screen with white text to a close"
    },
    "tNeWPZw0Igw": {
        "level": 0,
        "start_time": 0.0,
        "end_time": 327.633333,
        "children": [
            {
                "level": 1,
                "start_time": 0.0,
                "end_time": 36.5,
                "children": [
                    {
                        "level": 2,
                        "start_time": 0.0,
                        "end_time": 13.5,
                        "children": [
                            {
                                "level": 3,
                                "start_time": 0.0,
                                "end_time": 3.5,
                                "children": [],
                                "caption": "The news broadcast opens with a split-screen showing two female anchors at their desks, one in a white blouse and the other in a black top, as they introduce the story of flooding in the region."
                            },
                            {
                                "level": 3,
                                "start_time": 3.5,
                                "end_time": 13.5,
                                "children": [],
                                "caption": "The news anchor, dressed in a white shirt and black blazer, sits at her desk in the studio, reporting on the flooding in Mogadishu, Somalia, as the scene transitions to show the flooded streets and buildings."
                            }
                        ],
                        "caption": "The news broadcast opens with a split-screen showing two female anchors at their desks . They introduce the story of flooding in the region as they report on the flooding in Mogadishu ."
                    },
                    {
                        "level": 2,
                        "start_time": 13.5,
                        "end_time": 26.5,
                        "children": [
                            {
                                "level": 3,
                                "start_time": 13.5,
                                "end_time": 17.5,
                                "children": [],
                                "caption": "The camera pans across a flooded landscape, showing a man in a yellow vest standing in the water, his face etched with concern as he speaks to someone off-camera about the rising water levels."
                            },
                            {
                                "level": 3,
                                "start_time": 17.5,
                                "end_time": 21.5,
                                "children": [],
                                "caption": "The camera pans across a flooded street, showing the aftermath of heavy rainfall, with debris and water covering the ground and buildings in the background."
                            },
                            {
                                "level": 3,
                                "start_time": 21.5,
                                "end_time": 26.5,
                                "children": [],
                                "caption": "The camera pans across a flooded street, showing the water's depth and the debris scattered on the ground, as a man's voice narrates the devastating impact of the floods."
                            }
                        ],
                        "caption": "The camera pans across a flooded landscape, showing a man in a yellow vest standing in the water, his face etched with concern as he speaks to someone off-camera about the rising water levels ."
                    },
                    {
                        "level": 2,
                        "start_time": 26.5,
                        "end_time": 36.5,
                        "caption": "The camera pans across a flooded field, showing the extent of the damage as a man's voice, speaking in a foreign language, describes the devastating impact of the floods.",
                        "children": []
                    }
                ],
                "caption": "The news broadcast opens with a split-screen showing two female anchors at their desks . They introduce the story of flooding in the region as they report on the flooding in Mogadishu . The camera pans across a flooded landscape, showing the extent of the damage ."
            },
            {
                "level": 1,
                "start_time": 36.5,
                "end_time": 55.5,
                "children": [
                    {
                        "level": 2,
                        "start_time": 36.5,
                        "end_time": 41.5,
                        "children": [],
                        "caption": "The camera pans across a flooded field, showing the extent of the damage as a man's voice, speaking in a foreign language, describes the devastating impact of the floods."
                    },
                    {
                        "level": 2,
                        "start_time": 41.5,
                        "end_time": 49.5,
                        "caption": "As the news report continues, the camera focuses on a woman in a yellow raincoat, standing in the floodwaters, her face etched with concern as she listens to the man's report about the rising water levels.",
                        "children": []
                    },
                    {
                        "level": 2,
                        "start_time": 49.5,
                        "end_time": 55.5,
                        "children": [],
                        "caption": "A woman, wearing a bright yellow raincoat and a wide-brimmed hat, stands in the rain, her umbrella held high as she speaks to the camera about the heavy rainfall and its impact on the area."
                    }
                ],
                "caption": "The camera pans across a flooded field, showing the extent of the damage as a man's voice, speaking in a foreign language, describes the devastating impact of the floods . The camera focuses on a woman in a yellow raincoat, standing in the floodwaters, her face etched with concern"
            },
            {
                "level": 1,
                "start_time": 55.5,
                "end_time": 103.5,
                "caption": "A woman, wearing a bright yellow raincoat and a wide-brimmed hat, stands in the rain, her umbrella held high as she speaks to the camera about the heavy rainfall and its impact on the area.",
                "children": []
            },
            {
                "level": 1,
                "start_time": 103.5,
                "end_time": 110.5,
                "children": [],
                "caption": "A man in a yellow vest stands in the floodwaters, gesturing as he speaks to someone off-camera about the heavy rainfall and its impact on the area."
            },
            {
                "level": 1,
                "start_time": 110.5,
                "end_time": 125.5,
                "children": [
                    {
                        "level": 2,
                        "start_time": 110.5,
                        "end_time": 115.5,
                        "children": [],
                        "caption": "A man in a yellow vest stands on a bridge over a flooded street, gesturing as he speaks to the camera about the heavy rainfall and its impact on the city."
                    },
                    {
                        "level": 2,
                        "start_time": 115.5,
                        "end_time": 119.5,
                        "children": [],
                        "caption": "A man in a yellow hard hat and safety vest stands on a bridge over a flooded river, gesturing as he speaks to the camera about the heavy rainfall and its impact on the area."
                    },
                    {
                        "level": 2,
                        "start_time": 119.5,
                        "end_time": 125.5,
                        "children": [],
                        "caption": "The camera pans across a flooded street, showing the water's depth and the debris scattered on the ground, as a man's voice continues to report on the flooding in Mukono, urging viewers to stay safe."
                    }
                ],
                "caption": "A man in a yellow vest stands on a bridge over a flooded river, gesturing as he speaks to the camera about the heavy rainfall and its impact on the area . The camera pans across a flooded street, showing the water's depth and the debris scattered on the ground ."
            },
            {
                "level": 1,
                "start_time": 125.5,
                "end_time": 129.5,
                "children": [],
                "caption": "A man in a yellow vest stands in the floodwaters, gesturing as he speaks to someone off-camera about the heavy rainfall and its impact on the area."
            },
            {
                "level": 1,
                "start_time": 129.5,
                "end_time": 186.5,
                "caption": "A man in a yellow hard hat and safety vest stands on a bridge over a flooded street, gesturing as he speaks to the camera about the heavy rainfall and its impact on the city.",
                "children": []
            },
            {
                "level": 1,
                "start_time": 186.5,
                "end_time": 209.5,
                "caption": "A man in a \"Makola News\" shirt, standing in front of a flooded street, speaks into a microphone, his voice amplified by the camera as he reports on the heavy rainfall and its impact on the city.",
                "children": []
            },
            {
                "level": 1,
                "start_time": 209.5,
                "end_time": 228.5,
                "children": [
                    {
                        "level": 2,
                        "start_time": 209.5,
                        "end_time": 213.5,
                        "children": [],
                        "caption": "A man in a yellow hard hat and safety vest stands on a bridge over a flooded street, gesturing as he speaks to the camera about the heavy rainfall and its impact on the city."
                    },
                    {
                        "level": 2,
                        "start_time": 213.5,
                        "end_time": 228.5,
                        "caption": "A man in a \"Makola News\" shirt, standing in front of a flooded street, speaks into a microphone, his voice amplified by the camera as he reports on the heavy rainfall and its impact on the city.",
                        "children": []
                    }
                ],
                "caption": "A man in a yellow hard hat and safety vest stands on a bridge over a flooded street . He speaks to the camera about the heavy rainfall and its impact on the city ."
            },
            {
                "level": 1,
                "start_time": 228.5,
                "end_time": 236.5,
                "children": [],
                "caption": "A man in a \"WATER\" shirt, standing in the floodwaters, speaks into a microphone, his voice amplified as he reports on the heavy rainfall and its impact on the city, including the flooding of the Mbale River."
            },
            {
                "level": 1,
                "start_time": 236.5,
                "end_time": 266.5,
                "caption": "The camera pans across a flooded street, showing the water's depth and the debris scattered on the ground, as a man's voice continues to report on the flooding in Mukono.",
                "children": []
            },
            {
                "level": 1,
                "start_time": 266.5,
                "end_time": 301.5,
                "children": [
                    {
                        "level": 2,
                        "start_time": 266.5,
                        "end_time": 280.5,
                        "children": [],
                        "caption": "The camera pans across a flooded street, showing the extent of the damage as a man speaks about the heavy rainfall and its impact on the city, his voice occasionally drowned out by the sound of the water."
                    },
                    {
                        "level": 2,
                        "start_time": 280.5,
                        "end_time": 291.5,
                        "children": [
                            {
                                "level": 3,
                                "start_time": 280.5,
                                "end_time": 285.5,
                                "children": [],
                                "caption": "A man in a white shirt and black vest stands in front of a flooded street, gesturing as he speaks to the camera about the heavy rainfall and its impact on the city."
                            },
                            {
                                "level": 3,
                                "start_time": 285.5,
                                "end_time": 291.5,
                                "children": [],
                                "caption": "The camera pans across a flooded street, showing the extent of the damage as a man's voice, speaking in a foreign language, describes the devastating impact of the floods."
                            }
                        ],
                        "caption": "A man in a white shirt and black vest speaks to the camera about the heavy rainfall and its impact on the city . The camera pans across a flooded street, showing the extent of the damage as a man's voice, speaking in a foreign language, describes the devastating impact ."
                    },
                    {
                        "level": 2,
                        "start_time": 291.5,
                        "end_time": 301.5,
                        "children": [],
                        "caption": "The camera pans across a flooded street, showing the extent of the damage as a man speaks about the heavy rainfall and its impact on the city."
                    }
                ],
                "caption": "A man in a white shirt and black vest speaks to the camera about the heavy rainfall and its impact on the city . The camera pans across a flooded street, showing the extent of the damage as a man's voice, speaking in a foreign language, describes the devastating impact ."
            },
            {
                "level": 1,
                "start_time": 301.5,
                "end_time": 305.5,
                "children": [],
                "caption": "A man in a white shirt and black vest, standing in front of a flooded street, speaks into a microphone, his voice amplified by the camera as he reports on the heavy rainfall and its impact on the city."
            },
            {
                "level": 1,
                "start_time": 305.5,
                "end_time": 327.633333,
                "children": [
                    {
                        "level": 2,
                        "start_time": 305.5,
                        "end_time": 319.5,
                        "caption": "A man in a white shirt and black vest, standing in front of a flooded street, speaks into a microphone, his voice amplified by the camera as he reports on the heavy rainfall and its impact on the city.",
                        "children": []
                    },
                    {
                        "level": 2,
                        "start_time": 319.5,
                        "end_time": 327.633333,
                        "children": [],
                        "caption": "A news anchor, dressed in a suit and tie, stands in front of a cityscape backdrop, delivering a report on the flooding in Mogadishu, his voice serious as he details the extent of the damage and the efforts to mitigate the situation."
                    }
                ],
                "caption": "A news anchor delivers a report on the flooding in Mogadishu . He details the extent of the damage and the efforts to mitigate the situation ."
            }
        ],
        "caption": "The news broadcast opens with a split-screen showing two female anchors at their desks . They introduce the story of flooding in the region as they report on the flooding in Mogadishu . The camera pans across a flooded landscape, showing the extent of the damage ."
    },
    "th7TroOitYM": {
        "level": 0,
        "start_time": 0.0,
        "end_time": 56.044325,
        "children": [
            {
                "level": 1,
                "start_time": 0.0,
                "end_time": 4.5,
                "children": [],
                "caption": "A person walks through a grassy area, their footsteps crunching on the dry leaves as they approach a group of people gathered around a tree, their conversation blending with the sounds of the wind."
            },
            {
                "level": 1,
                "start_time": 4.5,
                "end_time": 15.5,
                "children": [
                    {
                        "level": 2,
                        "start_time": 4.5,
                        "end_time": 8.5,
                        "children": [],
                        "caption": "The camera pans across a grassy field, capturing the lush greenery and the sound of a man's voice, though the source of the voice is not visible."
                    },
                    {
                        "level": 2,
                        "start_time": 8.5,
                        "end_time": 12.5,
                        "children": [],
                        "caption": "In a grassy field, a group of people gather around a man in a black shirt who is speaking into a microphone, while a man in a white shirt stands nearby, observing the scene."
                    },
                    {
                        "level": 2,
                        "start_time": 12.5,
                        "end_time": 15.5,
                        "children": [],
                        "caption": "In a grassy field, a man in a black shirt and blue jeans stands in front of a group of people, gesturing with his hands as he speaks, while a woman's voice can be heard in the background."
                    }
                ],
                "caption": "The camera pans across a grassy field, capturing the lush greenery and the sound of a man's voice . The source of the voice is not visible in the video ."
            },
            {
                "level": 1,
                "start_time": 15.5,
                "end_time": 19.5,
                "children": [],
                "caption": "A man in a black shirt and blue jeans stands in a grassy field, gesturing with his hands as he speaks to a group of people gathered around him, some of whom are watching intently while others are engaged in a lively conversation."
            },
            {
                "level": 1,
                "start_time": 19.5,
                "end_time": 24.5,
                "children": [],
                "caption": "A man in a black shirt and blue jeans is lying on the grass, his arms outstretched, as a woman's voice can be heard saying \"I'm sorry\" and a man's voice responds \"It's okay.\""
            },
            {
                "level": 1,
                "start_time": 24.5,
                "end_time": 28.5,
                "children": [],
                "caption": "As the wrestling match continues, the two men grapple on the grassy field, their movements blurred by the camera's shaky handheld shot, while a woman's voice can be heard in the background."
            },
            {
                "level": 1,
                "start_time": 28.5,
                "end_time": 38.5,
                "caption": "On a grassy field, two men in casual attire grapple fiercely, their movements blurred as they struggle for dominance, the sounds of their grunts and the cheers of the crowd adding to the intensity of the scene.",
                "children": []
            },
            {
                "level": 1,
                "start_time": 38.5,
                "end_time": 42.5,
                "children": [],
                "caption": "As the wrestling match continues, one wrestler, wearing a blue shirt, pins his opponent to the ground, causing the other wrestler to cry out in surprise."
            },
            {
                "level": 1,
                "start_time": 42.5,
                "end_time": 46.5,
                "children": [],
                "caption": "As the man in the blue shirt lies on the grass, a woman's voice can be heard, seemingly unrelated to the scene, saying \"I'm sorry\" before a man's voice interrupts with \"I'm sorry.\""
            },
            {
                "level": 1,
                "start_time": 46.5,
                "end_time": 51.5,
                "children": [],
                "caption": "As the man in the blue shirt struggles to break free from the man in the black shirt's grasp, a woman's voice can be heard saying \"Oh, my God,\" followed by a man's voice saying \"I'm sorry.\""
            },
            {
                "level": 1,
                "start_time": 51.5,
                "end_time": 56.044325,
                "children": [],
                "caption": "A man in a blue shirt and black pants is lying on the grass, his head resting on his hand as a woman's voice can be heard saying \"Bye\" and \"I love you\" in the background."
            }
        ],
        "caption": "A person walks through a grassy area, their footsteps crunching on the dry leaves as they approach a group of people gathered around a tree . A woman's voice can be heard saying \"Oh, my God,\" followed by a man's voice saying \"I'm sorry\""
    },
    "uEQhiiFCvFI": {
        "level": 0,
        "start_time": 0.0,
        "end_time": 41.9,
        "children": [
            {
                "level": 1,
                "start_time": 0.0,
                "end_time": 3.5,
                "children": [],
                "caption": "A black dog walks on a treadmill in a well-lit room, its paws moving rhythmically as it follows a leash held by a person off-camera."
            },
            {
                "level": 1,
                "start_time": 3.5,
                "end_time": 7.5,
                "children": [],
                "caption": "A small dog, wearing a red harness, trots along a treadmill in a well-lit room, its tail wagging as it enjoys the workout."
            },
            {
                "level": 1,
                "start_time": 7.5,
                "end_time": 11.5,
                "children": [],
                "caption": "A small dog, wearing a red harness, trots along a treadmill, its paws clicking on the machine as a woman's voice can be heard, though the source of the sound is not visible."
            },
            {
                "level": 1,
                "start_time": 11.5,
                "end_time": 15.5,
                "children": [],
                "caption": "A small dog, wearing a red harness, trots along a treadmill in a well-lit room, its paws moving rhythmically as a woman's voice can be heard in the background."
            },
            {
                "level": 1,
                "start_time": 15.5,
                "end_time": 19.5,
                "children": [],
                "caption": "A black and white dog walks across a treadmill, its paws moving rhythmically as a woman's voice can be heard in the background."
            },
            {
                "level": 1,
                "start_time": 19.5,
                "end_time": 23.5,
                "children": [],
                "caption": "A black and white dog walks across a treadmill, its tail wagging as it moves in sync with the machine's rhythmic hum."
            },
            {
                "level": 1,
                "start_time": 23.5,
                "end_time": 27.5,
                "children": [],
                "caption": "A black and white dog, wearing a red harness, trots along a treadmill in a well-lit room, its tail wagging as a woman's voice can be heard in the background."
            },
            {
                "level": 1,
                "start_time": 27.5,
                "end_time": 36.5,
                "caption": "Two dogs, one black and white and the other brown and white, are walking on a treadmill in a well-lit room, their paws moving rhythmically as they follow a person's commands.",
                "children": []
            },
            {
                "level": 1,
                "start_time": 36.5,
                "end_time": 41.9,
                "children": [],
                "caption": "A black dog, wearing a red harness, walks steadily on a treadmill in a well-lit room, its paws moving rhythmically as a woman's voice can be heard in the background."
            }
        ],
        "caption": "A black dog walks on a treadmill in a well-lit room, its paws moving rhythmically as it follows a leash held by a person off-camera . A small dog, wearing a red harness, trots along a treadmill as a woman's voice can be heard in the background"
    },
    "qousDEuMLCA": {
        "level": 0,
        "start_time": 0.0,
        "end_time": 331.875,
        "children": [
            {
                "level": 1,
                "start_time": 0.0,
                "end_time": 3.5,
                "children": [],
                "caption": "The band, dressed in black, is on stage, illuminated by blue and purple lights, as they begin their performance with a pop song."
            },
            {
                "level": 1,
                "start_time": 3.5,
                "end_time": 21.5,
                "children": [
                    {
                        "level": 2,
                        "start_time": 3.5,
                        "end_time": 9.5,
                        "children": [],
                        "caption": "The band, dressed in black, performs on a brightly lit stage, their instruments illuminated by the spotlight as they play a pop song, the music transitioning to a more electronic sound."
                    },
                    {
                        "level": 2,
                        "start_time": 9.5,
                        "end_time": 13.5,
                        "children": [],
                        "caption": "The band, illuminated by blue stage lights, launches into a punk song, the drummer pounding out a fast-paced beat as the guitarist and bassist trade riffs."
                    },
                    {
                        "level": 2,
                        "start_time": 13.5,
                        "end_time": 21.5,
                        "children": [
                            {
                                "level": 3,
                                "start_time": 13.5,
                                "end_time": 18.5,
                                "children": [],
                                "caption": "The band, illuminated by blue lights, continues their energetic performance on the brightly lit stage, the lead singer belting out a pop song as the guitarist and drummer maintain a steady rhythm."
                            },
                            {
                                "level": 3,
                                "start_time": 18.5,
                                "end_time": 21.5,
                                "children": [],
                                "caption": "The band, illuminated by the spotlight, continues their energetic performance, the lead singer belting out a pop song as the drummer keeps the beat."
                            }
                        ],
                        "caption": "The band, illuminated by blue lights, continues their energetic performance . Lead singer belting out a pop song as the guitarist and drummer maintain a steady rhythm ."
                    }
                ],
                "caption": "The band, dressed in black, performs on a brightly lit stage, their instruments illuminated by the spotlight . Lead singer belting out a pop song as the guitarist and drummer maintain a steady rhythm ."
            },
            {
                "level": 1,
                "start_time": 21.5,
                "end_time": 66.5,
                "caption": "The band, illuminated by blue lights, continues their energetic performance on the brightly lit stage, the lead singer belting out a pop song as the guitarist and drummer maintain a steady rhythm.",
                "children": []
            },
            {
                "level": 1,
                "start_time": 66.5,
                "end_time": 70.5,
                "children": [],
                "caption": "The band, illuminated by blue stage lights, continues their energetic performance, the drummer pounding the beat as the guitarist and keyboardist trade licks."
            },
            {
                "level": 1,
                "start_time": 70.5,
                "end_time": 155.5,
                "caption": "The band, illuminated by blue stage lights, continues their energetic performance, the lead singer belting out a pop song as the guitarist and drummer maintain a steady rhythm.",
                "children": []
            },
            {
                "level": 1,
                "start_time": 155.5,
                "end_time": 159.5,
                "children": [],
                "caption": "The band, illuminated by blue lights, continues their energetic performance on the brightly lit stage, their instruments a blur of motion as they play a pop song."
            },
            {
                "level": 1,
                "start_time": 159.5,
                "end_time": 164.5,
                "children": [],
                "caption": "The band, illuminated by blue and purple stage lights, continues their energetic performance, the lead singer belting out a pop song as the guitarist and drummer maintain a steady rhythm."
            },
            {
                "level": 1,
                "start_time": 164.5,
                "end_time": 170.5,
                "children": [],
                "caption": "The band, illuminated by blue lights, continues their energetic performance on the brightly lit stage, their instruments a blur of motion as they play a pop song."
            },
            {
                "level": 1,
                "start_time": 170.5,
                "end_time": 174.5,
                "children": [],
                "caption": "The band, illuminated by blue stage lights, continues their energetic performance, the lead singer belting out a pop song as the guitarist and drummer maintain a steady rhythm."
            },
            {
                "level": 1,
                "start_time": 174.5,
                "end_time": 178.5,
                "children": [],
                "caption": "The band, illuminated by blue lights, continues their energetic performance on the brightly lit stage, their instruments a blur of motion as they play a pop song."
            },
            {
                "level": 1,
                "start_time": 178.5,
                "end_time": 188.5,
                "children": [
                    {
                        "level": 2,
                        "start_time": 178.5,
                        "end_time": 184.5,
                        "children": [],
                        "caption": "The band, illuminated by blue stage lights, continues their energetic performance, the lead singer belting out a pop song as the guitarist and drummer maintain a steady rhythm."
                    },
                    {
                        "level": 2,
                        "start_time": 184.5,
                        "end_time": 188.5,
                        "children": [],
                        "caption": "The band, illuminated by blue lights, continues their energetic performance on the brightly lit stage, their instruments a blur of motion as they play a pop song."
                    }
                ],
                "caption": "The band, illuminated by blue stage lights, continues their energetic performance . Lead singer belting out a pop song as the guitarist and drummer maintain a steady rhythm ."
            },
            {
                "level": 1,
                "start_time": 188.5,
                "end_time": 228.5,
                "caption": "The band, illuminated by blue lights, continues their energetic performance on the brightly lit stage, their instruments a blur of motion as they play a pop song.",
                "children": []
            },
            {
                "level": 1,
                "start_time": 228.5,
                "end_time": 236.5,
                "children": [
                    {
                        "level": 2,
                        "start_time": 228.5,
                        "end_time": 232.5,
                        "children": [],
                        "caption": "The band, illuminated by blue lights, continues their energetic performance on the brightly lit stage, their instruments a blur of motion as they play a pop song."
                    },
                    {
                        "level": 2,
                        "start_time": 232.5,
                        "end_time": 236.5,
                        "children": [],
                        "caption": "The band, illuminated by blue stage lights, continues their energetic performance, the drummer pounding out a fast-paced rhythm as the guitarist and keyboardist trade licks."
                    }
                ],
                "caption": "The band, illuminated by blue lights, continues their energetic performance . The drummer pounding out a fast-paced rhythm as the guitarist and keyboardist trade licks ."
            },
            {
                "level": 1,
                "start_time": 236.5,
                "end_time": 331.875,
                "caption": "The band, illuminated by blue lights, continues their energetic performance on the brightly lit stage, the lead singer belting out a pop song as the guitarist and drummer maintain a steady rhythm.",
                "children": []
            }
        ],
        "caption": "The band, dressed in black, performs on a brightly lit stage, their instruments illuminated by the spotlight . The lead singer belting out a pop song as the guitarist and drummer maintain a steady rhythm ."
    },
    "rFA1jSO6pdg": {
        "level": 0,
        "start_time": 0.0,
        "end_time": 70.612208,
        "children": [
            {
                "level": 1,
                "start_time": 0.0,
                "end_time": 4.5,
                "children": [],
                "caption": "In a well-lit kitchen, a man with short, graying hair and a beard, wearing a blue shirt, stands in front of a refrigerator filled with food, speaking directly to the camera about his diabetes."
            },
            {
                "level": 1,
                "start_time": 4.5,
                "end_time": 65.5,
                "children": [
                    {
                        "level": 2,
                        "start_time": 4.5,
                        "end_time": 8.5,
                        "children": [],
                        "caption": "In a well-lit kitchen, a man with short, graying hair and a beard, wearing a blue shirt, stands in front of a shelf filled with various items, including a blue bucket and a red container, as he speaks directly to the camera."
                    },
                    {
                        "level": 2,
                        "start_time": 8.5,
                        "end_time": 22.5,
                        "caption": "A man with short, graying hair, wearing a blue shirt, stands in a well-lit kitchen, thoughtfully gesturing as he speaks about the importance of a healthy diet.",
                        "children": []
                    },
                    {
                        "level": 2,
                        "start_time": 22.5,
                        "end_time": 44.5,
                        "caption": "In a well-lit kitchen, a man with short, graying hair and a beard, wearing a blue shirt, stands in front of a refrigerator filled with various food items, as he speaks directly to the camera.",
                        "children": []
                    },
                    {
                        "level": 2,
                        "start_time": 44.5,
                        "end_time": 62.5,
                        "caption": "In a well-lit kitchen, a middle-aged man with short, graying hair and a beard, wearing a blue shirt, stands in front of a shelf filled with various canned goods and bottles, speaking directly to the camera with a serious expression.",
                        "children": []
                    },
                    {
                        "level": 2,
                        "start_time": 62.5,
                        "end_time": 65.5,
                        "children": [],
                        "caption": "In a well-lit kitchen, a man with short, graying hair and a beard, wearing a blue shirt, stands in front of a refrigerator filled with various food items, as he speaks directly to the camera."
                    }
                ],
                "caption": "In a well-lit kitchen, a man with short, graying hair and a beard, wearing a blue shirt, stands in front of a refrigerator filled with various food items, as he speaks directly to the camera ."
            },
            {
                "level": 1,
                "start_time": 65.5,
                "end_time": 70.612208,
                "children": [],
                "caption": "The video transitions from a close-up of a plate of food to a wider shot of a person enjoying a meal, accompanied by a change in music from electronic to pop."
            }
        ],
        "caption": "The video transitions from a close-up of a plate of food to a wider shot of a person enjoying a meal . In a well-lit kitchen, a man with short, graying hair and a beard, wearing a blue shirt, speaks directly to the camera ."
    },
    "sO3wd7X-l7U": {
        "level": 0,
        "start_time": 0.0,
        "end_time": 60.08,
        "children": [
            {
                "level": 1,
                "start_time": 0.0,
                "end_time": 3.5,
                "children": [],
                "caption": "The video opens with a close-up of a sleek, black Ford SUV, parked in a lot with other vehicles in the background, as a woman's voice begins to describe its features."
            },
            {
                "level": 1,
                "start_time": 3.5,
                "end_time": 14.5,
                "caption": "The video showcases a sleek black Ford SUV, highlighting its exterior design and features, while a woman's voiceover describes its impressive specifications.",
                "children": []
            },
            {
                "level": 1,
                "start_time": 14.5,
                "end_time": 29.5,
                "caption": "The camera pans across the sleek, black interior of the Ford SUV, showcasing the modern dashboard with its digital display and controls, while a woman's voice continues to describe the car's features.",
                "children": []
            },
            {
                "level": 1,
                "start_time": 29.5,
                "end_time": 60.08,
                "children": [
                    {
                        "level": 2,
                        "start_time": 29.5,
                        "end_time": 43.5,
                        "children": [
                            {
                                "level": 3,
                                "start_time": 29.5,
                                "end_time": 37.5,
                                "children": [],
                                "caption": "The camera pans across the sleek, modern interior of the Ford SUV, showcasing the spacious cabin with its comfortable seats and dashboard, all while upbeat pop music plays in the background."
                            },
                            {
                                "level": 3,
                                "start_time": 37.5,
                                "end_time": 43.5,
                                "children": [],
                                "caption": "The video showcases a sleek, black Ford SUV, highlighting its exterior design and features, while a woman's voiceover describes its impressive specifications."
                            }
                        ],
                        "caption": "The video showcases a sleek, modern Ford SUV, highlighting its exterior design and features . A woman's voiceover describes its impressive specifications . The camera pans across the sleek interior of the Ford SUV showcasing the spacious cabin ."
                    },
                    {
                        "level": 2,
                        "start_time": 43.5,
                        "end_time": 60.08,
                        "children": [
                            {
                                "level": 3,
                                "start_time": 43.5,
                                "end_time": 52.5,
                                "children": [
                                    {
                                        "level": 4,
                                        "start_time": 43.5,
                                        "end_time": 47.5,
                                        "children": [],
                                        "caption": "The video showcases a sleek, black Ford SUV, highlighting its exterior design and features, while a woman's voice continues to describe the car's specifications."
                                    },
                                    {
                                        "level": 4,
                                        "start_time": 47.5,
                                        "end_time": 52.5,
                                        "children": [],
                                        "caption": "The video transitions from showcasing the exterior of a white Ford SUV to the interior, where the camera pans across the spacious backseat, highlighting the comfortable seating and ample legroom."
                                    }
                                ],
                                "caption": "The video showcases a sleek, black Ford SUV, highlighting its exterior design and features . The video transitions from showcasing the exterior of a white Ford SUV to the interior, where the camera pans across the spacious backseat ."
                            },
                            {
                                "level": 3,
                                "start_time": 52.5,
                                "end_time": 60.08,
                                "children": [],
                                "caption": "The video transitions from the car's interior to a close-up of the Ford logo, while a woman's voice continues to describe the car's features, including its backup camera and Bluetooth connectivity."
                            }
                        ],
                        "caption": "The video showcases a sleek, black Ford SUV, highlighting its exterior design and features . The video transitions from showcasing the exterior of a white Ford SUV to the interior, where the camera pans across the spacious backseat ."
                    }
                ],
                "caption": "The video showcases a sleek, modern Ford SUV, highlighting its exterior design and features . A woman's voiceover describes its impressive specifications . The camera pans across the sleek interior showcasing the spacious cabin ."
            }
        ],
        "caption": "The video opens with a close-up of a sleek, black Ford SUV, parked in a lot with other vehicles in the background . A woman's voiceover describes its impressive specifications . The camera pans across the sleek interior showcasing the spacious cabin ."
    },
    "m1ESWlMVugc": {
        "level": 0,
        "start_time": 0.0,
        "end_time": 171.037533,
        "children": [
            {
                "level": 1,
                "start_time": 0.0,
                "end_time": 39.5,
                "children": [
                    {
                        "level": 2,
                        "start_time": 0.0,
                        "end_time": 16.5,
                        "caption": "The video showcases a sleek black Chevrolet Cruze parked in a lot, its modern design and shiny exterior highlighted as a woman's voice describes its features.",
                        "children": []
                    },
                    {
                        "level": 2,
                        "start_time": 16.5,
                        "end_time": 29.5,
                        "caption": "The sleek black sedan, parked in a lot with other cars in the background, gleams under the sunlight as a woman's voice advertises its features, including a backup camera and Bluetooth connectivity.",
                        "children": []
                    },
                    {
                        "level": 2,
                        "start_time": 29.5,
                        "end_time": 39.5,
                        "caption": "The video showcases a sleek black Chevrolet Spark parked in a lot, its modern design and shiny exterior highlighted as a woman's voice describes its features.",
                        "children": []
                    }
                ],
                "caption": "The video showcases a sleek black Chevrolet Cruze parked in a lot . The sleek black sedan gleams under the sunlight as a woman's voice advertises its features, including backup camera and Bluetooth connectivity ."
            },
            {
                "level": 1,
                "start_time": 39.5,
                "end_time": 64.5,
                "children": [
                    {
                        "level": 2,
                        "start_time": 39.5,
                        "end_time": 47.5,
                        "children": [
                            {
                                "level": 3,
                                "start_time": 39.5,
                                "end_time": 43.5,
                                "children": [],
                                "caption": "The video showcases a sleek black sedan parked in a lot, highlighting its modern design and shiny exterior under the bright sunlight."
                            },
                            {
                                "level": 3,
                                "start_time": 43.5,
                                "end_time": 47.5,
                                "children": [],
                                "caption": "The video showcases a black Chevrolet Spark parked in a lot, highlighting its sleek design and modern features, while a woman's voice describes its impressive fuel efficiency."
                            }
                        ],
                        "caption": "The video showcases a sleek black sedan parked in a lot, highlighting its modern design and shiny exterior under the bright sunlight . A woman's voice describes its impressive fuel efficiency ."
                    },
                    {
                        "level": 2,
                        "start_time": 47.5,
                        "end_time": 64.5,
                        "caption": "The video showcases a black Chevrolet Spark parked in a lot, highlighting its sleek design and modern features, while a woman's voice describes its impressive fuel efficiency.",
                        "children": []
                    }
                ],
                "caption": "The video showcases a sleek black sedan parked in a lot, highlighting its modern design and shiny exterior under the bright sunlight . A woman's voice describes its impressive fuel efficiency ."
            },
            {
                "level": 1,
                "start_time": 64.5,
                "end_time": 130.5,
                "children": [
                    {
                        "level": 2,
                        "start_time": 64.5,
                        "end_time": 85.5,
                        "caption": "The camera pans across the sleek, black sedan, highlighting its shiny exterior and modern design, as a woman's voice continues to describe its features.",
                        "children": []
                    },
                    {
                        "level": 2,
                        "start_time": 85.5,
                        "end_time": 130.5,
                        "caption": "The camera pans across the sleek, modern interior of the car, showcasing the spacious backseat and the dashboard with its digital display and various controls, while upbeat pop music plays on the car stereo.",
                        "children": []
                    }
                ],
                "caption": "The camera pans across the sleek, black sedan, highlighting its shiny exterior and modern design, as a woman's voice continues to describe its features ."
            },
            {
                "level": 1,
                "start_time": 130.5,
                "end_time": 171.037533,
                "children": [],
                "caption": "The camera pans across the sleek, modern interior of the car, showcasing the dashboard with its digital display and various controls, while upbeat pop music plays on the car stereo."
            }
        ],
        "caption": "The video showcases a sleek black Chevrolet Cruze parked in a lot . The sleek black sedan gleams under the sunlight as a woman's voice advertises its features, including backup camera and Bluetooth connectivity ."
    },
    "mV2SlDO7GZg": {
        "level": 0,
        "start_time": 0.0,
        "end_time": 71.638305,
        "children": [
            {
                "level": 1,
                "start_time": 0.0,
                "end_time": 4.5,
                "children": [],
                "caption": "The camera pans across a vast, sandy beach, the gentle waves lapping at the shore as a man's voice can be heard, though his words are unclear."
            },
            {
                "level": 1,
                "start_time": 4.5,
                "end_time": 27.5,
                "children": [],
                "caption": "A man, wearing sunglasses and a blue shirt, stands on a beach with the ocean and a clear blue sky behind him . He smiles at the camera as he enjoys the sunny day and the sound of the waves ."
            },
            {
                "level": 1,
                "start_time": 27.5,
                "end_time": 32.5,
                "children": [],
                "caption": "A man, wearing sunglasses and a blue shirt, stands on a sandy beach, his gaze fixed on the vast ocean as he speaks to the camera, his voice filled with awe at the beauty of the scene."
            },
            {
                "level": 1,
                "start_time": 32.5,
                "end_time": 71.638305,
                "caption": "The camera pans across the vast, turquoise ocean, capturing the gentle waves lapping against the shore as a man's voice can be heard faintly in the background.",
                "children": []
            }
        ],
        "caption": "The camera pans across a vast, sandy beach, the gentle waves lapping at the shore as a man's voice can be heard, though his words are unclear . A man, wearing sunglasses and a blue shirt, stands on a beach with the ocean and a clear blue sky behind him"
    },
    "n8Da3jHuFjM": {
        "level": 0,
        "start_time": 0.0,
        "end_time": 30.8,
        "children": [
            {
                "level": 1,
                "start_time": 0.0,
                "end_time": 3.5,
                "children": [],
                "caption": "A sleek, black motorcycle, its engine roaring, is showcased in a close-up shot, the camera capturing its design and the rider's skillful maneuvering through a winding road."
            },
            {
                "level": 1,
                "start_time": 3.5,
                "end_time": 9.5,
                "children": [],
                "caption": "The sleek black motorcycle, parked on a textured surface, gleams under the bright lights as a man's voice, seemingly unrelated to the motorcycle, can be heard in the background."
            },
            {
                "level": 1,
                "start_time": 9.5,
                "end_time": 14.5,
                "children": [],
                "caption": "The video showcases a sleek, black motorcycle with a prominent \"C\" logo on its fuel tank, highlighting its design and features as it moves smoothly on a paved surface."
            },
            {
                "level": 1,
                "start_time": 14.5,
                "end_time": 20.5,
                "children": [],
                "caption": "The video showcases a sleek black motorcycle, its engine roaring to life as it speeds down a winding road, its rider expertly maneuvering through the curves."
            },
            {
                "level": 1,
                "start_time": 20.5,
                "end_time": 24.5,
                "children": [],
                "caption": "The sleek black motorcycle, its engine roaring, speeds down a winding road, its rider expertly maneuvering through the curves as the upbeat pop music continues to play."
            },
            {
                "level": 1,
                "start_time": 24.5,
                "end_time": 30.8,
                "children": [],
                "caption": "The video showcases a sleek black motorcycle, its shiny exterior gleaming under the spotlight as a man's voice enthusiastically describes its features, including the \"Cool\" emblem and the \"Cool\" logo on the tank."
            }
        ],
        "caption": "A sleek black motorcycle, its engine roaring, is showcased in a close-up shot . The video showcases a sleek, black motorcycle with a prominent \"C\" logo on its fuel tank . A man's voice, seemingly unrelated to the motorcycle, is heard in the background ."
    },
    "nCMbcOm54zU": {
        "level": 0,
        "start_time": 0.0,
        "end_time": 139.166667,
        "children": [
            {
                "level": 1,
                "start_time": 0.0,
                "end_time": 16.5,
                "caption": "The camera pans across a lush green forest, following a path through the undergrowth as a woman's voice can be heard, though her words are unclear.",
                "children": []
            },
            {
                "level": 1,
                "start_time": 16.5,
                "end_time": 24.5,
                "children": [],
                "caption": "A black and white dog, its tail wagging, walks along a dirt path through a lush forest, its paws kicking up dust as a woman's voice can be heard, though she is not visible."
            },
            {
                "level": 1,
                "start_time": 24.5,
                "end_time": 32.5,
                "children": [],
                "caption": "A black and white dog, its tail wagging, walks along a dirt path in a lush green forest, its paws kicking up dust as it follows a person who is walking ahead."
            },
            {
                "level": 1,
                "start_time": 32.5,
                "end_time": 40.5,
                "caption": "A black and white dog, its tail wagging, walks along a dirt path through a lush green forest, its paws kicking up dust as a woman's voice can be heard saying \"Bye, bye.\"",
                "children": []
            },
            {
                "level": 1,
                "start_time": 40.5,
                "end_time": 46.5,
                "children": [],
                "caption": "A black and white dog walks along a dirt path, its tail wagging excitedly as a woman's voice excitedly exclaims \"Oh my god!\" and \"Oh my god, look at that!\""
            },
            {
                "level": 1,
                "start_time": 46.5,
                "end_time": 50.5,
                "children": [],
                "caption": "A black and white dog walks along a dirt path, its tail wagging excitedly as a woman's voice can be heard in the background, saying \"Oh, I'm sorry.\""
            },
            {
                "level": 1,
                "start_time": 50.5,
                "end_time": 61.5,
                "caption": "A man and a woman are walking their two dogs, a black and white one and a brown and white one, through a sunny forest, the dogs sniffing at the ground as they walk.",
                "children": []
            },
            {
                "level": 1,
                "start_time": 61.5,
                "end_time": 95.5,
                "caption": "The two dogs, a black and white one and a smaller brown and white one, are walking along a dirt path through a lush forest, their paws kicking up dust as they follow their human companion.",
                "children": []
            },
            {
                "level": 1,
                "start_time": 95.5,
                "end_time": 109.5,
                "children": [
                    {
                        "level": 2,
                        "start_time": 95.5,
                        "end_time": 99.5,
                        "children": [],
                        "caption": "The two dogs, a black and white one and a smaller brown and white one, are walking along a dirt path through a forest, their paws kicking up dust as they follow their human companion."
                    },
                    {
                        "level": 2,
                        "start_time": 99.5,
                        "end_time": 104.5,
                        "children": [],
                        "caption": "A man and a woman are walking their two dogs, a black and white one and a brown and white one, through a sunny forest, the dogs sniffing at the ground as they walk."
                    },
                    {
                        "level": 2,
                        "start_time": 104.5,
                        "end_time": 109.5,
                        "children": [],
                        "caption": "Two dogs, a black and white one and a smaller brown and white one, are walking along a dirt path through a forest, their paws kicking up dust as they follow a man's voice calling out \"Hey, guys!\""
                    }
                ],
                "caption": "A man and a woman are walking their two dogs through a sunny forest . The two dogs, a black and white one and a smaller brown and white ones, are walking along a dirt path through a forest, their paws kicking up dust as they follow their human companion ."
            },
            {
                "level": 1,
                "start_time": 109.5,
                "end_time": 123.5,
                "children": [],
                "caption": "Two dogs playfully running and jumping in a grassy field, their joyful barks echoing in the air . A woman's voice can be heard saying \"Bye, bye\" Two dogs walk side by side on a dirt path through a forest, their tails wagging as they enjoy"
            },
            {
                "level": 1,
                "start_time": 123.5,
                "end_time": 139.166667,
                "children": [],
                "caption": "Two dogs, a black and white one and a smaller brown and white one, walk side by side on a dirt path through a forest, their tails wagging as they enjoy the sunny day."
            }
        ],
        "caption": "The camera pans across a lush green forest, following a path through the undergrowth as a woman's voice can be heard, though her words are unclear . A man and a woman are walking their two dogs through a sunny forest, the dogs sniffing at the ground as they walk ."
    },
    "k4T-OsT6_CQ": {
        "level": 0,
        "start_time": 0.0,
        "end_time": 116.983533,
        "children": [
            {
                "level": 1,
                "start_time": 0.0,
                "end_time": 8.5,
                "children": [
                    {
                        "level": 2,
                        "start_time": 0.0,
                        "end_time": 3.5,
                        "children": [],
                        "caption": "A vibrant red pomegranate, bursting with seeds, hangs from a branch against a backdrop of lush green leaves, as a man's voice begins to speak."
                    },
                    {
                        "level": 2,
                        "start_time": 3.5,
                        "end_time": 8.5,
                        "children": [],
                        "caption": "The camera zooms in on a vibrant pink flower with glossy green leaves, its petals gently swaying in the breeze as a man's voice begins to speak."
                    }
                ],
                "caption": "The camera zooms in on a vibrant pink flower with glossy green leaves, its petals gently swaying in the breeze . A vibrant red pomegranate, bursting with seeds, hangs from a branch against a backdrop of lush green leaves ."
            },
            {
                "level": 1,
                "start_time": 8.5,
                "end_time": 24.5,
                "children": [
                    {
                        "level": 2,
                        "start_time": 8.5,
                        "end_time": 16.5,
                        "caption": "A man, standing in a garden with a brick wall and a building in the background, speaks directly to the camera, explaining that he's going to show how to prune a pomegranate tree.",
                        "children": []
                    },
                    {
                        "level": 2,
                        "start_time": 16.5,
                        "end_time": 24.5,
                        "children": [
                            {
                                "level": 3,
                                "start_time": 16.5,
                                "end_time": 21.5,
                                "children": [],
                                "caption": "A man, standing in a garden with a brick wall and a building in the background, speaks directly to the camera, explaining that he's going to prune his pomegranate tree to encourage more fruit."
                            },
                            {
                                "level": 3,
                                "start_time": 21.5,
                                "end_time": 24.5,
                                "children": [],
                                "caption": "A man, standing in a garden with a brick wall and a building in the background, holds a small orange tree branch with vibrant red fruits, explaining that the tree is producing fruit for the first time this year."
                            }
                        ],
                        "caption": "A man, standing in a garden with a brick wall and a building in the background, explains that he's going to prune his pomegranate tree to encourage more fruit . A man explains that the tree is producing fruit for the first time this year ."
                    }
                ],
                "caption": "A man, standing in a garden with a brick wall and a building in the background, explains that he's going to show how to prune a pomegranate tree . He explains that the tree is producing fruit for the first time this year ."
            },
            {
                "level": 1,
                "start_time": 24.5,
                "end_time": 51.5,
                "children": [],
                "caption": "A man, standing in a garden with a brick wall and a building in the background, continues his explanation about the pomegranate tree, gesturing towards the tree as he speaks."
            },
            {
                "level": 1,
                "start_time": 51.5,
                "end_time": 62.5,
                "caption": "A man, standing in a garden filled with lush greenery, holds up a small, red fruit, explaining that it's a pomelo, a type of citrus fruit.",
                "children": []
            },
            {
                "level": 1,
                "start_time": 62.5,
                "end_time": 109.5,
                "caption": "A man, standing in a garden filled with lush greenery, explains how to prune a pomegranate tree . A man reaches out to pick a red fruit from a tree, his hand brushing against the leaves as he does so .",
                "children": []
            },
            {
                "level": 1,
                "start_time": 109.5,
                "end_time": 116.983533,
                "children": [
                    {
                        "level": 2,
                        "start_time": 109.5,
                        "end_time": 113.5,
                        "children": [],
                        "caption": "As the video concludes, a simple black screen appears, displaying the words \"THANKS FOR WATCHING\" in white, accompanied by a brief musical jingle."
                    },
                    {
                        "level": 2,
                        "start_time": 113.5,
                        "end_time": 116.983533,
                        "children": [],
                        "caption": "Against a black background, the words \"THANKS FOR WATCHING\" appear on the screen, while a woman's voice can be heard faintly in the background."
                    }
                ],
                "caption": "As the video concludes, a simple black screen appears, displaying the words \"THANKS FOR WATCHING\" in white, accompanied by a brief musical jingle ."
            }
        ],
        "caption": "A video shows a man explaining how to prune a pomegranate tree . The video concludes with the words \"THOWING FOR WATCHING\""
    }
}