{
    "olZPuJTwh0s": {
    "duration": 551.0,
    "timestamps": [
        [
            5.0,
            15.0
        ],
        [
            15.0,
            21.385578231292516
        ],
        [
            21.64,
            73.65369614512471
        ],
        [
            79.08,
            104.08
        ],
        [
            115.88,
            189.0
        ],
        [
            189.0,
            227.72
        ],
        [
            227.72,
            247.68
        ],
        [
            251.52,
            258.84
        ],
        [
            261.88,
            280.8901587301587
        ],
        [
            287.08,
            335.52
        ],
        [
            335.52,
            382.92
        ],
        [
            382.92,
            386.92
        ],
        [
            386.92,
            440.16
        ],
        [
            446.56,
            469.1824036281179
        ],
        [
            475.0,
            507.6
        ],
        [
            507.6,
            511.34984126984125
        ],
        [
            511.84,
            527.28
        ],
        [
            527.28,
            546.9228117913832
        ]
    ],
    "sentences": [
        "Inside the bustling LuLu Hypermarket, shoppers browse aisles under bright lights, the modern space alive with movement as electronic music plays over the loudspeaker.",
        "The camera glides through the vibrant aisles of LuLu Hypermarket, showcasing a kaleidoscope of international products, before focusing on a display of colorful Pinoy beverages and condiments.  A snippet of someone speaking cuts through the electronic music, quickly replaced by the distinct energetic strumming of a punk rock song.",
        "The camera moves through the brightly lit aisles of LuLu Hypermarket, passing shelves stacked with colorful products and promotional signs, while upbeat reggae and pop music plays over the loudspeaker.",
        "A man wearing a hairnet and face mask reaches into a brightly lit deli display case filled with cooked meals and delicacies, packaging a pre-packaged meal as upbeat pop music plays over the loudspeaker.",
        "As the camera moves through the bustling mall, capturing the ribbon-cutting ceremony at the entrance of a store adorned with Philippine flags, the lively pop and reggae music playing over the loudspeaker transitions to a celebratory electronic tune for the cake-cutting ceremony of Pinoy Fiesta 2018, where attendees in formal attire gather around the elaborately decorated cake.",
        "As the celebratory electronic music continues to play over the loudspeaker, the camera pans across the lively scene at the Pinoy Fiesta 2018, showing a refrigerated display case filled with packaged food, before focusing on a chef in a white uniform who is interacting with a crowd of people gathered around the table.",
        "At the Pinoy Fiesta 2018, two men in formal attire engage with a vendor at a booth showcasing \"Chicken Shanghai Beef Emboni,\" surrounded by a lively crowd as pop and electronic music play over the loudspeaker.",
        "In a lively, crowded space, possibly a food court within the LuLu Hypermarket, a woman smiles and waves at the camera, her cheerful mood reflecting the upbeat pop music playing over the loudspeaker.",
        "The food court bustles with activity as people browse food stalls and enjoy the festive atmosphere, the pop music transitioning to a folk tune playing over the loudspeaker.",
        "The camera pans across a vibrant buffet spread at LuLu Hypermarket, showcasing skewers of various meats and vegetables arranged on banana leaves, followed by large metal pans filled with colorful dishes, as upbeat music transitions to a woman speaking in a foreign language, then back to pop music.",
        "The bustling market scene shifts from men in suits examining fruit to a close-up of a hand selecting cheese from a brightly lit display case, all while a conversation about food and the Olympics can be heard, eventually fading into lively pop music as a group of dancers in colorful costumes enlivens the supermarket aisle.",
        "A smiling woman with long, straight hair, wearing a green and white patterned top, appears on screen as a pop song plays over the loudspeaker, her cheerful energy matching the upbeat music of the LuLu Hypermarket.",
        "The camera follows a man in a suit as he walks through a hallway towards a formally dressed crowd, then focuses on a woman smiling during a conversation, the audio capturing snippets of their chatter amidst the lively atmosphere of the event.",
        "A woman with long, straight hair, wearing a patterned top, looks down at something in her hands, then looks up and takes a sip from a glass of orange juice as a man speaks in the background.",
        "As a meticulously prepared meal is served on a dining table amidst a lively gathering, the sound of chatter and laughter fills the air, capturing the warmth and camaraderie of the occasion.",
        "Two women in a supermarket smile and wave at the camera as someone offscreen chats and laughs with them.",
        "In a brightly lit grocery store, a woman with long dark hair, wearing a green top, smiles at the camera as she chats and laughs with a friend about someone they both know, the sounds of their lively conversation echoing through the store.",
        "A woman with long dark hair, wearing a green top, smiles brightly for the camera in the brightly lit LuLu Hypermarket, laughing and chatting with someone offscreen in a foreign language."
    ]
}
}