{
  "video_id": "-__OUrHGeuU",
  "transcription": " Why the world as a whole today lies in a state of confusion?  in managing and meeting the expectations of the youth. It calls for new ideas, innovation, ability to work together with an open mind. I feel the first and foremost thing in this regard would involve our ability to work together, cutting across national and international boundaries. Reflecting the deep conviction, the people of this land, Tripura of North East India,  that you shared with the people of Bangladesh through an Abhinno Akash, an Abhinno Batash, Abhinno Kovita, and Abhinno Shur. It was in that great spirit of the occasion that Bangladesh had embarked on this incomparable journey of cooperation with you, India's remarkable northeastern region. Agartala was our war capital of the Bengali people  and all of Northeast India was our refuge together with West Bengal and many other parts of India. On that visit, with the people of Northeast India in the backdrop of all the pains that they had suffered and the sacrifices they had made, we re-bonded and laid the basis of a future between India's Northeast and Bangladesh. I believe that we established exemplary paths and processes  We have established multiple fields of cooperation in trade, joint marketplaces called huts, energy, access to ports, building new roads, railway connectivity, enabled the carriage of food, goods and equipment for construction. No doubt, most of you are aware of the many areas in which we have ushered cooperation and proposed to do in the near and long term. Yet, the possibilities remain enormous.  and incalculable.  silk, guti silk and shuta, the thread of the silk. In the government sector most probably you have that. And if you have that, we have a business delegation from Bangladesh. They're very keen to sign contracts because we are now buying silk from China and that too most of the silk is not original silk. So we are also losing our silk industries. So we'll be very happy to discuss silk, of Tripura silk, to develop together with Bangladesh.  Lukist policy is an extremely innovative, it was revolutionary when it was brought in in the 1990s, is extremely innovative, is extremely meaningful. It has to remain an essential part of India's foreign policy. Second, if you are looking at the external pillars for Lukist policy,  two most important countries would remain, they are and would remain Bangladesh and Myanmar. Thirdly, nature itself has intended that the Northeast should be the pivot when it comes to executing India's truth-based policy. And lastly, Northeast, for the Northeast, a role similar to that that Yunnan province in China  China plays for China is both desirable and doable. You are thinking of Tripura as something bigger than the limitations geography or history has imposed on it. And I also subtitled it learning and not learning or unlearning from China. See China is a model, is a very attractive model. People talk about China's infrastructure, China's big wide roads. But it's important to take, I mean think beyond just infrastructure, beyond the  smoothness, the shine, and the gloss that you see in China. So in a sense, we have a contradiction. We are a federal republic, but our union government is very strong. In China, we all assume the central government is very strong. But in fact, there is a great deal of negotiation, give and take, between the center and the provinces. The central government is very strong politically, yes. Nobody can challenge the central government. But in matters of economics, of relations with foreign countries,  The central government is extremely flexible. There's a great deal of freedom in economic foreign policy making to China's provinces. For different regions of China, different provinces of China, whichever country they border, they focus on that country. And therefore, Tripura is ideally located to focus on Bangladesh."
}