{
  "video_id": "0dJSPsXCujc",
  "transcription": " Okay guys, I just put my hair up. I'm literally not even trying hard right now just because I need something quick I need to look like a decent human being I need to look like I am awake basically I have Atlas I have a son so you know there are days where I just need to look like a decent person right now I'm going to be using the Urban Decay  I'm using the North Mama sunscreen. It's like a tint and basically it's like an everyday use type of thing and it's good for your skin. It has SPF 40. And yeah, I'm just going to go ahead and try this out. There's a light to medium tint and there's also a medium dark tint. Depending on what your skin color is, you can use either or. But since I'm light skin, I can use the medium dark tint as like a contour, like a, just kind of give me a little sharp, sharpness, a little bit more high cheekbones.  I'm going to try this out.  I  Protect your face from the sun, you know? Protect you from getting all those fine lines. It's kind of like an anti-aging type of ordeal here. As you can see, it gave me nice coverage. And this is the light medium tint, so it does kind of look on the lighter side. But, yeah. I don't know, I like it. It does feel kind of sticky, so if you're not really used to that, I don't know, that could be an issue. But honestly, I don't mind it, just because  I  foundation basically. And this is like a foundation because it actually works like a foundation. It's just crazy. I'm just going to smudge it in. And what I'm going to do is actually put powder over so that way it kind of just blends nicely.  A little bit of blush Already looking like myself And then a little bit of lipstick. This is a Marc Jacobs called kiss kiss bang bang  Bang, so yeah, that's all it takes. I didn't even use foundation. This is sunscreen. It's going to protect my face I just put a little bit of powder and blush did my brows and Some lipstick so yeah, this could be considered like you know some type of makeup tutorial But it's something kind of quick it doesn't take me that long to do so it's literally under 10 minutes, so um yeah, this is this is what I did so let's get ready because I need to go and I need to get  I need to get some errands done. Okay guys, so this is kind of like my final look. So yeah, as you can see, I have my makeup on, I feel good, I feel confident about myself, and I have just like a little accessory piece just to give me a little bit of style, a little bit of flair. And just, you know, it's cold right now, so I just kind of want, you know, something cuddly, a little sweater, some jeans, and then I just have my, I just have my all-stars on. So yeah, this is the kind of look.  Hey guys, so to give you a quick update, I've just been super busy. I find myself just trying to complete all my tasks, but it's hard because it's very unknown with my son. He needs a lot of attention right now. He's in this stage where he's crawling, he's wanting to walk. I feel like right now has actually been the hardest stage for me.  I'm trying to complete everything that I need to do and then you know maintain and help out with my son So it's it's a different world right now for me, but I'm trying I'm trying yeah today I'm just gonna be doing errands. I need to clean my car. It's a hot mess I just I hate a dirty car let alone a hate dirty space so I try my best to clean up as much as possible and I have a lot of preparation to do my one of my best friends is getting married, so I'm gonna be in her wedding  So I have to make sure like everything is packed up packed up for my son and just make sure I'm okay because she's getting married in LA So yeah, it's a couple hours out. So I just need to prepare and like just make sure like I'm on point with everything So yeah, that's just where my life's been. It's been kind of I've just been everywhere. I'm busy. I've been a mom I got busy mom Yeah, thinker pop baby pop doing are you just doing cute little baby things?  right now? Happy camper? Hi my stinker binker butt. Hi my stinker binker butt. Tell everyone that you're going to be eight months soon. Eight months. Wow. Wow.  you"
}