{
  "video_id": "1KRgCamTNu0",
  "transcription": " Hey! I need to ask a favor of you all, my viewers.  what to like or what to dislike. You're all adults, or some of you are kids watching this as well. You can make up your own mind on what you like and what you dislike. But I'm going to ask you to go over to the Maryland Grain Producers Facebook page. And I'll try to leave a link in the description of this video below. I don't have a full  Facebook account myself. I don't do Facebook. I don't do Instagram. I don't do Snapchat. But hey, TikTok. I just learned last night. Apparently TikTok is the latest and greatest. I have downloaded it on my phone. I did that last night when I found out about this. So there it is. You probably can't see it, but TikTok is right there on my phone. I'll see what that's all about. So back to Facebook.  Maryland Grain Producers Facebook page. They are doing a harvest photo contest right now. Started, I think, yesterday, ends this Friday. So they've posted photos that have been submitted by farmers, farmers' wives, and the like of operations. I don't know if it's limited to just here in Maryland or maybe the Delmarva area.  I'm not sure, but my photo was on there. So the photo that I submitted was the one where my wheel fell off of the combine. When I submitted the photo, I told the organization, look, everybody submits a photo of a combine in a cornfield with the sun setting in the background, or everybody submits a photo with their kid or their grandkid in the cornfield  shucking in the ear of corn or holding in the ear of corn or riding on a tractor. Yeah, that's all well and good, but the reality is we all have bad days on the farm. And so I'm one that always goes against the grain, not with the grain, so I submitted the photo of my bad day and the wheel laying on the ground next to the combine.  to the Maryland Grain Producers Facebook page and like my photo. Or like any of the other photos. So apparently, just a simple contest. The photo with the most likes gets the winner's category, gets the gold trophy. No, actually, the winner, I think, gets a $25 Amazon gift card. So I imagine this contest is  Just like U.S. elections, vote early and vote often. Vote as many times as you can. I don't know. As I said, I don't do Facebook. I'm not sure how that works. Now that I think about it, if I win, what am I gonna do with a $25 Amazon gift card? Because I don't do Amazon either. I guess I'll donate the gift card to our local school PTA or the local school.  I think she shops Amazon all the time. I always see the boxes on the front porch when I get home. But she's not a charity case. So, hey, if I win, I'll give the Amazon gift card to somebody that needs it. So head on over there and vote. But yeah, you don't have to vote for my photo. Vote for any photo you like, I guess. It's a free country. You can do what you want. As I said, vote early.  and vote often. So I did verify my photo is on the Facebook page. I cannot like it since I don't have an account with Facebook. But if you have an account, you can like it, I guess. Okay, let me get back to work here. Enough begging and pleading from you all. See ya.  Thank you!"
}