{
  "video_id": "1QrVqf8eLOE",
  "transcription": " Music  you guys really did enjoy was the Airspun vs. Banana Powder and I have gotten a lot of comments from you guys, you know, telling me, you know, that I should try Topaz instead of Banana Powder because it would complement my skin better, I'm guessing. Yeah. So I already did have some of Ben Nye's Topaz Powder and I thought today I would compare it with, after I wasted it everywhere, the Ben Nye Banana Powder.  So I'm going to compare those two powders side by side as soon as I get it off of my hands because I didn't have the top on it and it got everywhere. Okay. So first I'm going to go in with my concealer and I don't know if I want to use Fond or Toffee. Fond is lighter than Toffee. But you know, most of the time I do use Fond. So I guess I'll go with Fond today. So I'm just going to put the concealer under my eyes.  Beauty Blender Taupe Powder  Topaz on this side and benign on this side  Topaz.  And now I'm going to turn the powder puff around so that I'm not like mixing the powder and I'm going to go in with Ben Nye.  I have fallout everywhere. It's the name of the game. Okay. I'm going to let that sit for a while and I'm going to set the rest of my face with just my MAC Mineralize Skin Finish Powder.  I'm going to dust off the powder and it is judgment day for these powders. I'm going to start with the Topaz because it sat longer. I can already tell that the Topaz is probably going to be so gorgeous. I don't know why I haven't been using it. It's just been sitting here on my vanity collecting dust. I also have Sienna. I don't know but Sienna and Topaz look almost exactly the same to me.  Ebony  I have topaz which I really don't use and I have sienna which I really don't use and I also have the bin not neutral which I don't use so You guys know any suggestions with those powders go ahead and drop it in the comment box I would greatly appreciate it, but I'm gonna go ahead and start to dust I Don't know guys ah ah ah You know let me go ahead and finish the rest of my makeup, and then we'll have a discussion  you  Okay, what do you guys think so I have on light makeup  Topaz Ben Nye  let me know in the comment box and again if you guys have any suggestions on what I should do with Sienna and what I should do with Ben Nye neutral set please do not hesitate to let me know because they have just been sitting on my vanity with no use. So that's it guys thank you so much for watching as always go ahead and subscribe I'm here multiple times a week and I'll see you guys later bye  you"
}