{
  "video_id": "26BT7YzpzQs",
  "transcription": " My world's so bright, it's hard to breathe, but that's alright. Hush!  I  Oh  Yeah  I  I  I'm never slowing down, keep on going till I'm tired I'm never slowing down, keep on going till I'm tired I'm never slowing down, keep on going till I'm tired  I  So I stay within my lane, feel my blood pump through my veins Feel adrenaline, no pain, welcome all to my domain So let me break, break, break it all down for you I ain't never giving up, I ain't never giving up You know I'ma take, take, taking that crown from you I ain't worried bout ya, I ain't even impressed So let me break, break, break it all down for you I ain't never giving up, I ain't never giving up You know I'ma take, take, taking that crown from you I ain't worried bout ya, I ain't even impressed  Break, break, break it all down for you I ain't never giving up, I ain't never giving up You know I'm take, take, taking that crown from you I ain't worried bout your hidey, hidey, hidey So let me break, break, break it all down for you I ain't never giving up, I ain't never giving up You know I'm take, take, taking that crown from you I ain't worried bout your hidey, hidey, hidey  Oh  Back back back back back to those days I was running running running running running in one place  I  Gucci, Gucci, Gucci, Gucci, Gucci They be proper truthful He's white and he's speaking fast and seeing lots of nips But I get it, I get it, I fit in everything I'm a motherfuckin' wanna murder that beat But I get it, I get it, I spread it, not credit I get it from Reddit, I read it from Reddit I get it repetitive, in and out, finna die Look at my words again, wanna start shit again Really wanna start shit again Really wanna start shit again Where the blood to all of those days In your bedroom, recruiting for phase You just a chip, stay with what we play Fetishizing bout buying some jades But you got no money to pay Ask mom, she says, it's just a phase You starting days Eating donuts, stay with what we playing Shit  7, nice!  No, I don't wanna waste what's left. And on and on we'll go. Through the wastelands, through the highways. Through my shadow, through the sun rays. And on and on we'll go.  I'm gonna go to the lobby, wait for me.  Oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh, oh,"
}