{
  "video_id": "2a0O3-5Fpyw",
  "transcription": " What's up guys welcome back to the channel today let's talk about my 13 reasons why I love the Mavic 2 Pro but let's find a more beautiful place to talk about that let's go  So guys I finally found a quiet place to talk to you about my 13 reasons why I love this Mavic 2 Pro. They are not in order that mean the biggest reason and the baddest one. No, this is all my 13 reasons small or big why I really love this drone and why I didn't use my Phantom 4 Pro  anymore since I have the Mavic 2 Pro. And before starting, welcome back guys. Thank you for those of you who are watching the premiere actually. I'm really happy to see you. Now let's start with the following reasons. First reason, the built-in quality. I mean this drone is really nice made, it's really solid, except the gimbal which I think it's a little bit fragile. When you have it in your hands you directly see that you don't have a cheaper drone. I almost crashed it one time I think and I was so surprised that  that nothing happened to it. So I'm really happy with that. Reason number two is how fast it is to take off. And I compare this to the Phantom 4 Pro and I like the fact that you don't need to put the props on or off after every flight. And also because everything is so small and removable, I think it's the term, so it make it really easy and fast. And I really love that. Reason number three, and it can comes with the reason number two, is how easy it is to travel with or just going  out with this drone. If you know me a little bit guys, you know that I have a Phantom 4 Pro Plus 2 and I can tell you since I have the Mavic 2, I didn't use it. I think having a small drone with that quality gives you more motivation to go out because the Phantom 4 Pro is really big and if you want to go out with the camera, the drone, all your camera gear, I can tell you guys with the Phantom 4 Pro you need to have two backpacks. So it's a motivation breaker I think and that's why I love the Mavic 2 Pro.  because I can have only one backpack with all my camera gear, my drones, my batteries, my lenses, everything in one bag. Reason number four is simply the low noise with that new prop system that DJI made. Compared to the Mavic Air and the Phantom 4 Pro, they are really more loud than the Mavic 2 Pro, so it's another thing that I love. Reason number five is simply the image quality. I'm always impressed by my footage after a trip,  The video guys also tell me that all my videos look great in terms of image quality so I'm really happy with that. D-log M gives you so many options in post for color grading so I really love the image quality of this small drone and the Hasselblad camera is crazy. And by the way guys if you want to check my Mavic 2 Pro settings you can check this video just if you want. Number 6 Hyperlapse I love it. You have so much possibilities in terms of hyperlapse, so much different modes and  If you want to know how to do it, I also have a video about this that I made a few weeks ago I think. So you can check it if you want. Number 7, quick shots. Honestly guys, I almost never use those mods because you can only shoot in standard color profile. But it's always good to have it and maybe when you are with some friends and you want to make just some quick shots or show them some really cool option of this drone, it's really good to have it.  So yeah, I really like quick shots mode. Number eight, obstacle avoidance everywhere. I really love that. And it's really useful when you want to make some risky shots with tripod mode, for example, in tripod mode, you have all the sensor on. So it's really great to have all those sensor on top, bottom, on the side, on the back, on the front. I really love that because you feel really more comfortable to do some risky shot with tripod mode. Reason number nine, the battery life. And honestly, guys,  for  You can go far without any problem. Not like the Mavic Air. Number 11 and it comes with the range is the signal stability. It's incredible. You can be at 2 km away like on this video and I have absolutely no problem. The signal is perfect. Except if you're flying from a forest. Guys, it's normal if you're losing signal if you are inside a forest and you're flying around. It's normal because you have all the trees blocking the signal. So you can only test it if you are in an open area and you will see that you can go really far  using any connection and also having a great feedback on your phone. Number 12, customized buttons on the back of the controller. I really love this option. I know you have it on the Mavic Air. I don't remember if you have it on the Mavic Air, but on the Phantom 4 Pro you have it. And I really like that because I choose to put C1 for my settings like ISO, etc. or all the settings. That way I can go to the setting really fast and remove the setting really fast too. Don't need to use my fingers. I use the C2 to recenter  the focus because you can focus with your finger on your screen but if you want to go back in the center of your image with your fingers trust me it's really hard so I really love that customized buttons on the back of the controller. Number 13 button on the side you can switch between sport mode, tripod mode and position mode. I really like that because when I'm flying and I want to take a photos I like to put my drone in tripod mode and with this  switchable option. You don't need to go on the settings and change the mode. So it's really perfect. The fact that you can switch from sport mode to stand out and tripod mode. I really like that. And I use it every day before leaving you. I want to give you a quick tips for those of you who using the return to home buttons, you know, that's when you click on return to home, the drone started to come back to you, but you have this beep every time. And you just need to click to the power button of your  controller and this gonna stop the beep of the return to home so if you didn't know that it's always good to know because this sound is really annoyed when you use the return to home button. Thank you guys for watching subscribe if you want I'm not forcing you and I see you next week for another video. Ciao!"
}