{
  "video_id": "2cSIAapg7rU",
  "transcription": " What you got mate? Big Cumber!  Whoa! What are your fingers? 38.  So Matt from Total Fishing Tackle has joined me down the church this week to get a load of product videos shot for their website. Conditions are really looking against us but Big Fish Thursday has lived up to its name and this cracking 38lb common is on the bank. Buzz in. Yeah, buddy!  We've got two brand new items of carp care within the range for 2019  one of which is a mesh retainer sling and the other which is a carp corral. Now the carp corral, Nash was commonly known for back in the day, he was one of the first people to do it. Due to popular demand, we've brought it back with a few extra and better features. So first of all, you'll notice that it comes supplied now in a flat carry bag, whereas before it was sort of like a cube shape, really difficult to get in barrows and out of cars, whereas now it's a lot more user friendly. Three sided zip around the perimeter of the bag, just allows easy access to your  get inside. First of all you'll come across the padded foam inner mat and then you've got the corral itself. You've got four walls and between each wall you've got a zip on the corner and you simply just do up those four zips and it gives you your shape. You then can simply just drop the inner mat inside the corral and you've got your rigid corral shape there and then you've also got a flat fret security over the top and you can put it over there as well.  A product which works perfectly with the Carp Corral is our new retainer slings. As you can see they are now fully meshed which means they are quicker drying and weigh a lot less when it comes to zero in the scales. The main benefit is a lot more airflow for the carp. Full foam channels along the top, nice and deep. These are also like the Corral, available in two sizes, a standard and a monster.  also been designed to just drop neatly inside the corral like so. There you go guys, two brand new items at Karp Care from Nash Tackle, both of which are available to buy at Total Fishing Tackle right now.  you"
}