{
  "video_id": "2f9-OGw5Kkg",
  "transcription": " Hey guys, welcome back to my YouTube channel. It has been a long time However, I am back with another exciting video. So in this video I will be vlogging about how families celebrate Christmas in China  I am also vlogging for YouTube or Snapchat? Instagram. I do YouTube. The first part of the vlog will be our Christmas party that was to take place in Nanjing. Our international Christian fellowship.  This was just a Christmas celebration at church. It's an international Christian fellowship whereby foreigners come together and have mostly like Sunday sermons. It's actually a church. So I went to church for Christmas. It was a very beautiful Christmas party. I really met a lot of people and ate so much delicious food. And the food that we ate at church were  by saying joy to the world.  The food was prepared by the people in the church. Different students, because the church is mostly made of students, students from different countries, a lot of Africans.  and also a number of other people from different parts of the world. So it's an international church specifically for foreigners in Nanjing. And this is one of the good churches in Nanjing. There are so many other churches in Nanjing like the Catholic Church and so many others I think. I've had about three or four churches so far but this is one of the churches that I mostly attend when I'm having free time.  So the Christmas party was really interesting was really exciting. It was so it was so fast It was so much fun. I felt so joyful. I felt so happy It was really a good time and I would definitely recommend if you're in Nanjing and you're a foreigner you would stop by the inn  I hope you guys will enjoy this vlog. I hope you have an insight of what it's like to celebrate Christmas from home while in China. And definitely I know foreigners while in China, they celebrate Christmas. And so in the last part here...  I'm supposed to eat guys, not vlog. The food is so yummy.  I cooked dinner for myself as well. I roasted some chicken, I made some potato salad. Just something simple for myself and I really enjoyed. Oh, but the bad news is I tried baking chocolate cake. This is like my second time trying baking chocolate cake and it was an epic fail. But definitely the taste was so yummy. I'm still snacking.  on this chocolate cake.  Okay!"
}