{
  "video_id": "3J8zCIPhqAM",
  "transcription": " 2005 Kia Sorento  it's actually not too bad. 17mm bolts on the cross member here, use a pry bar and get this out of here. Of course you want to have it supported with a jack of some kind. We have a transmission jack just for these jobs. If you have a jack you can support it. Take that center piece out. Rear drive line is 14mm bolts and square nuts on the back. And also I believe up here is two brackets.  dark.  bolts 12 millimeter bolts for that shield in the front disconnect the battery negative and you can get to two 17 millimeter bolts I believe one over here one over there once the starters out of the way and four 14 millimeter bolts right there the battery negative cable was in the way so I moved that just bolted on the side of the engine but it was in the way of that bolt  Wiring harness just disconnected some of these babies here This was the trickiest part here, this has got a center console assembly sorry to say but this vehicle was very dirty Lots of everything Inside cigarette butts and drinks and debris and Actually the instructions did not say to take apart the console it simply said  take off the shift knob which unscrews and then pull off the shaft. It didn't say how to. And there is actually a C-clip or a clip inside underneath this rubber boot. But I was able to never really get a good shot at it from above so I took out six 12 millimeter bolts out of here and you can see that nice little knobby thing that just fits in a hole on the back of the transmission. Might shoot it a little bit  later.  bent in farther. Those fingers right there bent in. So we'll be taking this out and replacing it. 12 millimeter bolts again around there. What else? 17 millimeter bolts at the top. Up here are the two ones from the engine side. Four bolts, 17 millimeter.  up on the top and I get those with a long extension I had a long extension and an impact gun right here is the setup with a swivel on the end all made for doing this kind of stuff so and once you take this cross member out right here and you can drop the transmission down three or four inches probably and then it's easier to get to the bolts on  the top of the transmission and those six bolts if you choose to go that way on the top there I had a stubby 12 millimeter and a regular 12 millimeter and I was able to get all those bolts loosened everything is lefty loosey righty tighty just throw a bearing make a little noise so I just basically wanted to show you this video almost  exclusively because of this and the instructions in our information system we're not clear on how to get to those units and nothing goes on YouTube so if somehow you're doing a manual transmission on a Kia Sorento this one's a 2005 I hope this helps you out otherwise I think that's about it if I come across something else I'll shoot it and include it on this video take care everyone good luck with your transmission manual transmission journey  job."
}