{
  "video_id": "3QEZyCTSytU",
  "transcription": " So  What's up guys, today we're looking at the H25 Wave.  heatwave for some reason but this is the Olight H25 wave. This is a headlamp with a max output of 800 lumens. Now we'll go through the settings real quickly on high like I said is 800 lumens. That says at 5 hours. Now that's not quite 5 hours at a full 800 lumens. After a while I'd say maybe like 15 minutes or so it's going to drop down casually till it hits the 400 lumens point and it will stay there  for the remaining of the time. The next mode is medium and that is 250 lumens at 12 hours. That's constant. And then we go down to low which is 35 lumens at 60 hours which is a pretty good amount of time at 35 lumens. This has a LED. This is the Cree XM-L2. This does have a battery pack. Now I don't think the batteries are  moveable or they're not supposed to be but the battery pack is rechargeable which is really nice and You clip it on it has a nice belt clip But what's nice about this battery pack is that you can also power other devices you can charge your phone or your tablets whatever off a USB charger and it gives you just a lot of power and it cuts down the amount of weight that you have to wear on your head so you can just you know, it's not as big and bulky up there on your  head.  turn the light on and off. Initially you will have to turn the light on, but once the light's on you can use your hand to wave it on and wave it off. Now say you wanted to go to a lower setting like medium or low and then start waving on and off, it will remember that setting so that way you won't have to touch it to go back down to low. So it does have that memory, but let's say it's been, you wave it off and it's been an hour, okay? The light will actually turn off completely,  next time you turn it on it will be high and that's just to conserve the battery life.  Switch the modes you just hold down for two seconds. You'll see it blink like it did and then it's not in that mode anymore and again, you can go high medium low and off now when it's in the wave mode Something if you wave it off and it sits for an hour. It will automatically turn off so that way Say if it does get waved. It doesn't go on by accident and kill the battery so Looking around here. It does have these little  clips here on the side of the band and it allows you to just direct the cord usually probably behind you and it does a good job holding that in place. Here's the lamp and the lamp can adjust, you know, I'd say about 90, almost 90 degrees. Goes up and down and yeah, the band, real nice quality. You can adjust it three different places on both sides and on the top of your head to adjust  and here is where the cord connects. Now to charge the battery you actually undo this and it's just kind of like I don't think you quite untwist it but you just kind of pull more than twist and here is the battery pack. It's not too heavy but I mean it looks about what it weighs and there's built-in batteries. I do think this clip pops off but man it's a oh here it goes okay yeah just slides out like that but that's a nice  solid I believe maybe stainless steel belt clip right there but solid unit now this little light right here actually represents how much battery the the unit has left green means it's fully charged and then it will change colors as the battery is dying now there's this little button here you hear it click and that will allow you to turn it on  otherwise you pull back this little dust protector here and there's a USB port which is handy this also doubles as a little phone charger, tablet charger, anything it's got a USB so right there you can charge and you're good and this door closes very nicely feels very good and then you just charge the actual battery pack with the included AC wall charger. So there you go there is the  H25 Wave LED Headlamp by Olight. I'll put a link in the description. That's that. Thanks for watching."
}