{
  "video_id": "3voe8kCy7Gs",
  "transcription": " For over 25 years at Instituto San Roberto, we've been honored to watch our students go on to become productive members of society on the local, national, and international stage. Every day they demonstrate the intelligence, individual character, integrity, and moral values that are the hallmarks of our school. Since the school was founded,  we thought that our students needed to feel cherished in order to acquire significant learning experiences. To this day, that ideology remains and is part of our mission.  That's why we set our vision to be one of the best learning communities in the world.  A student-centric education means that we treat each child as an individual and we strive to maximize each child's potential in mind, body, and spirit. We know that every student learns in different ways, so we use diverse teaching methods that help us reach significant learning objectives.  At ISR we believe that if we teach children to read and they choose to read,  We haven't done our job because we know that to create lifelong readers, students must love to read. Part of our balanced literacy is working with children one-on-one, making sure that they get what it is they need, and making sure that they have access to thousands of different books.  the superior performance of our students on national and international standardized tests. Instituto San Roberto is one of only two schools in Monterrey to have earned accreditation from the Southern Association of Colleges and Schools, SACS. SACS is widely recognized as having the most stringent accreditation standards and their philosophy matches our organizational goals. We offer a wide range of high-quality  We are a learning community that offers an education opportunity to every person that contacts our students.  school. Parents, teachers, and students work in teams to achieve our established learning goals. Effective communication is an important part to achieve our goals, as well as our ability to provide a comfortable, safe, and happy environment. Every day, our teachers model their love of learning and encourage respect for our school values. Parents are encouraged and given the opportunities to regularly communicate with their children's teachers.  and to be active participants in the learning experience. I think it's very important that it's a community of teachers instead of just one person being the loves. I think that out of all the schools I've ever been to, this is probably like the most welcoming and warm school I've ever been to. At San Roberto, we strongly believe that ethics are a key element in the development of every human being in the 21st century. In our program, students understand and live our values. We help them become agents of change who act with justice,  and with personal and social responsibility.  We also develop their ecological awareness to help them become responsible citizens sensitive to the environment and sustainable development. We celebrate our culture and embrace others. We are a Mexican school and promote the love of Mexico and its traditions. We place great emphasis on the Spanish language and we teach our core subjects in English so our students are bilingual. We work to help our students become  citizens of the world. As part of the Meritas family of schools, we offer our students international experiences which encourage knowledge, respect and friendship with people from other cultures, religions and beliefs. I think the main benefit for our students at the elementary level is the opportunity to communicate and collaborate with students from other schools.  We communicated with another school in Texas and we introduced our country and they introduced their country. If you belong to an international school and have the opportunity to go and participate in any part of the world, to live with people who think differently, who have different cultures, it's enriching.  The fact that I was able to go to different conferences that helped me open up, speak in public, be with people. It's an experience for multicultural children.  each person who is part of it. Students, parents, teachers, administration and support staff. Everyone in our community is a very special member of this great family.  I love how San Roberto is a family. I love the atmosphere, the people. We all realized that we are a family. I'm not the only one, but everyone in San Roberto is a family. It's a pleasure to work here. You live happily.  David!"
}