{
  "video_id": "4CyKp_aGyNg",
  "transcription": " Music  Pacquiao again landing his straight left hand. Morales chases him and lands a right. They trade punches at the ropes. And when they trade punches, Morales takes a gamble with Pacquiao's strength and power. Pacquiao is a... He has the kind of will that allows some men to walk over hot coals. Hard right hand stuns Morales. Pacquiao's all over him. Thinks he's got a chance.  It's hard to imagine how Morales can last long against this. Well until he goes out he's going to be fighting all the way down. He's not going to back up. What guts by Morales! He strays Pacquiao with right hands.  He's got Manny. He's got Koch, he's got his head. His Manny opening up in round two, and he's got Larios reeling a little bit. You see those knees are a little bit jellied in them right now. And you see the legs start to go, and they did start to go. You saw that as Bruce McCabbage is, because it's beginning to split open as we see more blood. And now you notice the lack of power by Larios because of the extraordinary power of Pacquiao that becomes so obvious. His Manny, uppercuts, left hook.  Now we're seeing the Pacquiao jab doubling up and that wasn't there for a moment or so. Everything is opening up now for Pacquiao as Larios has slowed a bit. He's got to be frustrating a bit for Larios.  Oh, man, he's hit. And now he's throwing the knockdown in the context of the swing. And four and five will take the standing 8 count. And, gee, and now... Manny Pacquiao is landing polished right side. The head was down, but now he hangs up. Now the legs are a little loose and the knees are doing it. Watch his legs, folks, and that'll tell you where the head and the body's going. Here's Manny loading up shots. Big shots. You better answer for the fights in danger being stopped.  Manny, landing several unanswered punches right now. He's starting to break him down in the center. Arias' legs are all right, but they're certainly a lot more loose in the knees than he was a couple of rounds ago. He's firing these shots at last time, and he's getting caught. He's a talent. Yeah, he got pummeled by that right-hand shot that time. And I see what Freddie Roach is talking about, that Manny can come forward with that left shoulder and throw a lot of power now with his right hand.  He's got the right hand. He's got the left hand. He's got the right hand. He's got the right hand. He's got the right hand. He's got the right hand. He's got the right hand. He's got the right hand. He's got the right hand. He's got the right hand. He's got the right hand. He's got the right hand. He's got the right hand. He's got the right hand. He's got the right hand. He's got the right hand. He's got the right hand. He's got the right hand. He's got the right hand. He's got the right hand. He's got the right hand. He's got the right hand. He's got the right hand. He's got the right hand. He's got the right hand. He's got the right hand. He's got the right hand. He's got the right hand. He's got the right hand. He's got the right hand. He's got the right hand. He's got the right hand. He's got the right hand. He's got the right hand. He's got the right hand. He's got the right hand. He's got the right hand. He's got the right hand. He's got the right hand. He's got the right hand. He's got the right hand. He's got the right hand. He's got the right hand. He's got the right hand. He's got the right hand. He's got the right hand. He's got the right hand. He's got the right hand. He's got the right hand. He's got the right hand. He's got the right hand. He's got the right hand. He's got the right hand. He's got the right hand. He's got the right hand. He's got the right hand. He's got the right hand. He's got the right hand. He's got the right hand. He's got the left hand. He's got the left hand. He's got the left hand. He's got the left hand. He's got  Pacquiao came right to him. See the surge inside? You make the guy miss, you make him pay. He heals with this because you can be a beneficiary of low expectations. Oh, and down he goes. Top of the series of punches that put him down. The count's up to four and five. He'll take the standing eight count. That was just an accumulation of punches.  so  so  so  Background music playing."
}