{
  "video_id": "5JHKOIfy9aY",
  "transcription": " Hey guys, this is Nishant here back here with another video and these are my top 5 tips and tricks for the Oppo Find 7. Now remember in the Moto X, the first one, especially in the first Moto X you could go like, ok Google now and it would respond right? Well here I can do the same thing. Look at this trick. Hey Snapdragon!  whats the weather like in chennai  voice wake up  like  to wake up screens, circle to turn on camera, two finger slide down to play music, upward arrow to launch anything you want, downward arrow to turn on flash, left arrow to go to previous, then right arrow to go to the next song, side up side down, all sorts of custom gestures you have here. You can also make your own gestures, so by notification  you  which is here. You go into the themes app. You get a number of themes and lock screens which you can get. So you get a number of themes where you can change the look of your Oppo 5 and 7 or the software which makes it look really good. Like yuppie or some flappy word thingy. No that's tozookie or some Chinese word thingy. And yeah you can customize it anyway you want. You can get a local theme. You can get the default  the  or the original unlock. I love this weather unlock thing because it's a quick way to launch the camera and see a weather at the same time. So that's a really cool feature which I am using right now. If you want to get some widgets here, you usually tap to get the widgets, effects, themes. You can straight away choose themes here. But without doing all that, this is just a simple swipe up like that.  and there you launched you can get the wallpapers, widgets, you can customize it like that so that's another cool trick which you can do and this this thing here if you want to click a quick photo you can just click like that so right now there i just took a photo right there i can i can either share it or delete it just choose to delete so that's a quick way to take a picture and send it and here if you see  see you get some shortcuts like straight away go to the main camera check your photos the app drawer and this menu button you can add some quick tools like this is the video or movie app here's the voice recorder and the fitness thing so those are some cool things which you can use and yeah these are my top 5 tips and tricks for the Oppo Find 7 and see you guys in the next video  you"
}