{
  "video_id": "62S-ry938nk",
  "transcription": " Thank you, Mr. Chairman. Thank you for holding this very important hearing. I want to acknowledge Secretary Gates, the work you've done to put a plan in place, and Admiral Mullen. I think the centerpiece of your statement will be long remembered for the courage and the integrity with which you outlined your own personal beliefs and how we can proceed. I'm proud to hail from a region of the country, the Rocky Mountain West, where we have a live and let live attitude. Some people would call it small l libertarianism.  people's personal lives, the choices that people make are not the government's business. And I can't help but think about the great Arizonan. I grew up in Arizona. My father was in Arizona. My mother was a Coloradan. I have the great honor to represent Colorado now. But Barry Goldwater once said, you don't have to be straight to shoot straight. And that's the opportunity that we have here today as the Congress and the Pentagon moves forward.  I've got a few concerns I'd like to share in the couple of minutes that I have, and I'll pepper my comments with questions, and hopefully there'll be time for you all to respond. There have been a lot of studies done, Mr. Secretary Rand, and there's a recent study in the Joint Force quarterly. It's not clear to me that the study group needs a full year to study implementation and transition. I want to just put that out there. I want to ensure that the focus of the group is on how to implement repeal of the policy  the  and  frankly, is to inform the decisionmaking of the Congress and the nature of whatever legislation takes place. It is also, frankly, to be prepared to begin to implement any change in the law. We obviously recognize that this is up to Congress, and my view is, frankly, that it is critical that this matter be settled by a vote of the Congress.  The study is intended to prepare us along those lines so that we understand all of the implications involved. Frankly, there have been a lot of studies done, but there has not been a study done by the military of this, and this is the kind of thing that Admiral Mullen was talking about. And I would just say, with respect to your second point, that I think we would regard, if legislation is passed,  repealing, don't ask, don't tell, we would feel it very important that we be given some period of time for that implementation, at least a year.  significant, statistically significant and objective survey of our people and their families. And that gets to the Chief's concern and mine as well, which really is engaging them in a way that we really understand their views on this. And that just hasn't been done. And as urgently as some would like this to happen, it's just going to take some time to do that."
}