{
  "video_id": "6HlX1qPWZiY",
  "transcription": " What's up again, my name is OMGitsKiwi and I'm back with another video today Today for today's video we're gonna react for this video not today's video because I react to a lot of videos But for this video we're gonna react to BTS making interviewers really uncomfortable now They have um, I don't know aren't like people  If you're ARMY, this is not... Our men are weird and we know that. They're really weird. But we love them because they're funny. And we get them, they get us. Like, we're all just a weird big family. And I'm weird myself, so... They match. But it's so... I don't know. Like, the video was kinda cringe though. Like, I've seen this video before. It's kinda cringey, so if you are a person that like me  Yes, and you look at it and it is like the way they make the like the captions stuff is so funny like you got to see what I'm talking about. Um First of all, would you guys look at that subscribe button subscribe button? I'm almost at 200 subscribers and I would really appreciate if I have a support that I need the support to move up on YouTube and like I just whipped go ahead and subscribe button, please and don't be afraid to leave a like a comment and  Yeah Here we go with the BTS to make it into viewers uncomfortable Hilarious Okay They're basically saying the giveaway and all that stuff so we be lying on this giveaways though  God dang! Suga don't laugh.  Look at the cameras moving! He's like lost! He's like lost yo! Why he said it was G-Dragon? Oh my god, so good!  A desert island. What is one thing you would take with you? A sports car. We're game! We're game! He's like lost.  Look at his face! He look like me. Look at B's face. He's on the ground. Rude! He gave the present back to him.  It's okay. That was a messed up gift. Look at them! Look how young they were!  What is that with the camera moving with them?  He ate the whole thing. Yeah, it's good. Yep. That video was so cringy. Like, I don't understand, like...  I  know this you ain't gotta tell me cuz I know blame my mother blame my dad it's their fault why I'm like this so if you guys like that video if you guys want to see some more reaction videos like this one please don't forget to hit that subscribe button and like and comment and yeah I would really appreciate the help you guys I'm almost at 200 subscribers so do not forget to subscribe to the channel thank you for watching this video and I'll see you guys on the next one  you"
}