{
  "video_id": "6j2Y6V3U-Lc",
  "transcription": " The showpiece of the week is without doubt the Gold Cup and Friday afternoon sees the returning favourite, Bobbsworth, the champion from last year, the current 2-1 favourite with us here at Starsports.  younger pretenders to his crown and behind him. 7-2 Silvaniaco Conti, 7-1 Q Card. Can you make a case for any of them? Claude, are you with the favourite here? No, I'm with the favourite. Unbeaten at the festival, won the Albert Bartlett, the RSA chase and the gold cup. Got a tremendous record there. Was beaten up at Haydock, I know, and all the gloom merchants were writing him off that day. Then bounced back to win a decent race in Ireland. I think he's got a lot going for him. He's tough, determined,  and he's the sort of horse I could see coming up that hill and winning again. Nicky Henderson I know, he had four winners at the meeting last year. I'm hoping that this will be one of his winners on the Friday. Yeah, I must admit, most likely winner for me with that shadow down. Slightly short, 2-1. Hopefully you run at bigger prices, I'm sure you are Claude already. Tom, Gold Cup, hit me with the winner please. Yeah, listen, I think one thing that we can learn from Bob's worth is how quick we are as players.  the  the  around what six, seven, eight to one. I'd say very strongly last instalment could play a big part. But the winner for me, Bob's worth, some of those are bigger prices, the likes of the giant bolster for all that. You know, very, very good luck to his trainer, David Bridgewater, who were along with Wickhill, you know, those his two flag bearers. Great to see him in the frame. If he could, Captain Chris probably better go the other way round. Harry Topper would need it to turn into a bog and difficult to see him winning.  So, win candidate Bobs Worth very strong with the festival record each way last instalment.  He was inches away from being brought down by Silvio Narco Conte. You need everything to go right for you and everything has gone right for him here. He's getting shorter and shorter. Yes, he had a great win in Ireland. I'm just not sure whether he's the bet for me. Silvio Narco Conte, fantastic run of the King George. Whether he's a Cheltenham horse, it was always a question mark. Q card, will he get home? I'm not sure he will. I think he'll travel really well. I think he'll run much better than he showed last time. For me, the key is Giggi.  in  You mentioned Gigginstown being the key. Do you think it's almost certain that one of the two last instalment First Lieutenant will run in the Gold Cup and one will run in the Ryanair? I think they will have. I think Mouse Morris has made noises all season about First Lieutenant finally having his chance to run in the Gold Cup and now he's suddenly saying, oh, we'll go for the Ryanair. I think the race that First Lieutenant should run in is the Gold Cup. I think the team orders it to run in the Ryanair because it's their race. Well, I think one of the most popular horses in training is probably Cuecard.  I love looking back at that Supreme where everyone goes, oh, what a disappointment it came fourth. And you look at Alfa off, Spirit Sun and Spinta Sacra in front. So you think Christ has bumped into a few there. Brilliant win last year. Awful how it just stopped dead in the King George. It was almost too bad to be true. And I know the yard were under a cloud at the time. So I'd love to see Q Card win. Seven to one, I think it's a really big prize. But I think Bobsworth is the most likely winner of the race. Claude, selection? Seven of the last 11 favorites have won. I think Bobsworth will be the  8th. Tom? Well I know Bill just said his luck's got to run out sometime but maybe it did run out at Haydock and he redeemed himself at Leopards Town and on the strength of that I was so impressed there I can't desert him so Bob's worth. And Bill, finally? Last installment and I think his biggest threat might be Q-Card weirdly but I do I think the last installment for me would be the one. And that's a wrap, thank you for joining us for the Cheltenham videos, all the best of luck  you"
}