{
  "video_id": "6o9uIeBZVY0",
  "transcription": " Here it is the performer the elite catfish rod coming at you from casking this thing is absolutely gorgeous It is a stunning performer the cat-tac  So what sets the Cast Tech apart from all the other competition grade catfish rods on the market? It's the composite blank, utilizing a graphite and linear S-Glass technology. That's going to give you a stronger, more powerful, extreme lifting, sensitive rod in a lightweight platform. You can't get any better, especially for the affordability of this rod. Let's talk about some of the guides and the handle that make this rod so much better.  thing a flat performer.  just that. With the double foot guides as well as the CC rings, you are going to flat out perform the rest. It's actually a gold standard in premium rod building using these components. Cast King didn't stop there. They loaded these models with the DPS and ECS reel seats for all models. So you can actually secure locked down very large platform reels on any of these rods. Big reels means big fish and big fights. The rubberized  Quirk handles on this Cat Tech rod are phenomenal. They're very comfortable, lots of real estate again for that big handed person or to have lots of room to put your hand for those heavy hook sets and the big fights as well as a large rubberized quirk handle for more grip and more room back here. So when you get your personal best catfish or the tournament winning catfish on the line, you've got the real estate to use to get that big fish home. Very comfortable and easy to clean.  the KastKat rod, the Kattek is also using the early strike tip on there. This one trimmed out in a chartreuse color. So low light conditions again or just for that quick blink of an eye, any kind of sensitivity, any kind of a tap or tickle on that rod, you're going to see it with that early strike technology that KastKing is bringing to you. KastKing has got you covered. Check them out. Find them on Amazon.com or KastKing.com. I'm out of here guys. I got to go get me some catfish.  Right there dude"
}