{
  "video_id": "7lM8qrpEKv4",
  "transcription": " Welcome to our first video for year 2015. Sandy and I have been very busy the last several weeks purchasing trees, some from  some places far off and we discovered new items and fill several voids that I've been really missing over the last two or three years. For example, this is a shimpaku. It's in pre-bonsai form, but if you'll notice, it looks like it's been very much wired. It has not been wired, it's just been diligently pruned, sort of free-grown, but it's very much wired.  much  think in spring. So, awesome plant. Tons of branches, so you just, it's basically do what you want to to this tree. It's going to be beautiful whatever is done. The style Litterati has been my favorite for almost my whole tenure in bonsai. And I located these Juniperus parsinae or squamata, or prostrata, excuse me, and they lend themselves  It's very important to me. It is important for the tree to have the correct bend It has to be it has to be believable. We can't change these or several years old. There's no bending You're not going to change the plants and so I found a group of I think 12 trees that Lend themselves very much to the literati style. I'm very excited about this This is one for sure that I'll have a class With using this tree as the thing  theme. In fact, several of the plants we'll talk about today, especially conifers, we will consider a class which will be posted on our website. But I can just see this in the pot. And I have an older procumbens that is part of an old forest and this is a perfect example of a potted up literati. They love to be in the real  shallow pots. They're just gorgeous. It's been a good while since I've had a desire to have staked procumbens nana. Many times they're very contrived. This group, it's a group of eight, they are, they have extra nice movement. I'm all about the movement and they also have nice bases. No reverses. It's a beautiful tree, tons of branches. So this is a great tree. It's a great learning tree.  It's also a great bonsai for a season artist to work on. I was delighted to find some smaller black pines. Black pines have sort of been, they've been very difficult to locate the last several seasons. And I'm excited about the smaller ones because at this point, as you know, they're young enough, they don't really have a lot of negatives about them. So this is a great way to start a black pine.  And these in say our environment, our zone, you put these in Georgia clay and they will jump. And it's just perfect way to start a black pine. Very economical also. Also, it's February, it's a time to graft. These would be excellent materials for grafting. Right beside the smaller black,  is I purchased a small group of Japanese blacks that were at some point neglected and neglected translates in tines in the form you lose all your lower interior of the tree. So therefore you are left with the ability to  do a literati style, which again is one of my favorite styles. And these just have enough movement, not too much negative going down at the base, but just nice movement, a way to lead up to your apex. Fantastic tree. Another fabulous find for this season is a pretty good sized group of about 40, I believe, Chinese elms. And they have some Asian  What's beautiful is they've been directed enough to where they do have some really fine movement. And just another great learning tree. They respond to pruning so much. I can see this one finished right now. It would be just a gorgeous planting. Here's a smaller one that would be fabulous for a single tree. I really see this going into a forest. And the numbers are large enough to where we could consume  It's time to start getting excited about the crab apples in that they are beginning to swell. The buds are beginning to swell. What will happen in the next few weeks is they will swell and actually most of these crab apples bloom before they leaf and you will realize a gorgeous, sometimes even fragrant bloom.  unbelievable and it's like the bonus on that is after you the bloom is Has passed you should realize a multitude of baby crab apples My glass house is so full of cool trees. I had a trip over this one to remind me to talk about it It's a smaller black pine But it has it has nice movement. It still has lots of compact branches and  and that's really where you wanna start with these. And it's a fairly small group of plants like this. They're very inexpensive. So be glad to talk to you about it. Again, we offer ball cypress. This season, we have a little bit different approach. Most of my trees, especially last season, were more directed towards  forest, multiple tree plantings. I happen on to this group here and it's a pretty good sized group. They have lots, they've been worked on enough to where lots of low branches are promoted, lots of movement. And the tree, this tree here could be just a little bit larger than show heen size. It could probably end up being about 12 to 14 inches. And with the movement, I think it would be a fabulous learning tree and actually  I'm thinking very seriously about doing a class with these."
}