{
  "video_id": "7tYa3zURRrU",
  "transcription": " Oh, it has been a disaster, darling. A complete disaster. We've had to stop shooting. I don't think I'll be back. Mom, there's something I did which I'm kinda not supposed to. Christopher! Remember how you said about how I'm not allowed to swim at night? And how you wanted me to stay away from Mr. Tanaka? You see, there was this cat in the pool and I got it out. Oh. Next time, ring for Mr. Tanaka. Kiss Mommy goodbye. Take a good look. I'm a hedgehog, not a cat.  Umm... Please don't be mad. Well, first of all, she knows I wouldn't risk diving into a pool in the middle of the night just to save a little hedgehog. Really? What else could I say to her? Hello? Chris! Hey, Dad, how are ya? It really wasn't that big a deal. No more late-night swims, promise? That reminds me. I was thinking you might like to have something to eat.  Yeah, I guess I could go for something. What's on the menu? I checked out hedgehogs on the internet and found the perfect thing. Oh, what is this? Cat food. I guess that I can get you a bowl of crickets. No, don't go! See ya!  The city baffled. It was about this high, it was blue, and it looked like a freak. I was doing about 60 when this thing went 60 right by me. It's-a me, Mario. Woohoo! There you are! Blue?  Now that's a sweet ass.  I'm out of here. But if you show up at area 99, they'll lock you up too. They can't lock me up Don't look at me I didn't do it. It was me Just don't tell dad. All right, let's get going Is it time nope  He certainly is a speedy little critter, isn't he? Come on, open already. Finally. Oh, come on! Alright, who's the one who locks all the doors? What are you all doing?  Keep him as ants. I hit my car. Remember, when you get to the main building, go in through a blind spot for security. Got it? Got it. Give me that! Listen to me, Sonic. Think quickly and act quickly. What if he doesn't? Be careful!  This'll be a piece of cake! Just great! I understand you and your friends are from another planet! My! It's so fascinating! Yeah! I'm glad! How lovely! That's where they are. Easy. If it was just me... But if I have to bring cream and cheese with me...  Now we can't see anything! What are these things? You are dead! Boys, let's move it! We need the power back now! Cream, hang on! Sonic, what's going on?  Open the door, I really need to go! Oh, that's not good. Sonic, are we going to make it out? We'll make it! Sea Cream, I told you we'd make it and we did! You didn't doubt me, did ya? Yeah! Huh?  Hey! Haha! It was you! You're the- Well, Chris, mission accomplished. Let's head for home. My name's Christopher. Sonic landed in our swimming pool last night and I dove in and saved him. My name's Tails, and I'm Sonic's very best buddy. Right, Sonic?  Right, Sonic? Correct. My name is K- It's very nice to meet all of you. I have a feeling we're all gonna become really good friends. Oh, and this is my grandfather. This is an amazing piece of equipment. How did you develop it? It's nothing special. Not in the world we come from. And where exactly is that world, Tails?  If you and me and cream and cheese are here, maybe the others got here too. That means, maybe... Eggman's here too! So... I'll rebuild the foundation of the Eggman Empire here.  Oh"
}