{
  "video_id": "7XJ6Ss2i60Q",
  "transcription": " I'm at Cone and Dowel in Queensland.  We're setting up the track, ready to go racing Sunday morning. Get a look at the environment. Conradale track, one of the best moto tracks in the country. Fewer motocross track, there's only maybe two or three man-made sections. The rest of it's just hills. You know, it's a big strong track, you need a good, fast, powerful bike. Big braking bumps, lots of ruts, you know. The guys that win on this track are true motocross riders. Just had practice qualifying and the track's really fast today. Bike set up wise, I'm going to go a little bit firmer with the suspension and yeah, just looking for a bit more top end power as well.  Hopefully it's going to get rougher and slower every run down. My bike's got really smooth power at the moment so that'll work in my favour I think. It's going to be all in the start. It's fast but tight at the same time. It'll make some interest in racing. Yeah, two motos. Not too bad. I think they were both top 10s. Got stuck behind Doggy in that first one there and just couldn't make a clean pass. Starts to let me down a little bit. Just bogging a little bit off the stage.  because it's so grippy. So, change a few things and hopefully get a better start for the longer motor towards the end of the day.  in the back, quick shade jammed in the middle and they're still killing it. Fans everywhere so can't wait to the next round and everyone's having a good time and if you're not here, because you're not because you're watching this, get to the next round. Just got a shoulder reconstruction, been putting it off for a fair while now and had a few close calls because of it, like doing one hand harse and your shoulder pops out, you know you float back onto the bike and luckily you ride out of it. Get that fixed, got to get an operation on my wrist as well in a couple weeks and  Apart from that a whole lot of PlayStation.  Tell Marshall about the hole shots that you used to do at Shoei's joint. Yeah. Just here at Conondale track in Queensland. Woodsie's just had two motos, top ten in both motos, which is what we're after. McCoy's out here now and hoping to, you know, same deal, top ten, fifth, anything better than that to win for us. Wrap up of Monster Energy MX Nationals round one. Ben Townley dominant performance in the pro opening.  The first Aussie in the bunch there, Todd Waters did very well, Boyce and H&H, good place to start there. Daniel McCoy didn't have a great day out. A few bike issues in the first moto cost him a finish. Louie Woods, the man behind me here, rode exceptionally well in Pro Lights. He's a stat class. So look for Louie Woods a little bit further on in the series. In the overall Pro Lights, that one was wrapped up by Kirk Gibbs from Fordale and Luke Stipe rounding out the podium. Just got done with the first round. I'm just going to go and get a drink.  We didn't quite have everything together but we had parts coming in really late. But we'll be right for round two and sort all the problems out and get on track. Just go home and work on my starts and try and get something real grippy to practice starts on. But other than that, about halfway through I was stung by a bee in my head. So that was hurting a little bit but no big deal. So pretty consistent but need to work on starts.  Woodsie done alright, he got top 10 which is pretty good. He got 10th and 7th in his first two motos and 10th in his second one which was pretty surprising and pretty happy with that. H&H boys really doing it by the skin of their teeth, they did a cracking job in Supercross. Here we've got an SSU loaded up with the bikes, the boys about to hit the road and head back. And then you look to here, there's trucks the whole nine yards here, you know. H&H boys are doing it for the right reason, they're doing it just because they love the sport.  you"
}