{
  "video_id": "8TCPDVMenzI",
  "transcription": " you  Messi  to the plate just when Barcelona needed it most. Could this be the hat-trick before half-time? Oh, brilliant! An audacious chip from the magical Lionel Messi, the most talented footballer of his generation. And it's Messi. And it's Messi.  Messi is there! And who else but Lionel Messi? Messi might be through again. It's Messi! This is what the great great players do. They choose their moment and they deliver. Messi to accelerate to look for the hat-trick. He is unbelievable. Lionel Messi saves Rafa.  Argentina  It looks like he might be hurt did not look like there was a collision And he is in serious pain Such a tense game ending in such a dramatic fashion as well as a bottle goes down  The referee is reaching for his back pocket here, it's a red card! Zagbala, Shun Yello for a second time! And Argentina, just before the break, are down to 10 men.  Messi now, Messi the shot!  Here goes Messi, they're backing off and backing off! It's a wonder goal by Lionel Messi! The best player in the world! Messi! Oh, brilliant! They can always remember Messi! For once, one defender was enough and Uxvelozzi has got it away for Reyes. Messi, prepared to track back.  Very effectively to The best footballer in the world the MSC is still willing to come back and help his team Defensively  The best player in the world 70 yard run back Defended in the left-back position off one of his best friends He's nicked it off could Aguero and then he knocks it right another defender and he sees saves the deck Well, it's all about team play and could Aguero's quick, but so is Messi. You know, it's funny looking messy closer time Look at this drop. That's just all football should take note of what he's doing. This is Arguably the best player in the world and look at the effort  Pretty good session.  Vanishing again from Messi! Messi! On to the return... It's Lionel Messi! It's Clarence! And it's on to Messi! And that's why he's world class, that's why he's the best in the world. Lovely bit of skill from Messi. Here's the Argentinian, Lionel Messi into the penalty area. Messi! What a goal from Lionel Messi! Xavi.  In towards Messi! It's a nice ball to Messi, surely this time he's not gonna miss! He has him 1-0 to Barcelona! Messi! Pjotic sends it back post, header up and over! No chance for Fabri that time as Messi, delayed but not denied Magical! On every front! Diesta keeps it wide Into the middle, the header! And Messi does it again!  Dignas cross Messi's header Messi's goal Messi's down, Messi finds Peter in Dornil Barcelona Neymar in for Barcelona to Lionel Messi Don't go check Messi scores and that's how quickly they can do it The victory combined, the Barcelona lead Messi  In which he scores past Gigi Boubon for the first time in his career. Here's Messi, scores again. And he just makes the most difficult things in football look easy. Here's Leclerc, Messi in! He makes the difference for Barcelona. Here he is again, it's astonishing. It's absolutely world class.  He's the best there is, he's the best there ever has been Possibly the best there ever was  You"
}