{
  "video_id": "9aXdpDp9tgI",
  "transcription": " My name is Jessica Chan. I'm an industrial designer located out of Portland, Oregon and the founder of Wink Pens. At Wink Pens, we manufacture quality and innovative writing instruments with a unique niche for creative and refillable glass fountain pens built to write with not only traditional inks, but also ink alternatives such as wine, juice, coffee, or tea. Get creative. The Wink Pen was born from the desire to create  create a sustainable alternative to the everyday writing utensil. The basis of the brand name Wink was originally derived from the concept of using wine as ink. However, our pens have been engineered to adapt to any low viscose liquid that contains the staining property. The Wink pen can be essentially thought of as a hybrid between a dip pen and a fountain pen, in that it is both manually fed and yet contains an ink reservoir. The pen consists of a handmade glass nib, which replaces conventional metal tips, removing the risk of corrosion and also having the benefit of being easy to clean.  The spiraled grooves elegantly feed ink to the paper while also boasting a beautiful aesthetic. Everything is built to be as modular and as user-friendly as possible. All components fit snugly together with the use of rubber O-rings, making it easy to be disassembled, then reassembled. The piston design also allows for a simple twist to refill and ink release system. Creatives are constantly seeking new means of inspiration and methods of self-expression. Wink Pens provides an exciting new tool to add to your arsenal, serving as a unique vehicle for new  and unexplored mediums. Whether it be utilizing your freshly brewed coffee in the morning or your favorite bottle of wine in the evening, the Wink Pen can allow for experimentation, being spontaneous, and an added personal flair. With the rise in tech today, there comes naturally a renewed appreciation of the handmade, of quality products, and of traditional writing and arts. We aim to bring that back, all while reducing throwaway and fostering new and creative experiences. With writing instruments, there will also always be that irreplaceable satisfaction of being able to translate your thoughts.  manually onto paper."
}