{
  "video_id": "_isbRnpfyik",
  "transcription": " Welcome back to the channel guys. How are you? It's myself and come next It's coming in to give me a hand again. Yeah, they're gonna be sticking engine back into the car and We're gonna bolt all doing bolted the gearbox and then we're gonna start mocking up  turbo manifolds so yeah yeah all this covers all it's all talked up and that I will be giving a bit of a freshen up and a clean with some nice paint and that once it's cleaned in yeah again a and 10 foot in there. These are raring to go. I found these studs are a wee bit too short so I'll have to basically make my own studs for the exhaust manifold yeah just as she  holds on because you're gonna have plenty of weight on it. I also took this off as well and cleaned the screen and the VTEC solenoid. And yeah, she's ready to go boys. So we'll get this adapter plate on and then we'll stick her in the car and we'll get her mocked up. Right guys, that's her in. She's on her mounts and all bolted up to the gearbox. So now we have a sort of area where we let the turbo  put on the two flanges and then tack a bar across so we've got like a jig to work off. One problem we'll have is the VTEC is so annoyed with that so just need to take into consideration that but the tubes will probably come this way into the collector and up. I could sling it around the front like the S2000 boys but I cannae be arsed so it'll have to do there.  I better not play too much of that because we will get copyright.  because the steering arm comes up this way. So yeah, now we're just going to try and put the jigsaw puzzle together. Note to self, don't make another exhaust manifold. We've basically worked some bends in there. She's looking like a new bottom. Last piece now is basically to come around here and straight to the last end. And then we'll see if she'll fit.  and yeah that's all I'm doing tonight so I suppose you could say this would be a part one of making the exhaust manifold part two will be back purging, tigging after I've broken it all down again at last look at this I think it looks nae bad if you ask me there is some gaps that I need to fill with  but they're all in sort of place so happy with the look of that. Not that you'll be able to see it anyway. But now we're going to stick it in there. In fact let's do it just there. See if we can wangle that in. Nuts are sitting on the turbo flange and how it's going to sit. Gives plenty of space for if I want to go for a bigger GT30 or something.  Down here is a 90 and that will just go down to the standard exhaust. What I'll do here is I'll have a 2 inch cast piece, comes off the turbo and it will come here, or 2.5 whatever the outlet is. And then that will go to the V-mount. V-mount will go through there and in there. And there it is. The EBA fuel rail as well. Oh yes.  Just like that Hey guys, thanks for watching Part one of part two Next we'll be taking it back off breaking it all down and take welding up But I'm gonna have to set myself some time with that and bleed to the misses Hey guys, thanks for watching and eh, fuck it all Catch up with you's later on, cheer  I'm out."
}