{
  "video_id": "_qtYCQncULQ",
  "transcription": " I have to wait for my car to defrost. So, apparently they don't have the road scrapers. And I've got a truck and I'm in snow mode. But every time I slow down, my car kind of slides a little bit. So I've got to be a little bit careful. But it's quite beautiful.  out to the Fort Defiance Medical Hospital to do some final configuration, meet with the IT guys. We got everything installed yesterday. I'm gonna check the antennas given the fact that it snowed. And then I'm gonna drive to San Diego. So I'll probably be here for maybe an hour, hour and a half, and then I'm gonna head up to San Diego. So, yep, that's my day. But look at that.  Isn't that gorgeous? I'll try to get some good footage as I drive today. Good morning. So I'm done with Fort Defiance Medical Center and absolutely gorgeous. My truck is filthy and it is time to start my trip to San Diego.  Diego California to do an install in San Diego tomorrow, so I'm gonna start my my drive to San Diego and so Today will be a travel day Howdy howdy stopping for gas  Look at this. Gotta find a car wash.  He can sleep in those things.  I'm going to Columbus, Nebraska and I'll be there Monday morning. So it looks like I'm gonna work here in San Diego tomorrow and then I will have Saturday and Sunday to navigate from San Diego, California to Nebraska and hopefully I'll have a meeting in Omaha, Nebraska on Tuesday. Otherwise, I'm heading up to Moorhead, Minnesota where I'm gonna meet the Peplink guys, like the guys. So pretty excited about that.  I am driving south on I-17 through Arizona heading towards Phoenix. Bad news is I'll be hitting Phoenix like right at rush hour so... But it's gorgeous and I went to the car wash so I can see out my window now which is nice.  And the mountains surrounding this area in the distance are just... It's like they're there, but they're unreachable. It's the craziest thing. And when I'm driving, I can always see the mountains in the distance, but I never actually touch the mountains in the distance.  from Southern California. My name is Peter West. I'm on the Conquer the Switch Tour and I am in San Diego, California. And today I'm going to be installing some switches for a house. And unfortunately I will not be able to conquer any switches because I saved the guy from purchasing the wrong switches. And so we're installing two 24 port switches and 11  points as well as a peplink balance router and then I am off to Nebraska which is a 24-hour drive so I don't have much time to play around in California but I'm gonna try to get some footage maybe get some something going on here in the in the mountains I really want to get back up into the mountains of California because that was gorgeous last night driving through so I'm in Southern California and conquering some switches  I think that's the house that we're gonna be installing equipment in. So I've got all my equipment here and I've got to find my APs and a few other things, give away some shirts and have a fun day installing some switches and then head off to Nebraska. Okay, got my switch, got one of them mounted already. He's gonna go get some more  rack gears and then we've got some of the APs and we're gonna set this up. This will be one of my very first home jobs. Most of what we do is business so it'll be kind of fun to talk to these guys and see what they do and how they use these products in a residential environment. We've got both switches installed. We've got all the APs and router and switches and in control and we've already programmed the wireless AP settings and now we're  just waiting to get internet and plug everything in so what we're doing is waiting for all of the firmwares to upgrade we've got them all plugged in so we're updating all the firmware just programming them all real fast okay so we have one in the rack for the garage okay and then I'm assuming as a TV get installed in there and you guys are doing control for correct okay so you guys  Do a lot of control for here in California? Awesome. You can guess better than me. We're installing 10, right? Oh, can you zoom this spare? Okay. And one of the outdoors is going all the way out to the garage or the gate?  Look at this view! I love this kitchen. I'm a huge cooking freak.  Okay, it's in the library, so I have an AP in here, too Another AP in here  It's the master bedroom. Yeah, so this is what they get a wake up to  Okay, so I'm done here at the house. Everything is programmed. They're gonna go ahead and deploy it. We've got everything set up on in control. All the firmware is updated. All the devices are added. The wireless access points are set up. So now I'm heading to Columbus, Nebraska. So it's a 24 hour drive and we're gonna have some fun doing it.  Thank you."
}