{
  "video_id": "_RaSYDgoqWU",
  "transcription": " Summer time  Summer time, summer time, summer time. Everything's brighter in the summer time. Sun shining down on all the trees. All of the people love the summer time. Sun shining down on all the leaves.  Oh yeah!  All of the people of the summertime. Oh, you know it. Sun shining down on all the leaves. Listen to me now. Sitting under the stars in the summertime. In the backyard after a barbecue. And in the daytime having a picnic. In the park watching clouds in the sky. Now that it's here we should make the best of it. Enjoy every minute of the day as they pass you by. Too soon it is gone and you realize how time flies when you're living in the summertime.  Everything's brighter in the summertime. Sun shining down on all the trees. All of the people of the summertime. Sun shining down on all the leaves. Summertime. Summertime. Summertime.  Summer time. Summer time. Everything's brighter in summer time. Sunshine and down on all the leaves. All of the people of the summer time. Sunshine and down on all the leaves. Summer time.  Summer time.  I've been working on a special new barbecue pizza for just such an occasion. All right! Hey, and we could play some fun games. I like a frisbee. And volleyball. Or kick the can. Well, I vote for that favorite national pastime, baseball. Are we getting too carried away, Chuckie? No, it's summertime. Time to have fun and go a little crazy with it. Yeah! Let's have some fun.  Oh, yeah!  We can ride our bikes down to the pool. The water there will help to keep us cool. Let's have some fun. Fun, fun. We're gonna have fun. Fun, fun. Let's have some fun. Fun, fun. We're gonna have fun. Fun, fun. Let's have some fun. Fun, fun. We won't worry about anything. We'll just dance and shout and sing. We'll have some fun. Yeah.  Oh, yeah! Oh, boy! Now we're talking. Woo-hoo!  Let's have some fun, fun, fun. We won't worry about anything. We'll just dance and shout and sing and have some fun. Oh, yeah. Chucky, this is so much fun. Everybody, put your hands together. Yeah. Oh, yeah. Having fun is easy to do. Oh, oh. Especially when I'm with you. All of you.  And when this fun-filled day is done... What are we gonna do? I don't know. Tomorrow we will have more fun! Yeah! Let's have some fun! Fun, fun! We're gonna have fun! Fun, fun! Let's have some fun! Fun, fun! We're gonna have fun! Fun, fun! Let's have some fun! Fun, fun! We won't worry about anything! We'll just dance and shout and sing and have some fun!  We'll have some fun! Yeah! We'll have some fun! Alright! Alright! That was great! Wow! Summer is the best time for parties and fun! Speaking of fun, kids, let's play some games and have some serious fun right here! The band and I will be back with more summertime festivities in a few minutes!  you"
}