{
  "video_id": "A0_J8dUrvo0",
  "transcription": " so  I'm going to do another care package. This one is kind of a random one. I just wanted to send one for the month of May and I was going to do Cinco de Mayo but I didn't get  to  I always have a little joke or just a little note on the inside flap. I don't have my card in here yet because I haven't filled it out yet. But I don't know if I'm gonna put a card or a letter in the box yet. So that's why it's still and you see these little spots right here. I don't know. I think I waste something out of the box. I had it like up with other stuff and when I got ready to take it down and actually put the stuff in it after I decorated it that  I think it's just something waste on it. But I'm just gonna send it anyway. It's just the box. Nothing in the box was damaged. As usual, I put tissue paper on top. And like I said before, this box is pretty random. Some of the stuff you requested, some of the stuff I just put in here as a little surprise for him. So he really likes beef jerky, so I'm gonna send a couple of those.  Pepperoni Beef Sticks  I got him a toothbrush holder. He actually did request this so I found this from Walmart out of the travel section. I believe that was a dollar. These Quick Bars, I've been hearing a lot of good things about these. I got him two of these to see if he likes them. I always put the food or anything that can spill or explode in a Ziploc bag so it doesn't spill on anything.  I  I got him his eye drops. I always get a brand the refresh brand that he uses that he gets from the eye doctor and then I just get an equate if he runs out before I can send him another so yeah then I found these  Dollar Tree  He works outside and sometimes he has to go out at night and this is just a good thing to have on your keychain or in your pocket. So I got that and then I got another set of toothbrush holders which I need to cut the top of this off for space but um another toothbrush cover for him. This is actually the item he requested. I was telling you guys about the Biflex joint supplements.  It's just vitamin D. But yeah, I bought two So actually kind of a twin pack so I just took them out the box but the box was huge and I don't understand why they have the Bottle so big and it's literally look I don't know if you guys can see that or not It's not even halfway full but these are what they look like I Got those from  He didn't ask for these but I figure he can pass these out at work or use them after lunch can't brush his teeth after lunch, so I just They were only $2 and you get 75 of them so I figured that was a good deal. Um This is one of the items he told me not to send cuz he thinks it's gonna melt But I'm gonna send him anyway, they melt is it was only a dollar It's not a loss really and I put them in ziploc bags, so they won't get on anything else, but it's just a sweet  Power Deorder  Gold Bond Powder  I have a community bathroom and shower so I had to send those. Just for peace of mind for myself. Then I got him his Booty Pebble cereal. And that's pretty much it. The only thing I have to add in the box is his card. So if you guys have any suggestions or questions or ideas for me because I'm really running out of ideas. I have two more months of boxes to make and then I'm starting to make boxes for his friends.  neat idea this book."
}