{
  "video_id": "A2yg51yht0c",
  "transcription": " This program is brought to you by Kanchipuram Varmaalakshmi Sales  In the 4th chapter of Sai Satcharita, we have the Dasa Gana Sranam in Prayaga Kshetram.  I am thinking of going to Kashi, Baba. If you permit me. Baba laughs at him. Is it? Why so much? He says. Baba keeps on saying. Dasakhan Maharaj sees Ganga and Yamuna flowing from both feet. He is very lucky. He is very fortunate. Immediately, Baba sings a wonderful song that cannot be heard by anyone.  After that, Baba touched his feet and the holy water of the holy water of the holy water of the holy water of the holy water of the holy water of the holy water of the holy water of the holy water of the holy water of the holy water of the holy water of the holy water of the holy water of the holy water of the holy water of the holy water of the holy water of the holy water of the holy water of the holy water of the holy water of the holy water of the holy water of the holy water of the holy water of the holy water of the holy water of the holy water of the holy water of the holy water of the holy water of the holy water of the holy water of the holy water of the holy water of the holy water of the holy water of the holy water of the holy water of the holy water of the holy water of the holy water of the holy water of the holy water of the holy water of the holy water of the holy water of the holy water of the holy water of the holy water of the holy water of the holy water of the holy water of the holy water of the holy water of the holy water of the holy water of the holy water of the holy water of the holy water of the holy water of the holy water of the holy water of the holy water of the holy water of the holy water of the holy water of the holy water of the holy water of the holy water of the holy water of the holy water of the holy water of the holy water of the holy water of the holy water of the holy water of the holy water of the holy water of the holy water of the holy water of the holy water of the holy water of the holy water of the holy water of the holy water of the holy water of the holy water of the holy water of the holy water of the holy water of the holy water of the holy water of the holy water of the holy water of the holy water of the holy water of the holy water of the holy water of the holy water of the holy water of the holy water of the holy water of the holy water of the holy water of the holy water of the holy water of the holy water of  the  the world.  you"
}