{
  "video_id": "Acbcm6GJBZw",
  "transcription": " Hello and welcome to Stockwatch Live. This week it's the turn of the house builders to fill us in on the state of the new build property market. On Tuesday we get full year results from Bellway and then a day later a training update from Barrett Developments. In July broker Berenberg started coverage of the UK house builders by putting buy ratings on Barrett and Bellway along with Bovis, Redrow and Taylor.  the Wimpy. In its accompanying note, it acknowledged head-on the tough 2018 the UK housebuilders have faced so far. Share prices across the sector have fallen more than 15% and ongoing concerns about cooling house prices and rising build costs have just added to speculation that the cycle has peaked. However, as the broker points out, this downturn the sector has experienced on the market means the shares are trading at 1.38 times current net assets. And that means they're trading at a 29%  discount to what they have been at. Throw in that 7% dividend yield that these stocks typically offer and it says in its view these fears are overdone. Throw in a generally supportive macro outlook with housing still affordable in most regions of the UK and with the government's help to buy scheme supporting sales and analysts at Berenberg say they expect the new build sector to continue to outperform the wider market. Belway certainly does seem to have been riding the waves of the UK's housing shortage  and the buoyant demand for starter homes. It's seen brisk trade. In August, reporting strong sales demand in the year to date, it said it expected to generate record annual revenues. That did come tempered with a warning that a slowdown in the pace of house prices would hit margins. But as it pointed out, while there is an underlying need for additional good quality and affordably priced new housing, it's in a prime position. Deutsche Bank agrees and has upgraded its investment rating on Bellway from hold to buy  and lifted its price target to £37.45. Barclays Capital is a little more cautious and while it remains equal weight, it has trimmed its target price to £33.90. Now we all know that times are tough on the high street and the latest figures from the British Retail Consortium yet again went to prove just that. Consumers are reining in their spending. September, suffering something of a summer hangover, saw the slowest sales growth since October last year  food sales particularly badly hit. No prizes then for guessing what Food Asylum is likely to say when it posts half-year results, especially after its last appearance was accompanied by a profit warning that sent its share price crashing more than 50%. The sportswear chain, backed by John Wardle and David Makin of JD Sports fame, said in a statement that full-year earnings before interest tax and other deductions would be significantly lower than previous guidance. A less than half full-year 2018 adjusted  earnings of £12.5 million. The company, which only floated a year ago, had already warned on the outlook for 2019 in June when its shares suffered a similar 50% drop. And I'm afraid the brokers have had their red pens out. Peel Hunt now rates the shares a sell and has slashed its price target from 80 to 22 pence. Merlin Entertainments, the company behind Legoland and Alton Towers, is due to give a trading update. Appropriately enough, maybe, in terms of profits and its  share price, it's already given shareholders quite a ride. When we last heard from it at the half year stage in August, it posted a 14.3% drop in half year operating profits, which it blamed largely on the weaker US dollar. It also said that while the resort theme parks and Legoland parks saw good growth in revenue, the long hot summer was already taking its toll on the group's indoor attractions based in central London. These actually saw a fall of 1.1% in organic revenue. Shareholders will want to hear  about the progress from long-term opportunities with Legoland New York under construction, the development of new brands and also what the group is doing to address ongoing cost pressures. UBS has downgraded its investment rating from buy to neutral and cut its price target from 425 to 380 pence. But Peel Hunt and Citigroup have as yet left their buy ratings unchanged and have a target on the shares of 450 and 500 pence respectively. Finally on Thursday, it's  pizza delivery chain Domino's turn to give a trading update. The question investors will want to know here is whether UK consumers have had their fill. While the pizza delivery business had been bucking the downward trend and appeared to be benefiting from its value offering for stay at home diners, the last set of results seemed to suggest appetite was waning. News of slowing like for like sales growth, sluggish international growth and a cautious outlook in the UK, which accounts for the majority of its sales, saw its shares slide  almost 10%. Profits didn't fall, instead they saw a modest rise in the first half, but the hot weather which saw people getting off their sofas and out into the big wide world hit the businesses' bottom line. For the six months to July, underlying pre-tax profits only ticked up 2.5%, but the group said it had no reason to believe that full-year profits won't come in in line with expectations. That didn't seem to wet Citigroup's appetite for the stock though. It reiterated its neutral investment rating and cut  its price target from £370 to £310. Well, that's all for this week. For more on the companies reporting in the week ahead, go to the Markets and Insights section at fidelity.co.uk. See you next time.  you"
}