{
  "video_id": "ACMtJ7YByjQ",
  "transcription": " Hey Beat Buddies! I'm back and I want you guys to get ready with me. And this look, I had the same look in my crown braid tutorial and I got so many requests to show you guys how I did my makeup. And it was so simple and easy so I'm like, oh why not? So I started off with my LA Girl Pro Prep Concealer.  and then I'm going to use my Maybelline illuminating shimmer and I'm just going to put that in the areas where I highlight so that when I put my foundation on which is a Maybelline Fit Me and I'm putting oh well I put that on so it can kind of lighten up the highlight so that shimmer can shine through so it can look easy breezy and I'm going to put that on and you guys are noticing that I'm doing  with my hands. I'm taking it back old school to the way my mom used to do it. And I find that I love the way it turns out when I do it. And you guys, here's a tip for you. Always warm up your, any foundation, your concealers, your creams before you put it on your face because you want it to warm up before you set it so it won't form in its own way if you kind of get what I'm saying. And then there's my eyebrows.  and you know that's the ABH Dip Brown, the color Ebony and I'm not going to do too much and say too much about it because you guys know if you want to see a tutorial on that I'll put the link below and I'm just going to add some mascara to my eyebrows because I feel like I like them dark and I put that foundation on top of it before I put the dip brow on it and I just want to bring the color back to life. Now I'm warming up my concealer, my L.A. Girl  I'm using my NYX concealer in cool tan and I'm blending it with my fingers. Taking it back, way back. Blending it in. Oh look at me, I'm looking like a geisha. And then I'm going to use my NYX concealer  NYX setting powder  I wanted to it doesn't cover as much so I'm going back in with that same ABH dip brow and I'm gonna fill in the Hollow parts, I guess the ones that aren't deep enough for me And then there's my NYX. I love blush. I love it. I love like pink flesh not flesh tone blushes, but pink blushes Oh, look at them cheekbones. I love them And guys I'm not  I'm going to do a contour, just as just a highlight, something simple, everyday. And, oh I forgot to say, in my tutorial with the crown braid, I did not have the wing, but I felt like I wanted to wing it out today, so I did. And then I'm gonna use my shimmer palette, the one that I always use, my go-to, my home girl, my day one, that's what I'm using.  and I'm going to add it to my cheekbones, the bridge of my nose, my cupid's bow, my forehead. Guys, I had so much fun doing this. I'm like so excited. I'm happy that you guys are like really starting to feel me to watch my channel and that makes me so excited. Then I'm going to blend all of that in because you don't want to look a hot mess, okay?  flawless. You want to look effortless. And then that is my NYX dark brown lip pencil. I'm going to put the MAC, I believe it's the AMP, lipstick on top of it to give it that nice neutral look. And then I'm going to put the lip gloss from MAC and I believe it's the  It's the color Lust. And it looks banging. I love this combination. It's not too crazy, but you can tell. Like you can wear it to work, you can wear it to run errands, you can wear it almost anywhere without looking too much like club, you know. And here's the hair, guys. I just did this hairstyle because I wanted something fun and different. This hairstyle is a good protective style.  You can wear it if you're working out all the time. You can wear it on the weekends. You can put it in your kids hair. You can rock it wherever. You can also not add color if you don't want color. But I like color. I'm exploring new things. I'm trying different things and I like color. Okay. So there's my two buns. And then I'm going to take any color that you have. That's the Kankalon. That's the same hair actually.  I'm going to wrap it around. You need two hair pins for each side. Also, you can tuck your hair in. You don't have to have your hair out, but I like the effect that it gives. Again, guys, I thank you for watching. I love you guys. I love that you are supporting me and it makes me so happy. I thank you guys. If you haven't subscribed yet, please do.  go ahead and press that red button right there yep that one right there and if you already subscribed I thank you and I will see you guys in the next video  so  you"
}