{
  "video_id": "auvdGkpKmiI",
  "transcription": " Alright, my name is Colson Vorwald and I'm Phillip Reiky and we're both seniors this year and this is going to be our last time we can go to camp and we want to make it the best that we can so we're going to make a video telling you about what not to bring and what to bring to camp.  Your Bible. Duh. And also make sure you have a pen, maybe a pencil, and something to write on. Winning. Alright, make sure you bring a pillow, sheets, blankets, sleeping bag, anything else you want to sleep with. I told you, you can't come. And when you're packing for camp, make sure you bring enough clothes, especially t-shirts, because we're doing rec and running around, so you want to make sure you have clean t-shirts. Middle school boys. Definitely applies to you. This is yours.  Middle school boys, make sure you have enough t-shirts. I have deodorant in my backpack. Yes, get it, totally. Flip flops for the shower, because you don't want any funk on your feet from that. Flippy floppies. Nice. It's like, we want you to come to camp.  a whole suitcase from the U-Haul. We can just grab a backpack and just have some clothes in it and you know where to go. You know we gotta say it. Every year at least one girl brings a huge suitcase that's heavier than them. Just one? And you know your suitcase is too big if Philip can hide behind it. Nice. And appropriate clothes are a must. We will be in the mountains so at night you might need a light jacket. But during the day it's gonna be hot. We're not going to the Arctic Circle.  Make sure you don't bring squirt guns.  I got one! I got one! That means you, Morgan. Even mine?  Are you filming? Girls, don't wear Italian pasta straps. Don't you mean spaghetti straps? It's basically the same thing. Okay. But if you do wear it, you will get... The Walmart Special! It's too big. And girls, don't wear short shorts. And guys, especially don't wear short shorts. What are you wearing? Nothing. And middle school guys, Axe body spray is not deodorant.  it at a rest stop."
}