{
  "video_id": "AUXo83jAKIw",
  "transcription": " Now let me set this up a little bit. You're probably wondering when you see why we're doing this. Now, if you've been watching the Academy Awards over the years, our next guest comes out to the Academy Awards every year, and every year she wears something a little less and a little less and a little less. Now I think it's disgraceful.  to the Academy Awards for Edie to dress like this. And the only way, in case you weren't watching and didn't see her at the Academy Awards, she's gonna wear the dress tonight and come out tonight. So go hide your children in the closets. They shouldn't be watching this. But listen, when you see Edie, remember she was wearing this same outfit at the Academy Awards this year. So David, introduce her, if you will.  Okay, here she is, the Academy Awards Queen herself, Lady Lust, the gorgeous Amy Williams.  Hold it down. Hold it. Hold it. Hold it. Hold it. Hold it. Hold it. Hold it. Hold it. Hold it. Hold it. Hold it. Hold it. Hold it. Hold it. Hold it. Hold it. Hold it. Hold it. Hold it. Hold it. Hold it. Hold it. Hold it. Hold it. Hold it. Hold it. Hold it. Hold it. Hold it. Hold it. Hold it. Hold it. Hold it. Hold it. Hold it. Hold it. Hold it. Hold it. Hold it. Hold it. Hold it. Hold it. Hold it. Hold it. Hold it. Hold it. Hold it. Hold it. Hold it. Hold it. Hold it. Hold it. Hold it. Hold it. Hold it. Hold it. Hold it. Hold it. Hold it. Hold it. Hold it. Hold it. Hold it. Hold it. Hold it. Hold it. Hold it. Hold it. Hold it. Hold it. Hold it. Hold it. Hold it. Hold it. Hold it. Hold it. Hold it. Hold it. Hold it. Hold it. Hold it. Hold it. Hold it. Hold it. Hold it. Hold it. Hold it. Hold it. Hold it. Hold it. Hold it. Hold it. Hold it. Hold it. Hold it. Hold it. Hold it. Hold it. Hold it. Hold it. Hold it. Hold it. Hold it. Hold it. Hold it. Hold it. Hold it. Hold it. Hold it. Hold it. Hold it. Hold it. Hold it. Hold it. Hold it. Hold it. Hold it. Hold it. Hold it. Hold it. Hold it. Hold it. Hold it. Hold it. Hold it. Hold it. Hold it. Hold it. Hold it. Hold it. Hold it. Hold it. Hold it. Hold it. Hold it. Hold it. Hold it. Hold it. Hold it. Hold it. Hold it. Hold it. Hold it. Hold it. Hold it. Hold it. Hold it  to the Academy Awards this year, didn't you? I certainly did. Edie, why do you insist year after year to come to the Academy Awards ceremonies and dress so disgracefully? Don't you think it's disgraceful? Edie, don't you... You've got to realize that the Academy Awards is supposed to be a classy, very upbeat affair. Why do you come dressed half-naked like that?  that to the Oscar Awards. Why do you do that, Edie? I have a good sense of humor. I have a good sense of humor about life. I have a good sense of humor about myself. And I like to have fun. And this is an outfit that is playing it up. This is an outfit to emphasize. But, Edie... This is an outfit to emphasize the structure underneath the pearls. I'll tell you what.  This is an x-ray outfit. I think it should be better. What do you think?  This is the Herald-Examiner. They ran a picture. Here's the Los Angeles Times. They ran a picture. Here's the San Francisco Chronicle with Lee Marvin doing a double-take.  surprised if next year you came naked.  They gave you one too many gifts. What do you think? Not one too many. Well, Edie... Well, I work out hard every day. This morning I ran my three miles. Now, Wally, what exercise did you do today? Well, I wouldn't tell you. That's for darn sure. But I sure didn't... If I had a body like yours, I'd be all covered up, too.  If I had a body like yours, I'd be a millionaire! Goodbye, everybody!"
}