{
  "video_id": "bDzFcdDcYGI",
  "transcription": " Jersey SportsZone's coverage of the Hunt School is being brought to you by Princeton Orthopedic Associates. Courtney DuPont coming to you from the Hunt School on this beautiful morning for a special All-American Jersey presentation to one of New Jersey's four-star recruits, one of the best offensive linemen in the entire country, and a terrific football commit for the Penn State University. Straight out of Princeton, New Jersey, it's Caden Wallace. Someone described Caden as an absolute unit.  Kate Wallace, on behalf of the All-American Roles Selection Committee, it is my pleasure to welcome you to the 2019 All-American Role presented by American Family Insurance.  This honor was not only a big deal for Wallace himself, but also for the coaching staff at Hunn and the entire school. Never before has the Hunn school had a representative at the All-American Bowl, but we learned firsthand that this truly does mean a lot to head coach Todd Smith.  product when we got him a lot over each year he's b now we have an all ameri he's got a couple more ga not gonna let him go just he's on the bigger and b at Penn State and just s great things will happen. off to those bigger and has to play in the all am us that he would be ready is most excited about com  I'm most excited to prove myself, to get in a good environment where I can work hard around other like-minded people and just really prove myself in a big setting. It really means a lot to me, just seeing the past guys who've played in the All-American Bowl game like Tim Tebow, Adrian Peterson, just growing up watching those guys on TV and being able to play in the same game that they played in is just a really big opportunity for me. It feels like all the hard work since I was like four or five years old paid off. I definitely want to thank my mom and dad more intimately and my head coach,  coach Smith and my strength coach, Coach A and really all the teachers, administrators and everyone who's had any type of impact on my life academically and athletically. And as coach said, of course, Caden will finish out the season here at the Hunn School, but we will all be looking forward to his future at the Penn State University. From Princeton, New Jersey, I'm Courtney DuPont. You're watching Jersey Sports Zone.  and our sponsors email marketing at Jersey sports zone.com to get your business in front of our loyal audience and highlights from your hometown."
}