{
  "video_id": "bHx1JyDuCDI",
  "transcription": " You  This antique camera is of the year 1839 and it was sold for $775,000 in an auction in the year 2007. It is the only existing Suss-Freyres daguerreotype camera. It is considered to be the most vintage camera of all times.  year 2006, and definitely was the coolest kind of the beds all around the world. The bed levitates 1.3 feet off from the surface and has the capacity to hold the weight of 2,000 pounds. It costs 1.6 million dollars. In the year 2010, the Diamond Panther and Onyx bracelet was  in the possession by Wallace Simpson was auctioned at the price of $12.4 million at Sotheby's in London. It is amongst the most expensive bracelets all around the world representing elegance and beauty to the fullest. In the year 2004, there was a painting named as Garcona La Pipe that was crowned as the most expensive Picasso painting sold for 104.5 million dollars.  This painting was painted in 1905 when Picasso was 24 years old, during his rose period.  The painting was obtained via private sale. It's considered one of the most expensive work of art ever sold. It is the second most expensive house on the French Riviera is worth 506 million dollars. The current structure of the villa was made between the years 1929 and 1931. It was done on an estate that was once under the rule of King Lepald of Belgium. It was also used in the film by Alfa Romeo.  Fred Hitchcock named to catch a thief. In 2010, a rare pink diamond has sold at Christie's auction for more than $23 million in Hong Kong, making it the most expensive jewel ever sold in Asia.  This watch by Chopard features three heart-shaped diamonds. The pink weighs 15 carats, the blue weighs 12 carats and the white weighs 11 carats. This is the world's most expensive watch. In 2000, it was sold for $25 million.  Geneva on November 13, 2013, for $83 million, a world record for a gemstone. The diamond had been estimated at $60 million. Antilia is 27-story, billion-dollar tower in South Mumbai. It is a personal house of businessman Mukesh Ambani, chairman of Reliance India.  industries. The quantity of the staff in the house to maintain it is 600 and it is apparently the most expensive house in India with a worth of 2 billion dollars.  you"
}