{
  "video_id": "Bo5pzWMsF4A",
  "transcription": " From its humble beginning, Gravity now boasts six dedicated team members who actively serve in the Boise area. I think my favorite thing about serving the businesses in the Boise community is just getting to know the business owners. Gravity serves hundreds of businesses in the Boise business community. Gravity supports the small business community in Boise by  just being involved in helping people learn more about business. If there's a way we can reduce their costs, we come to them and do that. Gravity is changing the credit card processing industry by providing a service that is 100% transparent, 100% fair, and 100% trustworthy. Every single day we come into contact with business owners who are flat, being taken advantage of, being lied to, and deceived, and are being stolen from, really. Small city like  Boise. Small business is the lifeblood of this community and it's important that that succeeds here. You know, these are people that are visionaries, they're entrepreneurial and Gravity supports that. Gravity makes a positive impact on the Idaho community by literally helping businesses succeed. Obviously we work to save them money, make improvements on their merchant processing. So having the opportunity to service business  owners not only with their credit card processing but anything they need in terms of helping them with their business is very motivating for me. Gravity has invested over $750,000 into the Boise business community. Well really it was the ability to establish a personal relationship with a person who lived here in town. There's a lot of trust that needs to happen in this kind of business.  I think honesty is one of the biggest things. Being up front, I'm a professional in the business that I work in, but I don't necessarily know how the processing business works. At Gravity, our goal is to not only come in, help improve their credit card processing situation, but do the absolute best at improving their business and educate small business owners on what they need to do to succeed. That's our entire business model, is to be transparent, to make credit card processing as inexpensive  as possible and to take that worry off of the business owners plate."
}