{
  "video_id": "BPsqUoZ-oh0",
  "transcription": " Hi YouTube, it's your everyday Erin and today I'm going to cut my side bangs. I first got them cut in the summertime. I'll link a video right here if you want to see that. And I trimmed them like a few weeks afterward and I'm like, this is fine, I'll just keep up with the trimming. But then I really got lazy and now the bangs are way too long. So I'm gonna cut them again and  I hope that I don't fail at this and look stupid. And then I'm also going to style them and show you guys how I do that. So let's get started. First I'm going to clip my hair out of the way just so I don't accidentally cut the hair that I don't want as a part of my bangs. Now the main event. Cutting the bangs.  So I'm just keeping the line that's there it's kind of like a slight angle this way I'm cutting that and then I'm gonna go in like this to make them less blunt And I wish I had like thinning scissors, but I don't so I'm just gonna go like this Okay styling time the main thing when styling you have to wet it  before you style it. Because right now, it's making this shape and it's not going to stop making that shape unless I wet the hair and then reset it in a new shape. So I'm going to wet it as much as possible. Okay, now that my hair is soaking wet, I'm first going to blow dry it with the hair going in this direction. And the reason for that is I want my hair to make like a C shape, so it's going to go that way and then that way. So I have to make sure that the roots are dried with the hair facing that way.  So I'm just gonna comb it to the right and I'm gonna blow-dry it focusing mainly on the roots If I could turn on my mom's hair dryer, this is so hard to turn on what the heck So what I'm gonna do is I'm gonna comb my hair this way put my  hand down and then comb my hair this way. It's kind of like a finger wave technique but with your bangs and with a large section of hair. And then I'm gonna blow-dry it in sections making my hand like reveal different parts of my hair. And if you have a really hot hairdryer make sure it's not on the hottest heat otherwise you're gonna burn your hand.  Okay, so I got the top and the middle styled and now for the ends. So I'm gonna just brush it down, cover it with my hand, and then sweep it across. And then I'm gonna angle the hairdryer facing this way and blow dry them and they'll just kind of wisp up in the air.  And I have these long parts on the end and instead of making them whip out like these I'm just gonna blow dry them to make them go straight down. And I'm just gonna repeat this process maybe like twice or three times until all my bangs are dry and in the shape that I want them to be.  Okay, so now my bangs are finally dry and in the shape that I want them to be but they're very flat against my forehead and they don't have any volume. So now I'm going to take a round brush and curl it underneath just to give my bangs some like puffing out action.  So now there's some curvature some volume happening and They're like, I think they're a good length. They cut right across my eyebrow Which is the length that I wanted them at and now I guess I'll take the rest of my hair out So now I am all done I'm very happy that it is a good length and I didn't make it look stupid And of course you can go in with some hairspray. I'm not personally  fan of hairspray but if you want the extra hold then you can go ahead put some hairspray in. Thank you guys so much for watching. Please let me know what you think in the comments below and I will see you in the next video."
}