{
  "video_id": "bPvb4_clf8E",
  "transcription": " My name is Bob Tallman and I'm the CEO and Chairman of the Board of Princess Auto. Princess Auto was actually started by a guy named Fred Ladbrook in 1933 and in 1942 my father was not yet old enough to join the Army and so he went  to Alaska to work on the Alaska Highway. My father had a truck there and worked very hard and then he got his army call. And so he sold his truck to a gentleman in Alaska and took a train back to Winnipeg and was promptly rejected for army service. He walked out of the door of the armories and went down Princess Street and walked into a little shop called Princess Auto Wrecking. Fred had known him from earlier days before he left and they started talking and Fred said, would you consider buying my business? And my father said, well, I haven't got any money.  And Fred said, how much you got? He said, well, I got the amount I got for my truck, which was $1,700. Fred said, imagine that. It's exactly the price I want for the business. And my father said, you know, I'm really not interested. And Fred Ladbrook, being the enterprising guy that he was, went over to visit my grandfather and said, congratulations, your son just bought my business. But you know, he didn't have any money for a down payment. Can you help me out? And my grandfather gave him $500, and my father owned Princess Auto, whether he wanted it or not. As time went on, he began to get  He began to do other things and he grew the business into a catalog house where he was buying product all over the world, buying surplus product and eventually turned it into a catalog business. My father really, really believed that we should work at a young age and unlike most people in today's world, I worked for Princess Hottow my whole life. I've never had another job and I learned a lot about what made this company tick at a very early age.  River, it was a change. I mean, I was going to this big place. Then I got to know some of my instructors. There's one or two that really stood out to me and what they taught me. The first lesson was to not follow the crowd. We talk about the non-homogenizing effect around here, and that is what we do shouldn't look like other people. It should look like us, and that's what creates loyal customers, loyal team members, and it makes our business, in my view, much stronger. The other thing that I really got out of one particular  instructor and I remember him so well was that people was the key to everything we do and I've never forgotten that because it is truly the people who built our business and everything we've done. One of Bob's greatest strengths as a leader is that he believes in people and he believes that they are the greatest asset of the company. We bought the company in 1978 from my father. In 1981 my brother stepped out  a little bit and I got more of an opportunity to be involved in all areas of the business. And I started then to play with the philosophies I had. I had this really uncomfortable feeling when you called people employees and managers that there was just a division that existed between the people who were in theory making decisions and the people who were doing the work. And my philosophy was everyone needed to do the work. And part of that meant changing the names of people. And we started calling everybody team members.  We make sure that they're engaged in the business. We share financial information every month so they know exactly where we are. We share operating information. We share our profits with them to a tremendous amount and every time we do that we gain a greater sense as a team about what's important. When you've got your best team members looking after your guests and they will do anything to make a guest happy, then that's the magic.  We began really simply. We worked with the Boys and Girls Clubs. We worked with a few small organizations in the North End. And then one day we kind of struck on this idea of providing scholarships. So we went to two schools, Sisler and St. John's, my father's school and my wife's school. And we offered to give one scholarship a year to one student who would not be able to go to university if not for this money. Well, that just opened up an amazing journey that we've been on.  Today we have 50 kids all going to university on Tolman Foundation scholarships. We have about 20 other families involved with us. We have an awful lot of volunteers. The Prince Otto Foundation was going to be different because it didn't require private funding. And the philosophy that we had was because of all of our customers basically are tradesmen, we decided that we would seek out trade schools all across Canada and begin to work with them to create bursary funds. And so Red River was the first group we worked with  And now we see how these bursaries have begun to fund students' education and it's terrific. I not only have the best job in the world, I actually feel that the entire Taubman family, Harvey included, have gifted me a chance to really help to make a change. It's really, really been about seeing change take place and seeing these quiet little students really become these confident, beautiful young adults who are just going to go off and do  amazing things. I believe that leadership comes down to a few basic components. It comes down to making sure you're sound strategically. And number two, we want to make sure our people are passionate and enthusiastic and are going to look after our guests. I have a passion for my job at Princess Ottawa and I believe it's through his leadership. In my opinion, in order to provide great service to your guests, you have to have a  people. It's really simple business."
}