{
  "video_id": "BvoAt3KG7PY",
  "transcription": " NVIDIA has launched the new GeForce GTX 560 Ti or Titanium graphics cards and we already have a handful of retail offerings to compare. Let's take a quick look at options from Galaxy, MSI and Palit.  retail offerings plus the reference design sent in for our initial testing. The base clock speed of the reference card was 823 megahertz core and 1000 megahertz memory, though all three retail options we have here today run faster than that. The Galaxy GTX 560 Ti GC uses a custom PCB and cooler that offers an interesting fold-out fan design that is useful for case cleaning purposes. The only thing to watch out for is that the power cables are properly tucked back when folding the fans back  in. This card runs only slightly overclocked with an 835MHz clock speed, so performance will be just over that of our reference design. For connection options, the Galaxy card has the same configuration as the reference design with a single mini HDMI port and a pair of dual-link DVI. The MSI GTX 560 Ti Twin Frozr II also uses a custom PCB and cooler that is noticeably heavier than the Galaxy offering. It comes overclocked to 880MHz core and 1050MHz memory speed.  The connections on the card again mirror the reference design. The Pallet GTX 560 Ti Sonic is the shortest of the three retail options, but still uses a custom cooler and PCB with a dual fan design. This card comes with the highest clock speeds out of the box, 900 MHz core and 1050 MHz memory. It also has the only differentiating connection set with two DVI connections, one single link and dual link, a legacy analog VGA connection, and a full-size HDMI port.  The GeForce GTX 560 Ti competes with the GTX 460, which it is replacing, as well as the Radeon HD 6870 and HD 6950 options from AMD. On average, we saw the GTX 560 Ti outperform the GTX 460 by about 30-35%, and also found it to run faster than the Radeon HD 6870. The new HD 6950 1GB card, however, does seem to be the better performer across the majority of our tests, but only by a small margin.  do make up for that difference, in particular the Palit and MSI cards that hit or nearly hit 900 megahertz. Running at their default speeds, both the Galaxy and MSI cards ran at much lower temperatures than their reference design, with the MSI Twin Frozr II running as much as 20 degrees Celsius cooler. The Palit card still performs better than standard, and considering it has the highest overclocked settings, its results are still decent. NVIDIA claims that the GTX 560 Ti GPUs should be very overclocked,  overclockable and in our testing the highest clock speeds reached with a stable gaming environment were 975 megahertz. Nearly the same limit was found on all three cards within 5 to 10 megahertz, even with the much improved temperatures of the MSI cooler. As of this recording, both the Galaxy and MSI cards are priced at $249 while the Palette card is about $20 more. Considering how easily we reach that 900 megahertz setting and above with manual overclocking, whether or not you want to pay more will depend on a need  for warranty on the overclock settings. All three of these retail cards offer something unique. The Galaxy card has the most interesting fan design, MSI has the coolest running card, and Pallets will run the fastest out of the box without manual tweaking. For more details on these cards, check out our full review at the URL below. I'm Ryan Shrout for PC Perspective. Thanks for watching."
}