{
  "video_id": "BW3kldc0K3M",
  "transcription": " We are going to open... Leaky Balls! 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12! Very beautiful!  Hello Friends My name is Ashmi Welcome to my big world of art Today we are going to open Leaky Box Today we will be doing a surprise Now let's start to open this box I am so excited to open this box  skip this video because this is very funny video now lets start to open this box 1,2,3,4,5,6,7,8,9,10,11,12 Surprise! Now lets open the first play cable pack this is the open side now lets open this we got puzzle  Now let's open the puzzle first. I got this puzzle. Dino Puzzle. Now let's make the puzzle. We have two puzzles. We can make any puzzle we like. One at the back and one at the front. I want to make this puzzle. Now let's make it.  so  I have completed the puzzle. This is very hard to do but I have made it. And I love my doing this. Now let's put it aside. Now let's eat the Dairy Milk. Yummy! The candy is very sharp.  Now let's open the second one. It's a Dinosaur. Now let's open the second one. This is a Dinosaur. Now let's read the manual and join the pieces.  Like this. Paste the stickers on both sides of the body of the dinosaur. Now let's paste the second one. Now I get it. Drawing the tail and a fist. Very beautiful. I like this very much. Now let's open the third one.  We got... I don't know what is this. Now let's see what is this. This is one egg. Now let's join it up. Now let's take out the sticker and put it right here. Now let's take out the small stickers. This goes right here.  Now I pasted the circles. I like this. If you like this one then comment below. Now let's put the sides. Now let's open the fourth one. This is a new thing we got. I like this.  This is very good thing. We want to put this dinosaur in the super dinosaur. Now it is going to... Now this is very good thing and this is very easy to draw. Now let's open the fifth one.  This is the same one. This is the same one. We got the girl. There is a girl, there is a boy. There is a difference between both of them. Now let's join them again. First I got the white one and now I got the yellow one. This is here. Again.  Let's open the sixth one. This is the same to same. Not different. I again got the same. Not any difference. Not any different. The character is also same. Take out. There are two. We got two. Now let's join it up.  This is going to work. Now let's meet the twin sisters.  also then this video will be very long then I open this in my part 2 video and don't miss watching that at 5pm on Friday bye bye take care and live your dreams  No, I want something else. Then eat the flowers. You will make me eat flowers. Now let's go and make sister and twins. Bye bye."
}