{
  "video_id": "BXpBmHYR8IE",
  "transcription": " This food brings the money. This is the food that when he broke out, he ate the food right before the draft. Oh, he's chef Stefanos food right before the draft. That's why I ran a four eight though. That's why I ran a four eight coming out of college. Cause I ate right before. Oh man.  Let's roll with this filet. Now, what are we doing here? We're going to turn the stove on over here, and then we're going to take the filet mignon nuggets. We're going to move them around a little bit with your hands over there, and put them right in the saute over here. We're going to jump them around a little bit. You supposedly have the best hands in the NFL, so we'll just... That's a rumor. That's a rumor. That's a rumor. Okay. Just like that. Nice and ten. We're going to see how you handle this. I understand you took kind of like a trip around the world. Tell me a little bit about that. Well, you know, I love traveling, and actually,  the NFL allowed me to go visit the troops over in Iraq this year. So then I just was like, I'm over there. I might as well just go check out a couple other places. So we just bounced around to about eight or nine other countries and, uh, you know, made it, made it a really nice trip. Where'd you go? Went to Kuwait, went to Iraq, went to Dubai, went to Egypt, Morocco, South Africa, Nibibia, Zimbabwe. Went all over the world. Went pretty much everywhere in Africa. Now, how do you feel like that experience, um, you know, what did you take away from that? Well, I like to take it right after the season and it kind of just lets me get away from ball.  I'm ready to get back in a miss are missing my teammates and missing my coaches and really want to get back and get back into the swing of things. I don't know if any restaurant serves filet mignon bolognese. I mean forget about the best dishes. Larry will be doing this dish the rest of his life. Forget about it.  Super Bowl 43.  might be the Super Bowl champions. Are you able to look back on that finally or does it still kind of hurt a little bit? No, I kind of more reflect on the experience. Just the playoff run, just the band of guys that, you know, 53 guys that really stuck together in this fall and scratched for everything. And we were the worst playoff team ever in history, what people were saying. So I think we did a good job and I was happy where we were and I'm looking forward to try to make that run again. Are you going to lay it on in, Larry? I'm going to work it in. You lay it on in, I'll work it in.  Moment of truth. You gotta go for it. Ladies first. That's right. That's the guy that always gets the football and gives it to the ref. That's him. Right here, right?  . ."
}