{
  "video_id": "Cbvn1hI7gR0",
  "transcription": " Carrier Hip Hop real estate right here live over here in Newark, New Jersey. Bob's getting there. I mean, New Edition was crazy. I mean, it was just magnificent. Showed a lot of love. But right now, Dominica, beautiful, talented, young, and not just from the United States, but another country.  It's been seven hours and fifteen days Since you took your love away I go out every night and I sleep all day Since you took your love away  Since you've been gone I can do whatever I want I can see whomever I choose I can eat my dinner in a fancy restaurant But nothing, I said nothing can take away this blues  Oh  Thank you very much. Thank you very much.  Dominika felt the fame on her own body. I don't think I'm extra famous, I think I'm like everyone else. I've been on TV three times and that's about it. But I notice that when I'm walking down the street, people turn their heads behind me, like, that's the superstar jumper. Martin the poor guy.  Hey guys, right now I'm in Harlow. I'm chilling with my man Cassidy.  overseas she just took a 20 hour flight overhead came out hard when I put all the world on the strip and just started going crazy, singing crazy, had everybody stopping made a crowd out here so we had to let y'all know that it's going down out here I go by the name of Cassidy I'm about to drop some new music real soon matter of fact I'll be over to your country real soon I'm on a flight real soon so look out for me you're awesome and you're in the building you already know possibly fam let's get easy  Let's talk about how do you two even, you know, how did that even happen? The internet is amazing. The internet's amazing. It's good to know people all over. And I have a couple of brothers that I know over in Slovak Republic that told me about this phenomenal singer. And initially I was resisted. I didn't want to take the time to look, but I'm so happy that I did. She's incredible. She got a set of pipes on her that blow your socks off. It's real. Let everybody know your name first of all, man.  Ray Ponce, a good friend of Bobby's. We had the New Edition concert. Been in the industry for over 30 years. Some hip-hop stuff, but nice and smooth, goes all the way back. I know this is hip-hop real estate, it's real. And just an old industry head, but this talent here is just impeccable. How far you feel about working with Ray? It's amazing. It's a big blessing, you know, from the gods. So I'm so happy, I'm so excited, and it's just awesome.  How do you know what songs to be selective on her new single? You got a new single coming out? What do you have coming out right now at this moment? A new single? She's doing an EP. She's got an EP with seven joints on it. Her forte or strengths are balance. We have some dance, you know, joints for young people. She speaks five languages. Where can they find her at right now if they want to really see her singing? YouTube. You can find her at www.dominikastara.com.  and Ponsini Entertainment. You're gonna see a lot of her. She's got a reality show coming out called The Making of Astara. She's incredible. Believe me, she's the truth. Y'all check out Donna Mika. She's doing a real big thing. Y'all just hear the live, man. Live and direct. She's official with it. So y'all stay tuned. Make sure y'all support what she's doing. Real talk. Kari A. Hip Hop. Real estate.  I wanna dance, I wanna shout, I wanna scream, I wanna doubt, I wanna ride, I want to slide, I want to fight, I want it now, I wanna I wanna, I wanna, I wanna have some fun I wanna dance, I wanna shout, I wanna scream, I wanna doubt, I wanna ride, I want to slide, I want to fight, I want it now, I wanna I wanna, I wanna, I wanna have some fun  Yo, Skidder from the Blitter, Scotch, Jet Skis, Cool Breeze, and the NDs, Lil LV, Miss Sixty, Pretty Young Things, tryna tempt me, cause they know I got the juice, simply, they see the chivalry, I'm a gentleman, and I got game, all American, yeah you know the plan, you tryna have fun, and if you keep it rated G, you can have some.  What you wanna have, what you wanna have, what you wanna have, what you wanna have, what you wanna have, what you wanna have, what you wanna have, what you wanna have, what you wanna have, what you wanna have, what you wanna have, what you wanna have, what you wanna have, what you wanna have, what you wanna have, what you wanna have, what you wanna have, what you wanna have, what you wanna have, what you wanna have, what you wanna have, what you wanna have, what you wanna have, what you wanna have, what you wanna have, what you wanna have, what you wanna have, what you wanna have, what you wanna have, what you wanna have, what you wanna have, what you wanna have, what you wanna have, what you wanna have, what you wanna have, what you wanna have, what you wanna have, what you wanna have, what you wanna have, what you wanna have, what you wanna have, what you wanna have, what you wanna have, what you wanna have, what you wanna have, what you wanna have, what you wanna have, what you wanna have, what you wanna have, what you wanna have, what you wanna have, what you wanna have, what you wanna have, what you wanna have, what you wanna have, what you wanna have, what you wanna have, what you wanna have, what you wanna have, what you wanna have, what you wanna have, what you wanna have, what you wanna have, what you wanna have, what you wanna have, what you wanna have, what you wanna have, what you wanna have, what you wanna have, what you wanna have, what you wanna have, what you wanna have, what you wanna have, what you wanna have, what you wanna have, what you wanna have, what you wanna have, what you wanna have, what you wanna have, what you wanna have, what you wanna have, what you wanna have, what you wanna have, what you wanna have, what you wanna have, what you wanna have, what you wanna have, what you wanna have, what you wanna have  you"
}