{
  "video_id": "cdXLYhJuqPQ",
  "transcription": " Hey guys, what's up? Welcome back to Beer Geek Nation. I'm your host Chris. Thank you so much for joining me once again. Alright, we are doing another special beer that just came out from Oregon. My friends, I am  Talking about the shoots brewing. This is their black view 23. It's their 23rd anniversary. Oh coming in at 10.8% 55 IB use available now just came out Basically what this one is it's a gigantic version of their black view porter Which is an amazing beer if you've never had it they aged 25% in bourbon barrels then blend it back in to the mixture They and then add orange zest from Seville oranges, which are a Spanish orange. They add cocoa nibs from an artisanal chocolatier  called Theo they add pass and pass pasilla negra peppers to give a little bit of that chili bite to it and Then they blend it all together and you get black view 23 one thing worth noting definitely worth noting is on here They have a best after 615 2012 so basically a year from now So they do suggest that you try it a year from now seller it So I would highly recommend you get one bottle to drink fresh one bottle to drink a year from now So with that said guys, I'm excited about this one. Let me get into a glass. You know, it smells tastes  and give you the verdict on the Black Butte 23.  I would expect that but overall just a really really nice looking porter. Alright the aroma on the Blackview 23. Getting big vanilla, a lot of oakiness in this one. Big that bourbon character is coming through as far as the oak barrel aging. Slight coffee, big chocolate coming through, dark chocolate, kind of that chocolate bitterness. You know I think I'm getting a slight touch of the orange zest. There's kind of a citrus kind of twang in there.  Not overwhelming at all, but definitely in there. A little bit of alcohol, but that chocolate and the oakiness, the vanilla is really, really coming together, making a nice smelling beer. It's really good stuff. All right, the taste on the Black Butte 23. Cheers. All right, so the first taste, first impression as it goes into the mouth, I'm getting a nice amount of chocolate sweetness. It's a big milk chocolate, dark chocolate kind of flavor coming in there. Coats the mouth, a really nice flavor.  coffee, espresso flavors taken over in the middle of the mouth, blending with that chocolate sweetness you got from the front of the mouth. I am getting a touch of the orange peel and I'm really surprised. I didn't think I'd be getting that in there. A lot of vanilla in this one. Big, big bourbon characters and getting the oakiness. There is a slight alcohol burn, but as far as tasting the actual alcohol, you really, really don't. Overall, it's a really, really nice barrel-aged porter. I think with a little bit of age though, this one's really,  really going to kind of even out and mellow out and things but I think it's a great great beer. All right guys the final verdict on the Black Butte 23 from Deschutes Brewing 10.8 percent. I'm going to give us an A- right now. I think overall it's a great barrel age bourbon bourbon barrel age porter. You know lots of vanilla lots of that oakiness from the bourbon barrels. You're getting touches that orange you're getting kind of the spiciness from the pepper in there. But with that said I think a year from now this beer is going to be fantastic. It's going to be  a phenomenal world-class beer. I think there are a couple flavors that kind of stand out. I think the chocolate kind of takes over the actual beer. It kind of hides some of the nuances from the oak aging and the vanilla quality. But I think with that said, I think the orange is going to drop out. I think the chocolate's going to drop out. I think the vanilla is going to come up and the bourbon's really going to kind of infuse in this one. I'm willing to bet in a year from now it's going to be an A plus beer, a world-class beer. So with that said, definitely pick yourself up another bottle, put it in the cellar. It is worth doing.  So with that said, my friends, remember life is too short. Drink amazing beer. Cheers."
}