{
  "video_id": "cDZxv-qvcg0",
  "transcription": " Hey guys, what's up? Today's Saturday. It's April 3rd, 2010. And I just watched Soldier Knows Best. You guys know Mark. His unboxing video of his iPad.  about 1050 here on the East Coast and he I didn't know he got that working. Yeah, by the way guys, this is my grandparents house Alright, I'm here most Saturdays. I was here this past Wednesday because it was spring break. We just washed I washed the Cadillac on Wednesday and we just waxed it today. So it's in really good shape I don't live here. I've had a couple of people ask me if I live here No, I just spent a lot of time here working and stuff. So anyways, just watch the iPad unboxing I have a viewer who's interested in in purchasing my  Lenovo 550. Thank you very much Will I think. So I don't know if that's going to work out or not but it's looking pretty decent and I was thinking with that money James R. Schultz might get himself an iPad here. They've got six models but only three are available. You guys know the 16, the 32, and the 64 gig. I've got a 64 gig touch and I don't need that.  that  video  or I don't really want to sit down with a laptop on my lap. I just kind of want to sit here and use the iPad. It's a perfect in-between tablet, what they designed, obviously. So anyways, I might get one, guys. I'll let you know. I'll make another video. It looks awesome. If I can get the money between now and then, I'll probably do it. Again, I have to talk to my dad, but keep you guys posted. Going to lunch now. Very smooth.  That's 70 knots. Yeah, it feels a lot different in the smart car. Yeah. It was a good idea to put a police station at the bottom of this hill. Yeah, it is. Welcome to Peninsula. Dell Road.  There's an old Chevy, I think. A whole bunch of old cars here, look at that. I see an MG down there. I don't know whether I can get in down there or not. I think the car's... well, the car's lights are gonna change and they'll all come up. I agree.  Old car. Old MG. Ooh, Lexus. Yeah. It's gonna be a nice, nice lunch outside today. That's loud.  Hyoga Valley. Yep, next table outside. About five minutes. It's the Winking Lizard.  It's a short one That's a long train. Yeah, I've ridden on that a couple times nice nice route Cool Beautiful day, huh?  a little windy though there's the music back can't open the bar yet this year though"
}