{
  "video_id": "CL4qjTsj0i8",
  "transcription": " I  If you're a realtor, you're going to love PYT. PYT was designed from the ground up to be realtor-centric.  designed to help raise the standard of care for your buyers and sellers, and in the process, PYT began to eliminate all the stresses associated with having a financing contingency in your transaction. As PYT was being developed, we interviewed hundreds of agents during the process. A theme resonated louder than a banshee. Lenders. Prove to me the buyer is really approved. Prove to me you will close on time. Prove to me that you can tell us up front if there are any  issues and communicate to the realtor community good, bad, or indifferent news at every stage throughout the transaction. Sound familiar? How about you? Have you or are you currently frustrated with a closing involving a lender? Well, fear no more. PYT is here.  is helping lenders raise the bar one loan at a time. In short, it's the gold standard of loan commitments. So what does this mean for you? If you have a buyer, get them with a PYT certified lender and that lender will issue a cast iron, rock solid loan commitment, removing all borrower financing contingencies up front and within 15 calendar days of the application having been taken. As a listing agent, suggest that your seller look at offers from a PYT certified lender as not only  Wow, anyone fallen off their chairs yet? Well, if that didn't work, this will. I can already hear the skeptics out there saying,  mean that you will close on time. Something always comes up. There's always a lender excuse at the very last minute. Not with a PYT certified lender, and here's why.  Can your chair? Agents, PYT protects your buyers' earnest. It raises your fiduciary. It will make buyers and sellers commit to working with you over other agents. And if that doesn't excite you enough, how great would it be to have a transaction close with no worries about lender performance? We in the industry call it LPA. We all have it. We all suffer from it. It's called lender performance anxiety. Get with a PYT certified lender today. You'll be glad you did.  After all, it's your transaction. Make sure it gets protected. Call today, 866-600-3700. On the web at protectyourtransaction.com for more information and all the terms and conditions.  the the"
}