{
  "video_id": "CO_BD_Xuf-U",
  "transcription": " A new telescope for mapping the skies is about to start work at ESO's Paranal Observatory in Chile. The VLT Survey Telescope, or VST, with the 268-megapixel OmegaCam camera at its heart, is the latest addition to the observatory. It is the largest telescope in the world designed to survey the sky in visible light.  This is the ESOcast! Cutting-edge science and life behind the scenes of ESO, the European Southern Observatory. Exploring the ultimate frontier with our host Dr J, aka Dr Joe Liske. Hello and welcome to the ESOcast. The new telescope is called the VLT Survey Telescope, or VST for short, and the special thing about it is,  that it has a very wide field of view, about twice as broad as the full Moon. It's dedicated to mapping the skies both very quickly and with very high image quality. The VST is housed in an enclosure right next to the VLT unit telescopes on the summit of Cerro Paranal, under the pristine skies of one of the best observing sites on the planet. Now, over the next few years, the VST and its huge camera OmegaCam will be busy making some very detailed maps of the southern skies.  And in this episode, you'll get to see the very first released images from this brand new telescope. The VST is a visible light telescope that perfectly complements the VISTA Infrared Survey Telescope. The unique combination of the VST and VISTA will allow many interesting objects to be identified that can then be studied in detail with the powerful telescopes of the VLT.  The VST is a state-of-the-art 2.6-metre telescope equipped with an active optics system that keeps the two mirrors of the telescope perfectly aligned at all times in order to ensure the highest possible image quality. Now at its core, behind huge lenses, lies the OmegaCam camera, which was built around no less than 32 CCD detectors, which together provide a whopping  The camera also contains some extra CCDs that help with the telescope guiding and the active optics system, as well as some absolutely enormous colour filters. Both the telescope and the camera were designed to take full advantage of the excellent observing conditions on Paranal. VST is a joint venture between ENAF, the Italian National Institute for Astrophysics, and ESO. ENAF, and in particular its Capodimonte Observatory,  in Naples designed and built the telescope, while ESO was responsible for the civil engineering works at the site. OmegaCam was built and designed by a consortium of astronomers working in the Netherlands, Germany, Italy and at ESO. The VST will make three public surveys over the next five years. One survey, called KIDS, will image several regions of the sky away from Earth.  from the Milky Way. It will help astronomers understand more about dark matter, dark energy and galaxy evolution, and find many new galaxy clusters and high redshift quasars. The VST Atlas survey will cover a larger area of sky and will focus on determining the properties of dark energy. Like KIDS, it will also hunt for faraway galaxies and quasars. The third survey, VFAS+, will image the central plane of the  Milky Way to map the structure of the galactic disk and its star formation history. It will yield a catalogue of around 500 million objects and will discover many new examples of unusual stars at all stages of their evolution. The data volume produced by OmegaCam is going to be pretty large, with about 30 terabytes of raw data produced every year. Now these data are going to flow back into data centres  in Europe for processing. The huge lists of objects found in the images, as well as the images themselves, will then be made public, so that astronomers from all over the world can use the VST data to help them figure out the answers to a vast range of different astronomical questions. The VST has just made its first release of images. The Spectacular Omega Nebula, also known as the  The VST field of view is so large that the entire nebula, including its fainter outer parts, is captured, and retains its superb sharpness across the entire field. Omega Centauri is the largest globular cluster in the sky, but the VST, with its very wide field of view, has no problem with it.  in capturing the whole object in a single image, including its very faint outer regions. This image contains about 300,000 stars and it highlights the impressive sharpness of the VST's images. The combination of large field of view, excellent image quality and the very efficient operations scheme of the VST  will produce an enormous wealth of information that will advance a number of different fields of astrophysics. Many astronomers, including myself actually, are really looking forward to the first results from the VST surveys. This is Dr J signing off for the ESOcast. Join me again next time for another cosmic adventure.  you  you"
}