{
  "video_id": "D3bmHjjrnvw",
  "transcription": " Oh my god that felt nice. Oh, not first.  Some third years actually third year ease through third gear release I Keep trying to hit the rear brake just slow down. I'm like, oh no, there's barely front bailer this full front brake And it's somehow getting gas without me giving it full front brake it barely works anyways  I was gonna make a cop and I wouldn't know because those lights are bright  so  This is a lake. Man, I miss this guys. I really do. This is just amazing.  It's just the temperature to where it's just like it's not like cold see a little bit chilly, but it's just perks It's not like blazing it hot or like freezing cold and my fingers, you know Not like freezing. They're a little bit chilly, but I like that for riding. It's just kind of just nice peaceful soothing and not super like sweating hot or  freezing cold. Oh no. That's nice. It tickles my feet.  Amazing amazing I've no idea what time it is probably 930 Do I care? Nope  Oh crap Are you serious? Throttle cable snapped throttle eBay, this is an eBay throttle that is why oh my god eBay throttle broke  That is funny. eBay is a piece of shit. Oh man, alright, let's go. I don't think it's the... I'm not sure if it's the cabler or just the plastic eBay piece. I think the cable is eBay too, so I don't know. Oh, well, I guess that concludes this video, guys. Oh my god, I better get this up and running by like... soon. I'll have it up tomorrow after I mix up the bottles, but...  Yeah. Thanks for watching. Subscribe. A thousand subscribers gone by fast. Oh man, I think I was right there and not like on the trails a mile away. Anyways, thanks for watching. I'm excited. This weekend's gonna be fun. Goodbye. It's the throttle cable.  You can see right there a snapped throttle cable from eBay. Alright, thanks for watching. I'm disappointed in you eBay. Very disappointed. But luckily, throttle cable, throttle cable, throttle cable, nope, two throttle cables and a clutch cable.  you"
}