{
  "video_id": "D54dYP-rlrs",
  "transcription": " Off the draw inside the West Kelowna zone, it's back to the point. Played there, Golambus over to Zach, back to Golambus. One touch pass is for Morton. Morton in shot, he scores! Sam Morton blistered it high up under the crossbar on the glove side.  17 seconds into the man advantage. And the Wilds take the 1-0 lead. Stratton backhands it around. Vanderbeek plays it in the right corner. Walks off the back wall with it. Tripped up. And a penalty coming. There's Stratton. The shot just goes low and wide. A delayed call against West Colona. Isley to the bench. Extra skater on. Zek holds it in. Cuts over to the near side. Still with it. Feeds it back up. Top shot! Save made. Rebound. Score!  Boy, how about that shift for Cooper Zeck? With a delayed penalty pending, he did a fantastic job of keeping the puck not only in possession, but then keeping it onside. Fought his way all the way around the circle, came in, and then followed up on a rebound to drive it home. And the Wild now lead it 2-0.  Two to nothing. Little help on the near side as Von Ungern-Sternberg plays it. Snaps it up top midpoint. Sasaki shot, rebound, score! Sam Hessler. The Wild just kept the pressure on, kept the foot on the gas. Buck came back up top.  to the midpoint and then snapped over for Hessler. He sweeps it home. The Wild now lead it 3-0. So fourth power play chance of the game for the Wild. They are 1-3. The league's number three ranked power play unit. Zeck to the midpoint. Sends it over for Morton. Morton down low. Was intended for Weatherby and he had it for a moment. Tried to walk out front, slapped away. Loose puck shot, score!  Zach Galambus had come down from the point. The puck worked its way out of the right corner out in front. And Galambus drives it home. Power play tally. And the Wenatchee Wilds now lead it 4-0. Picked off his blade by Demmon.  And back again for Jamin his pass is to Weatherby Weatherby up on the left side he shoots he scores What a dart from Jasper Weatherby on the left side from the top of the left circle in stride unloaded And he rifles it home 5-0 Wild Leading  Way back under way, shot, score! Slava Demmon from dead straight away. Weatherby may have got a tip on it. And the Wild now lead it six to nothing. And Weatherby certainly did get a stick on that.  The offensive zone draw came straight back for Slava Demmon and he let it rip. And right at the side of the net Jasper Weatherby his second of the night. 29th of the year."
}