{
  "video_id": "DHULPs5EaBU",
  "transcription": " Okay, this is where I make my comeback. This is where I make my comeback every time. This is where I... What? You are good. You are good. You need some cheat codes. This is where I... No. You... Come on. You... What? Don't gotta...  I missed you. I know. Molly, I want you to meet someone very important.  This is your sister, Sarah. Hi, Molly. It's nice to meet you. Nice to meet you, too.  You know, I'm trying hard to take it back So if by the time the bar closes and you feel like falling down I'll carry you home Who's this? This is Rex. Hi, Rex. You know, I used to have a stuffed dog, too, when I was little, and I named him Bunny. That's a funny name for a dog. I know. You know, I can't even begin to tell you how excited I am that I get to meet you.  It's a lot to me, too. More than you know. It's been so long since I've seen her. She was always a tough little thing, you know? But I worried about her. Growing up mostly with her father, she always kept to herself. I know I don't know you really well yet, but thank you for giving her this.  I'm gonna fry it. I'm gonna fry it. That toast came in some fancy Chardonnay. Don't worry. I know where Sarah keeps the scotch. Kitchen, top-left counter. Nice. You were, uh, pretty good with Molly today. Well, I'm kind of a sweet guy. When I'm not in douchey, intersect brain-fuckin'  melting, life-ruining phase. Mission accomplished today, huh? Yep. Looks like Morgan finally found the right girl. I know how he feels. Your favorite. Honey, you didn't have to do that. I wanted to. Well, I'm the lucky one now. Is this dog?  Joining the CIA and giving up everything you did... Did you ever think it would lead you here? No. No, but, uh... Chuck's taught me that every now and then it's okay to be surprised.  It's good to have you back, Agent Walker. Sometimes when an agent goes through what you did, we lose him. Well, you're not gonna lose me, sir. But I am done with handlers. Oh, I agree. In fact, I think that it's time for you to become one. I have a new assignment for you. Something of the stateside. Do you think you can handle this one?  you are tonight."
}