{
  "video_id": "DrchbuazH2g",
  "transcription": " Arsenal! Arsenal! Arsenal!  by Uruguay and a World Cup now without no Messi and no Ronaldo. Wow. FIFA must be kicking themselves, but listen, it's going to be the emergence of some new stars at this World Cup. We saw Mbappe earlier on. But you know what? I want to focus on a player that should be on his way to Arsenal come the end of the World Cup, and that is Lucas Torreira of Uruguay. What a fantastic performance by him tonight. I was looking at this game and I was like, you know, all right, of course I want to watch the World Cup.  game and I'm really interested to see how it pans out and who gets to the quarterfinal etc. Exciting game. But my eyes were really focused upon Lucas Torreira because he's been linked with a move to Arsenal. Everybody's more or less in the know saying that it's a done deal that will be completed when the World Cup's finished for around about £25-26 million. And from what I saw today, I think we've got a steal. I think we've got a player that we've needed for years. A defensive midfielder  and he looked the business tonight. First half, he was really, you know, sort of looked like he was almost like detailed on Ronaldo and I've got to say, he'd done a great job on Ronaldo, denying him space. And then in the second half, when Uruguay went deeper and deeper and deeper, he just sort of sat in front of the back four of the excellent Godin and Jimenez and he just swept up. He was brilliant. He was a fantastic performer.  I'm really infused and I'm like, listen, if that's the sort of performances he's going to put in for Arsenal, you know, sort of creating that shield in front of our back four, it's going to be just what we need. I was looking at some of the stats. 44 touches in the game, 21 passes, four clearances, four blocks, won three out of three aerial duels, two interceptions, two recoveries, won one of five tackles. Brilliant, brilliant.  I think we just, you know, we're about to sign ourself the perfect player, what we've needed. I heard him being described as sort of like the Uruguayan version of N'Golo Kante. And what I saw today, he does look very similar to Kante. Not only was he good at tackling and not only was he very tenacious and you saw that he was giving everything for the game, but also his delivery on set pieces was good. He was taking corners.  I really, really like what I saw and I think, you know, this is an exciting signing. Now listen, he's a defensive midfielder and normally you don't get excited about these type of players because, you know, they're not your headline players. But for us, that's had such a poor defence over the years, we've had a defence that's had no protection in front of it, he just looks like he's perfect. I really would like to find out what you guys  thought of Lucas Torreira's performance. As I said, my pure focus was upon him today. But I'm really, really infused and really infused by this World Cup, by the way. Absolutely brilliant. I'm going to be heading back over there tomorrow in time for the England game. And I've got to say, the World Cup has been absolutely magnificent. The Russians have done a great job with it. The games have been brilliant. It's just been perfect so far. So listen, let me know in the comments what you thought of Torreira's performance today.  Do you think we're signing a good player? Do you think we're signing a player that we exactly what we needed? Let me know in the comments below Uruguay have won, Ronaldo's out, Messi's out. I haven't heard from troops. I knew that he was sort of lining it up. He was waiting after he saw the game earlier on when Messi, you know, obviously went out. I knew that he was waiting till later on, hoping that Portugal would progress and then he was going to give me stick. But I haven't heard anything from troops. So troops, if you're out there,  there. Why are you so quiet mate? Why are you so quiet? Messi's still the best in the world. Thanks for watching the show. It's been brilliant. We'll be back with Transfer Daily in the morning."
}