{
  "video_id": "e0pJ0NsWI10",
  "transcription": " Sengenta Canada and C&M Seeds present the Wheat School on realagriculture.com  about nitrogen on wheat because right now there's a lot of growers who are wondering do I buy my nitrogen now and how much nitrogen do I need for my wheat crop and we're so far past the old 90 pounds of nitrogen on wheat. If you're still at 90 pounds of nitrogen on your wheat crop in Ontario you are slipping the clutch. There is just no question about that. Now I better stop there for just one second and say if you're growing wheat after peas and you put more than 60 pounds of nitrogen on your wheat crop it  can be ugly because she does this pretty easily and at some other time we'll get into the whole concept of residual nitrogen from a cover crop to corn or to wheat because they really do work differently. Wheat after peas be careful. Other than that if you're growing wheat after soybeans, if you're growing wheat after silage, perish the thought. If you're growing wheat after edible beans and you don't have manure in the rotation and you're not at 120 pounds of nitrogen, you really are slipping the clutch because there's more yield  potential out there. I've been astounded actually at how much response we've gotten to nitrogen on wheat. We always used to say you couldn't go over 90 pounds because you would get into lodging. Dr. Dave Hooker and myself and our technicians Scott J, Shane McClure and Gerald Bax have been doing just a bunch of work trying to move that bar forward and what astounds me is we've gone up to a hundred and eighty pounds of nitrogen on wheat and I thought that would be the soybean  on float and scrape it off the ground. And it hasn't been. Most of the time, the wheat still stands very well. And we now have a lot of our top growers pushing 130, 140, 150 pounds of nitrogen. And in our own nitrogen rate trials, we've been running 0, 60, 90, 120, 150. And the 150, most of the time, is the highest yield. And so as a researcher, I'm a dismal failure  Because a researcher has to push outside that envelope I'm going to have to start putting a hundred and eighty pound nitrogen rates in my wheat nitrogen trials on a regular basis to try and get outside of the realm of response. Why is that? Well part of that is because we're using fungicides and a lot of the things that I talk about here if you're not using a fungicide particularly a Fusarium fungicide what we call a T3 fungicide What happens if you don't use that fungicide?  I add a whole lot more nitrogen and this is what they do in Europe as well. This is why in Europe they get 220 bushel wheat because they put a fungicide on the wheat crop. They actually put several. We don't necessarily need several, but what they're doing is they're keeping the crop alive to utilize the nitrogen. What happens with my added nitrogen is I build this massive lush green canopy and then if I don't have a fungicide to keep the disease out, well,  disease has such an ideal environment to just take off and decimate the crop that suddenly I don't have enough leaf area, I don't have enough photosynthesis to make use of that extra nitrogen for added yield into the crop. So there really is a synergy between those two. We call it the smart program here in Ontario, but there is, it's like if nitrogen is one and fungicides are one as well, you take one plus one, it does  doesn't equal 2, it equals 2.5 or 2.75 or maybe even 3. There's a real synergy between the two of them. Having said that, 2011, 2012, Johnson runs these wheat nitrogen response trials at least half the time it looks like we need 150 pounds of nitrogen and if you guys would just get off your duff and start listening to me and use enough nitrogen, maybe we'd get the provincial wheat yield in Ontario over that 100 bushel per acre mark.  and I could retire."
}