{
  "video_id": "e6QQmdPgUD0",
  "transcription": " What's going on what's poppin everyone it is Friday Which means we are about to be heading into the weekend myself the karate kid in the back And my dad we're off for an epic epic adventure. We're going cross-country. We are driving to Las Vegas, Nevada Wow what a surprise I didn't know that I got my job  No, wait, you didn't take off. Oh, but we're heading there now Living life on the edge. No guys all jokes aside. We were actually heading off to Costco. Just as fun. Just as fun Come on over there you're gonna sit in it You guys confused or something so we come here we have a strategic game  Dad is one of those people that when there's a sale even if he doesn't need the item he somehow Finds a reason that he needs it and the toes are actually $3 off so watch this. He's definitely gonna get at least one watch I believe asthma ends in that Alex let me let me go one of these did I not say he was gonna get one we need another car  I'm out here shopping in Costco in Australia.  Another umbrella? Oh god, it's bad luck dad, don't do it. Something wrong with it. Dad, dad, dad, dad. We gotta turn it. Yeah, this one's for you mom. Here you go. I feel like I'm with two kids right now. Come on. We have no food in the- Oh my god. I'm so sorry. I just ran over his phone. This is for uh, for the boots. You're a hoarder. We don't need this.  I have the broken plastic one. This is nice, very decorative. What do you have now? I've never seen this here. I thought you guys came here for food. That's what I thought. I thought so. Picking up a lot of my time. Slowing me down. We need that. Holy crap. It's a flying saucer. Now that's something we could use. Thing will take off. We'll all be sitting in the yard. We'll wind up in the woods. Get a tailwind with that thing. Baby will take us right off. Boom chaka pop. No, not chaka, chaka, chika. Oh, boom chaka pop.  How's your healthy eating been going? I've been doing phenomenal. I've been eating healthy protein cookies. So why are you at the cookie and dessert area? I want to eat this. This looks really good. Chocolate chunk toasted walnuts. Those are gigantes. What do you have there? Some chocolate. Go get some chocolate.  This is getting weird. Winner winner chicken dinner. Squeeze the berries. I can't open it. It feels nice. They have it. They have it. What is that? It's cauliflower rice.  Curl and hurl. Curl and hurl. Let's see you curl this. What is that? It's not even a word. That's a line. That's a ban-an-an. A ban-an-an. Nine times out of ten, whenever he goes food shopping, he always has to call someone to figure out if what he thinks he should get is what he should get. Blueberry, raspberries. You would think, based on his facial expression, that he would be on the phone call with like a really huge business call. No. It's about figuring out what fruit he should buy. You said you're gonna be good. I didn't place the sandwich. Why do you have ice cream in your hand?  You put it there Oh Giant are you looking at the big flow? Oh, that's out for you  Why are there all these wrappers here?  Two hours later  Instagram at a sooner Sarah if you're not following each probably follow me so then you can follow me and also film the workouts So it's gonna be a good one. I will see you very soon  Let's go. Up. You got it. You got it.  I really thought I was going to give up at 10 reps.  So I just wrapped up my live stream It's really really cool and told there was like 60,000 of you that tuned in which is awesome It was my second time doing a live stream through a workout. I'm absolutely dying right now right now We're doing single leg straight leg deadlifts and my hammies are on fire. Workout is going good  Oh that was awful  That's easy for Terry so for those of you live stream you would have met Harry didn't officially introduce you guys Okay, so this is Terry. He is the manager of la fits  Now you have to get your hamstrings  Like completely delirious right now, but I've been listening to some awesome music I'm gonna head to sleep very very soon stop what you're doing right now Make sure to give the video a like if you enjoyed it subscribe if you're not subscribed already so that you get notified when I upload my next video Have a wonderful night"
}