{
  "video_id": "EEA-VJS7JIQ",
  "transcription": " I know. I know. I know. I know. I know. I know. I know. I know. I know. I know. I know. I know. I know. I know. I know. I know. I know. I know. I know. I know. I know. I know. I know. I know. I know. I know. I know. I know. I know. I know. I know. I know. I know. I know. I know. I know. I know. I know. I know. I know. I know. I know. I know. I know. I know. I know. I know. I know. I know. I know. I know. I know. I know. I know. I know. I know. I know. I know. I know. I know. I know. I know. I know. I know. I know. I know. I know. I know. I know. I know. I know. I know. I know. I know. I know. I know. I know. I know. I know. I know. I know. I know. I know. I know. I know. I know. I know. I know. I know. I know. I know. I know. I know. I know. I know. I know. I know. I know. I know. I know. I know. I know. I know. I know. I know. I know. I know. I know. I know. I know. I know. I know. I know. I know. I know. I know. I know. I know. I know. I know. I know. I know. I know. I know. I know. I know. I know. I know. I know. I know. I know. I know. I know. I know. I know. I know. I know. I know. I know. I know. I know. I know. I know. I know. I know. I know. I know. I know.  During these difficult economic times, we will stand with you. We are confident that the nation that built the Parthenon, invented democracy, and inspired the world can rise to the current challenge. Millions of visitors have already had the experience of  walking through this magnificent museum here in the shadow of the Acropolis and experiencing firsthand the extraordinary gifts that Greece has given over its long history to Western civilization in which my country as well is in your debt.  and it suffers from the false excavation and illegal export of its antiquities. That is why the agreement we are signing today is so important for us. It strengthens our struggle against the illegal trade of cultural goods. It strengthens our cooperation in a major area, with the aim of highlighting the Greek culture, the global culture, for the benefit of our two peoples and the whole of humanity.  of the Ion of the Holy Democracy. The imposition of import restrictions on categories of archaeological and Byzantine ecclesiastics."
}