{
  "video_id": "efv_PnNp5XE",
  "transcription": " I decided to have a breast augmentation procedure because I was self-conscious about my breasts.  not so I decided to get the lift as well. After talking with her and her mother who was also there we decided that we'd go with around a small to medium C cup and at the same time doing a small lift. It's called a circumareolar lift. With that lift there's only a scar around the nipple areolar complex so it's just one scar in a circle.  She came in, we did the procedure, she opted for saline implants because she had a decent amount of breast tissue to start with. So in her case, salines were going to be fine because she had enough padding of breast tissue. The surgery is going to impact my life by just my outer image, my self-image, just probably have more self-esteem. I'm not going to be conscious.  about my breast anymore. I'm probably going to be happier. On some patients like Farah, just putting the breast implants won't give an adequate result. The implants will be in place, but the breast will still be hanging off the implant. So in these cases, patients need some sort of lift. Some patients need more of a lift than others. Some patients will just require a small lift, a circumareolar lift, or some might need a bigger lift called a vertical lift,  or some will need a full lift. In the full lift, you have a scar around the nipple area complex going up and down across the bottom. The vertical lift is nicknamed the lollipop scar where it's just a scar on the nipple up and down. And in Farrah's case, it's just a scar around the nipple. She wasn't that droopy, so she got away with just doing a small lift. We've got her down to a normal-sized areola now. And the left breast was a little bit bigger than the right, so we filled up the right one with a little bit more saline.  and they look pretty even, they look pretty nice. I think she'll end up being a nice medium C cup. Afterwards she came in and she had a great result. When people make comments about my results, it makes me feel happy and that I'm glad that I got it done. She's probably about three months post-operative from the surgery right now and everything's healed fantastically. She's nice and soft, no scar tissue problems.  Her breasts look nice and even. She's very happy. It impacted my life in a more positive, more exciting way. I have fun more shopping and going out and hanging out with my friends. Everything's just better. My family and friends, they're just shocked a little. But then they're really happy for me. So now they want it too.  you"
}