{
  "video_id": "EQ5CXl-Y9pQ",
  "transcription": " Hello my lovely Victorians and welcome back to my channel.  I'm going to make that a thing. Watch one of these days y'all y'all laughing at me now y'all think it's corny as shit right now, but watch one of these days. It's going to really catch on and people go like yeah, man. I'm repping that V shit. I gotta stop cussing. I'm already been telling y'all that I'm gonna be doing that. I'm gonna be doing that. I'm gonna be doing that. I'm gonna be doing that. I'm gonna be doing that. I'm gonna be doing that. I'm gonna be doing that. I'm gonna be doing that. I'm gonna be doing that. I'm gonna be doing that. I'm gonna be doing that. I'm gonna be doing that. I'm gonna be doing that. I'm gonna be doing that. I'm gonna be doing that. I'm gonna be doing that. I'm gonna be doing that. I'm gonna be doing that. I'm gonna be doing that. I'm gonna be doing that. I'm gonna be doing that. I'm gonna be doing that. I'm gonna be doing that. I'm gonna be doing that. I'm gonna be doing that. I'm gonna be doing that. I'm gonna be doing that. I'm gonna be doing that. I'm gonna be doing that. I'm gonna be doing that. I'm gonna be doing that. I'm gonna be doing that. I'm gonna be doing that. I'm gonna be doing that. I'm gonna be doing that. I'm gonna be doing that. I'm gonna be doing that. I'm gonna be doing that. I'm gonna be doing that. I'm gonna be doing that. I'm gonna be doing that. I'm gonna be doing that. I'm gonna be doing that. I'm gonna be doing that. I'm gonna be doing that. I'm gonna be doing that. I'm gonna be doing that. I'm gonna be doing that. I'm gonna be doing that. I'm gonna be doing that. I'm gonna be doing that. I'm gonna be  me later that I didn't stop cussing. I'm gonna stop. Watch, I ain't gonna curse no more throughout this entire video. Watch. Hi! So today's video is gonna be another reaction video. I'm coming back with a K-pop, another one by Stray Kids called My Pace. Now I have not listened to this song. I have no idea what's the theme, what's the tempo, what's the cover.  I don't know what's going on with this video. I just picked the first comment from my previous video underneath where I asked what would y'all like me to react to? And I believe this is the first comment. So that's how I got, that's how I chose. If you would like to see me react to another video, I'm going to leave a comment down below. Leave a comment on what you would like me to react to and depending on either  whoever's first or whichever one has the most likes that will determine which one I react to next. Good luck. Good will hunting. So I'm not going to drag this out anymore. I'm just gonna go ahead and do this. I'm gonna go ahead and press play to my pace. Well actually no I can't do that because I have to pull it up first. Hold on.  They're playing soccer.  oh my god this lady  wait 107 he was just riding a horse in the bike ground why does he have a horse is this at the rodeo or is listen first of all oh my god  He's just sitting on some tires. I'm about to add this to my workout playlist. I can... I like this highlight.  I just want to dance with them. Man, I would love to dance with them. Okay.  Talk to me baby. I don't know what he said. I don't know what he said. Going at my pace. Is that what he's talking about? Going at my pace?  don't you dare don't you tell me it's over i'm not done looking at them yet i don't know either i don't know what y'all saying this sounds so good in my ears  Oh my god, that's like the um The Halloween movie. Yo, wait, wait, wait, wait. Oh my god  Well, it doesn't matter if I wait now one three thirty nine because it's at the end of the movie at the end of this shit Y'all how many times if I cussed in this video Anyway, but that fucking dance shit, isn't it the shit from I'm still cursing Lord. That's from the  Halloween Kids Halloween Show movie that everyone was scared that they say was scared of. I never watched it as a kid. What was the name of it? It the name of it was it. Y'all it took me so long to remember two letters I and T Lord, but they little  Okay, just for the sake of the music video, I will finish it off until it's at zero, zero seconds. Cause I don't know, they could be doing some crazy stuff. I mean, right now they're running through a tunnel. I would like to run through a tunnel. Okay, just, all right. Yeah. Okay. Like I said, I didn't have to do that, but I felt like I needed to, cause anything is likely to happen.  If you enjoyed this video to any weight, shape, or...  I'm super duper excited about it. But if you would like to see more from me, leave a comment down below and I will be checking them regularly. Hope y'all enjoy the rest of y'all day, night, evening, morning, sunrise. Bitch, you're stupid."
}