{
  "video_id": "EsZG07lW9KU",
  "transcription": " Today I'm looking at the Sony Xperia C4. So while there is still no sign of the flagship Xperia Z4 arriving on the UK shore yet, it won't be too long, hopefully. So Sony have decided to explode back into action and back into the smartphone scene with this new Xperia C4. And like a plastic explosive, it does seem  to look, well, quite plasticky. But we should take into account that this will have considerable bang for the buck. And you might be wondering what the hell I'm talking about. So Sony's secret weapon, a super samurai ninja killer feature on this phone is right there staring you in the face. Literally. Because it is its front facing 5 megapixel wide angle lens with a flash. And as it's positioned on the front and not the  back I guess we could call it a reverse flash. This means the next time you're in a nightclub and that really annoying song comes on, you can blind the person behind you trying to photo bomb your selfie with your C4 front-facing reverse flash. So let's have a look at the design and run through the specs real quick. This phone weighs just 147 grams and is 7.9 millimeters thick. It will have a 5.5 inch full HD IPS display and a front-facing camera which is 5 megapixels with an XMOR sensor  On the back it will have a 13 megapixel camera with HDR and autofocus. Inside it will have a 2600mAh battery and a 1.7GHz octa-core processor which is great because if you cut off one head, two more should take its place. Hail Hydra. Hail Hydra. The C4 will come only in a 16GB version with 6GB being taken up by the operating system which leaves you with 10GB. But the good news is you can upgrade with up to 128GB microSD.  And of course this is a Sony device so it's no surprise to see NFC along with Bluetooth, WiFi, GPRS and 4G LTE. So as you can see this will be available in three colours, a mint green, a white and a black. The bezels on the C4 resemble slightly the current flagship model from Sony, the Z3 but with a plastic back. But if this doesn't float your boat then you can hang on and wait for the Xperia Z4 or if you find yourself with some free time, check out the WODgear Sony Xperia M2  So this phone looks like a ton of fun and on that subject, this is what 100 tons of c4 looks like So while this is not the flagship destroyer phone that we've all been waiting for from Sony it is however a great option if you're into taking amazing quality mid to close range selfies in the dark and in all seriousness This looks like a great phone It can do pretty much all you demand of a great smartphone with lightning speeds due to its high speed  GPU and a sleek design to rival that of the iPhone 6 at a much more affordable price. And if that's what you're looking for then go get the Xperia C4 and that won't be a problem. So thank you for watching and if you enjoyed this video hit the subscribe button now and I'll see you in the next one. Don't be late.  you"
}