{
  "video_id": "EtS4Uk1-jhQ",
  "transcription": " Hey yo 10 minutes after 5 about to jump on the highway head out to Lake St. Clair hit this meeting I hope I'm in yo Still don't have a confirmation, but you know how that go gotta go out there anyway, see what's happening. So I'm on my way Let's go  so  Alright, just made it to the meeting.  Let's go see what's happening. Yo, look at that view though. That's dope, right?  so fast it starts late it ends early because of the weather which we'll get into that later here in a few minutes but um yo all right guys so check it out it looks like looks like i'm not gonna make this one yo i'm trying to hold on to optimism but this go around i'm like number nine on the waiting list and uh the odd thing about this one is it seems  seems  up and we'll see what happens. But other than that, it seems like it's just another indication of what I know that I need to do. And that is to continue working very hard to become a boulder because it seems that there's a shortage, right? It seems that there's a shortage. So I'm needed out there. You may be needed out there. So if you're thinking about being a boulder, yo, come on out here because we need more folks.  so that everyone can get a chance to get out and fish. It's no fun, man, sitting on the banks while these guys roll out and have fun on the water. So the other thing too, man, is like I said before, everything happens for a reason. And from what I understand, tomorrow, tournament director is saying that tomorrow is going to be possibly pretty bad out on the water. So chances are it's going to be a tough one for the guys  that end up do making it out if they don't end up canceling this tournament all together so just not sure so that's what it is y'all what a way to end the season though right that's pretty whack but what can you do so if it turns out that I can't get out on this one which it looks like I'm not it just means that it's time to  start preparing for next year already. It's gonna be a long winter so I have a long time to try to get things ready, try to get prepared, stack up some money so I can pay my entry fees as early as possible. That increases your chances of getting in and we'll see what happens. We'll make adjustments, not excuses. Dope-Ass Angler, still and forever, out.  See you, wish, us, y'all."
}