{
  "video_id": "eugSjfXCApM",
  "transcription": " So I've just been joined by Steve from Infinity X Distribution and they're just bringing this product to the UK market. Steve, what's going on here? Well this is the world's most versatile mini tripod system.  is built to be able to capture and include everything that you need as the accessories that you need to go off and do some vlogging with. Okay, what's it called? It's called the Picker Pod. The Picker Pod, okay. So did we see this last year at the show and now you guys are properly distributing it in the UK? Yeah, that's correct. They were here last year themselves and now we've got the official distribution across the UK. Okay, so do you want to talk me through what's going on today?  The center bit here, that's the main kind of tripod, correct? Yes, that's the main tripod. It's designed with three mounting rails. From there you can mount some of the extra accessories that come with the Picapod. We've got the multi-grip for screen devices. We've also got additional ball heads that mount on the rails as well for power supplies, additional power supplies. And then we've got the screw ball heads as well that screw onto the standard  you know quarter inch and 3.8 screws for your cameras to mount on the top. And then just a handle, another handle accessory there just for extra grip. Yep just another steady handle again that comes on for the rail. Also with this you can use it as a handheld device or you can take the grip off and you open up into the tripod. Nice and correct me if I'm wrong but these rails that's something that's actually used on rifles and things like that for mounting?  Yeah, so the technology for that system is already been proven. It's strong, it's reliable, it's sturdy and that's why it's been incorporated into this unit. And it's all solid metal construction? All solid metal construction, well aluminium. So you know corrosion, it's all against that. And it'll last for a long time. And how much money are we looking at? Let's go through the individual components. So for the main pick-up  Yeah, so the main picker pod that comes with a standard ball head and multifunction grip that comes at $119.99. And then we've got additional clamps. So we've got another ball head, which is $29.99. We've got the ball head then that mounts onto the rails. That's $37.99. And the same for the multi-grip that mounts onto the rails. And the handle? And the handle is $29.99. And that only comes in connected to the rails. And then obviously, once you've got the handle,  all the heads on you've got your standard tripod thread on there so you can mount anything onto there as well to expand it even further. Yeah, expand it even further and to carry it away you can unscrew the tripod legs, put them inside the main body, screw it back up again. It can all be kept in one unit and you've also got a wrist strap that you can connect it to your wrist and carry it around with you at the same time. Looks brilliant. Can I have one to test please? I'd love to actually go and try it out. Of course, no problem.  we will send one to one. Brilliant. So that is it, that is the Pick a Gear, Pick a Pod and accessories and keep checking back to Photogear News because hopefully we're going to be doing a full review on this very soon.  you"
}