{
  "video_id": "ffQ1NlHqsdU",
  "transcription": " How to Get Rid of Double Chin Fast  Some men can grow a beard to hide it, and some women can mask it with the appropriate haircut, but only for so long. A double chin is mostly because of too much weight gain, but it can also be due to aging, which leads to skin sagging. Some blame genetics, and some blame a sedentary lifestyle that encourages obesity and lacks muscle tone. Here are ways on how to get rid of double chin fast. 1. Chew Gum Chewing gum is like spot exercise.  2. Chin Up, Down  Chin exercises are another good way to get rid of your stubborn double chin. One effective exercise is to open your mouth as wide as you can and stick your tongue out as far as you can. Hold for 10 counts and repeat 10 times. You will feel the immediate tightening of your chin and neck muscles. Another effective chin and neck exercise involves lifting your chin and then turning your head to the right. Slide your bottom jaw forward and then return your head to the right.  3. Try a Glycerin Mask  4. Egg It  or milk, a tablespoon of lemon juice, a tablespoon of honey, and several drops of peppermint essential oil. Use a mixer if needed so that it is mixed thoroughly. Apply the mask with your fingers on the skin and neck area. Let the mask dry on your skin for 30 minutes. Rinse the mask off with cool water so it doesn't cook on your face. A daily application of the mask can rapidly decrease your double chin. 5. Melt your double chin with melon.  Any type of melon has positive properties that tone and refresh the skin. Its high water content helps flush out toxins in your body and aids in weight loss because it makes you feel full sooner. Extract fresh melon juice with a juicer and apply it to your chin and neck area with a cotton ball. You can combine apple juice with the melon juice as well. Leave the juice on for 20 minutes and then wash it off.  without having to resort to surgery. Not only is surgery expensive and risky, you might have the same problem again if you remain sedentary and don't watch what you eat.  you"
}