{
  "video_id": "FvrfhLwR3TM",
  "transcription": " Hi, this is Gloria Coppola and today I'm going to demonstrate some isolated fascial release techniques along the cervical spine. So join us, thanks.  I generally like to come down low where it's wider into more narrow. I'm going to place my fingers in these spaces. I'm going to feel the tissue. I'm going to go in slowly until I feel the resistance. I could do one side at a time or I could do both depending on whether or not the client can take both sides. I'm going to choose to do one because I can feel how tight she is right in this trap where it's inside.  I'm going to keep sinking in with my fingers. I'm going to follow it in. I'm going to be real close to the vertebrae.  I want to take my time and allow her body to do the work that is necessary with the added pressure that we have put on her.  Slowly move it up. Describe to them what the pressure is like and where my finger is located in reference to your spine.  Sometimes it might come out laterally, that's because that's what the body wants to do. I'm not doing this, that's what we have to understand. We have to understand that once we engage and feel the tissue opening, we want to follow it where it's moving. I'm coming all the way up to her occiput.  I'm taking my left hand and I'm bringing it down to like C6, C7 in that region. While this one is up here just kind of hanging at the occiput. I'm going to engage again with the tissue. I want to feel for that resistance. I'm just going to hold and wait and see where it needs to take me in order for that space to open up. Notice how her head tipped to the one side.  She's pulling me in down here slowly. I'm just hanging out. There's not a whole lot of movement yet going there. This up here, it's not moving any more superior than what it's doing. It's going further into the tissue now, more depth. You feel that? You okay? So you want to check in with your client and be  and make sure they're okay with where you're going. As long as you don't push to try to make something happen, they're usually okay with it. You notice how she said she didn't feel like it was deep? I'm deep. Okay, but if I had pushed on her really fast and her body didn't accept it, it would have felt painful and deep. Okay, the finger on the left is very, very slowly starting to move, not as quickly as this side did.  The right side is starting to move laterally a little bit now. And if you could only focus on one side at a time to start, that's fine. Any questions?  on  So do you want to make sure that you wait for it to release enough to get it even on both sides? If you have time to do that, yes. And what I'll do is non-verbally communicate with the body. Let's say I'm hanging out here four and a half minutes and I'm looking at the clock and I'm realizing this person wants a full body massage, I've got five minutes to do this, I have 55 to do the rest. It's not happening. I'm going to say, okay, non-verbally.  You have 25 seconds to do what you need to do because I need to move on. You will be very surprised what the body will do. Her left side is starting to come up superior. Right side is actually starting to expel me off of her, push me off of her energetically. So I'm just coming off really, really slow.  MassageProCE is a continuing education provider for massage professionals. Check out my website and see if there is a class coming to your region or a host one. Contact me for details. Thanks.  you"
}