{
  "video_id": "FywjLQRju7Y",
  "transcription": " Just as you enter Kodakachi and pass Plaza del Sol with its striking metal sculpture and with the breathtaking Mount Mbobura over your shoulder, you arrive at our two-bedroom,  home in a mini community of three homes. The home is at the back of the community furthest from the street and traffic noise. Having the largest porch of the three homes, it's the perfect place to enjoy a cup of coffee or a meal and take in the year-round spring weather of Kodakachi. The yard is fully landscaped  and the right side yard has a small storage bodega and the first of the home's two hot water heaters mounted on the wall. On the opposite side of the house is a second bodega and the other water heater. Across from the porch, branches from an avocado tree grow over the wall from the adjacent property with avocados within arm's reach. From the air, you can see three large skylights directly over the great room, providing plenty of night  natural light. Large windows and vaulted ceilings add to the home's warmth and open atmosphere. On those occasionally cool Kodakachi mornings and evenings, the living room fireplace is the perfect spot to relax and take the chill off.  The vaulted ceiling carries through to the kitchen where a convenient breakfast bar provides a great place to catch a quick meal or entertain. Plenty of storage is available with ample above and below counter cabinets.  The corner gas cooktop is inset in the granite countertop with a below-counter oven. The home is being sold fully furnished which includes all major appliances as well as the microwave, coffee maker, blender, pots, pans, dishes and much more, not to mention the washer and dryer. A walk-in pantry adds plenty of additional storage.  The hall cabinet gives you room for coats and can double as a linen closet. The social bath is conveniently located between the living room and the guest bedroom. The large guest bedroom will make visiting family and friends feel right at home. It features a large built-in wardrobe and stand-alone dresser. Its large window looks out to the front porch.  Heading across the living room, you see the double hardwood doors to the master suite. The master bedroom is a beautiful private space with a hardwood vaulted ceiling and plenty of large windows. The adjoining master closet features loads of space with both rods and built-in drawers and shelves. The master bath features both a tub and shower, and the skylight lets in plenty of natural light.  light on those sunny mornings in Kodakachi. Are you looking for a turnkey two bedroom two bath home in the Kodakachi area? One with great spaces to relax both outdoors and in? Something affordable in a small community that gives you plenty of privacy  and without the HOA hassles found in a large complex? If this sounds appealing to you, then call today to arrange a viewing before this charming move-in ready home is gone.  you"
}