{
  "video_id": "H7IlUr2ef_o",
  "transcription": " Next Level  And goalkeeper Jens Lehmann will be Germany's number one at the World Cup finals. Electric atmosphere inside the Stade de Paz. And on this perfect Wednesday night for football,  We're ready to go. How can Barcelona, a club of such iconic legend, be able to... The Ivorian... And what a chance! And he's in! Oh, he'll feel the uphill score from Arsenal. A very small... ...investing itself, and here's Henry again. And his tail's up, and having a good one as well. And forcing another fine save from Victor Valdes. And he's doing well to win it back, however. With a bit too late, from a desperately difficult angle.  From various angles from various distances and here is the world player of the year Always drifting wide the only look remains. Campbell and Gilberto have gone forward. Fabregas with the delivery. And the difficulty dealing with that one. Barcelona goalkeeper Victor Valdez. It looked as though he was getting pushier. Just north of Paris. Ronaldinho. It's the perfect ball for Metal. And Lundberg being in charge.  It's got to be in, it's a goal by Julie! Well, Lehmann with the infringement just as that was developing, it's not going to count for Barcelona. And this is controversial. Tell you how Emile Eiselfeld and Rene Saarinen came out with it, it had to be. I don't think Tell You Howgate, in all honesty, had any alternative. And Jens Lehmann's Champions League dream has turned into a nightmare so early in this match.  still have to score a goal and Nunez is a pretty good keeper but you certainly never want something like this to happen. The problem for a keeper is this is so straight on.  Don't forget to subscribe Like and share  Now that's another 45 and up at the time already let's watch Deco possibilities here  Ronaldinho again  I think I just saw a bolt of lightning.  Victor Valdez, who's had so little to do, rolled into a... That he should have gotten for the other tackle. This one, he gets the ball. Here's Henry, and he's through here! Thierry O'Reilly! Victor Valdez! ...before this Champions League final is over. Ronaldinho for Barcelona. Oh, very nearly shaving the post. Oh, Henry should have put the ball away and... ...away from Julie.  Don't forget to subscribe like and share  Now here's Ronaldinho. Larsson brings so much experience and know-how to the cause.  The Champions League final in driving rain now here in Paris has been completely turned on its head. Is that the goal by Beletti that will clinch... And they finish this final with a flourish. Beletti, Gilly and the European Cup as it was previously known before this season. But they've won in 2006.  Shearer, Casalhanjoi, Barcelona are the club champions of Europe. The defeated manager. It's Barcelona's Champions League.  you"
}