{
  "video_id": "HAzVuNdlank",
  "transcription": " Hey guys, welcome back to my channel at Shannon Ashley here. So I wanted to kick off fall with a fall glam Look, I'm gonna show you guys how I got this smoky ish. Halo I use my morphe 350 palette to create this look and I'm so happy It's just a one palette tutorial because I hate digging in multiple palettes to create a look So this is definitely a tutorial you could follow along if you have the morphe 350 palette as well But without further ado, let's just get right into this video Go ahead and give this video a big thumbs up and hit that subscribe button and let's get started  Alright lovelies to start off this tutorial we are going in with our revolution pro hydra matte primer I said this before in a different video, but I honestly think this might be a dupe for the Fenty primer But anyways different video for a different time now I'm going in with my L'Oreal full cover concealer to cover up my hyperpigmentation And then I threw on a little ginger snap on my lips so they would be a little glossy so also  the  I  eyebrows halfway done before you start to apply eyeshadow. Speaking of eyeshadow, we're gonna get into that Morphe 350. I'm just going in with this shade as my transition color and just really going to take my time to blend it out and blend it. My time to blend it out and build it up. So this takes time guys. I'm gonna leave it in for how long it takes just because the internet makes it seem like you can do this in three seconds or 20 seconds and the fact of the matter is you need  time  this  then  Next we are going in with this super dark glittery shade. It's like a super dark brown and this one again We are going to be building and building and building and building up. I find that with my darker skin it made I get that super Deep dark look I have to really take my time and build and build and build and build So we're also going in the corner of the eye as well because like we said this is gonna be a halo kind of look so yeah, just take your time  guys build and build and build and build and build again and again and then now I Sprayed my brush and I'm going back over in the middle with the gold So this is what the eyeshadow looks like with a wet brush And just take your time and blend and blend and build Next I'm just gonna take my kabuki brush to wipe away any extra eyeshadow and powder and then I'm grabbing my all May foundation and I'm going to be actually using a brush and not a beauty blender this time to  Blend out my foundation. We're gonna go through this quickly because you guys have seen tons of foundation videos If not, I have a whole playlist of them for you to check out So we're just gonna kind of go through the foundation and the concealer application really quickly Just make sure that you're taking your time and blending it out as much as possible Using my Rimmel stay matte concealer and this time I'm actually going in a little more on my nose just because I want to make it a dramatic look so we are actually adding  all over the place just because I want this to be kind of like a real fall glam look and then I'm gonna be taking the beauty sponge and just blending everything out except for underneath my eye underneath my eye I'm actually using a concealer brush to go ahead and blend it all out and then going back in with the concealer right in the middle of my nose and taking that same concealer brush to blend out the  Highlight contour whatever you guys want to call it blended that out speaking of contour I don't know why my camera got blurry here, but adding some dark brown powder to my cheekbones and then also some blush And then going over my the bridge of my nose with the same powder and my forehead just Taking my time and adding it all over blending it all out with the brush and now I'm actually adding blush if you guys guessed  Elf always spicy you are correct. That is what I'm using and then from that same black radiance pad Palette I'm gonna take the highlighter there and just blend it out. It's gonna be super super subtle. So just keep it as subtle as possible  Alright guys, we are just about finished with this look I'm feeling like this lip combo isn't really doing it for me So I'm going to add a lip gloss on top do our mix strictly vinyl just to add a little pink to it  That is so much better. Now I'm just gonna finish off with some powder. All right guys, this is the finished look. I hope you guys enjoyed this little fall glam. Let me know what other palettes you guys want me to use. I will drop the other palettes I have down below in the description box. I hope you guys enjoyed this and I hope you guys are getting excited and ready for fall. I will see you guys in the next video. Bye.  do  do  do  you"
}