{
  "video_id": "HcGa_j-YDmw",
  "transcription": " I think one of the beauties of live football has been that it's made it like a mini cup final.  television  The Hammers regulars are here to see if their team are going to go top of the table. The winners here this afternoon go top of the Canon League above Liverpool. And United fans, those loyal fans, are here in force as well. All building up to a cup final atmosphere, North v South. And with me as always, I'm delighted to say, I have Jimmy Greaves. Jimmy, who's got the predicting fairly spot on so far on the old ITV Big Match Live, haven't you Jimmy?  How do you see this one going? Well, we haven't done too bad, I suppose, Jim. It would be easy, I think, to sort of look at the home side and say, well, that both sides are in form. But you'd always go for the home side under these circumstances or possibly a draw. But we'll be bold, James. We will go for an away win. Manchester United. Bold prediction. I think you've been out on the old pitch, haven't you? Yes, actually, I went out on the pitch earlier on, about half an hour ago in actual fact, and played a nice little one-two with Arnold Mürren.  ball is skipping along very nicely. It's a lovely surface out there. It makes for good, fast, open football, generally. Should be a real cracker. Are you a bit surprised to see Hammers where they are, right at the top of the table? No, in actual fact, I felt that they would make the going very tough for everybody else. I said until the new year, and then Hammers tend to traditionally die down a little bit. But who knows with this side they've got now. But certainly not surprised. Certainly not surprised to see this type of match here today.  OK, Jimmy, thanks very much. We're going to cross to the far side of the ground for our regular commentary team. Ian St John, our expert, alongside your match commentator, Brian Moore.  of  that believe in so much attacking football, some interesting strikers on show as well. Garth Crooks is one of them on loan to Manchester United from Spurs. This is his second game for the United club. And it must be a delight for him playing alongside people like Frank Stable in 13 goals this season, including a hat-trick last week against Watford. And how do West Ham reply to that? They say Dave Swindlehurst, 11 he's scored this season, including 5 in the last 4 games. Well, as you've heard, a tremendous atmosphere.  and even now there are people queuing outside to get in. And the promise, I suppose if you looked at the season, the fixtures throughout a season and could pick the top half dozen of any season, then West Ham, Manchester United would always fall into that category."
}