{
  "video_id": "hD8dVO3LORo",
  "transcription": " I've been a resident in this area all my life. I was born here. I continue to live here with my wife and children. I remember 75th Street as a busy, thriving neighborhood where businesses flourished, nightlife, social  life shopping up and down these streets and we never had a problem. I want to see that occur again. This is so important for people to see that the community that they live in can look like other communities that they dream about. I literally had someone say that it's a miracle. It's it's kind of odd that just putting some tables and chairs out  would constitute a miracle, but it really does lend to the fact that little things matter and change is important. People are outside walking around like I'm noticing more people traffic. I mean the vibe is just different from typical.  on 75th Street for the last 17 years. And so when I get to see something like this, it's very exciting. I know this Brown Sugar Bakery. Some nice cakes and desserts that's in there that I'm going to come back and try. So it's a really nice event. I got a chance to walk around and meet a lot of people. I learned a new term through this process called activating the street. And I feel that that is what we have done. To be able to sit in my neighborhood at a patio and have a server come out  and give me a delicious drink and wonderful food and to talk to people as they walk up and down the neighborhood, I felt that I was in a full-service community. And it brought tears in my eyes because I didn't know that I had missed that, but I had. It's so pretty outside. People want to linger. When people linger, they shop for  more, when people shop more, there's more economic resources for this community. I shouldn't have to go to the north side to hang out and have a drink and dine on the sidewalk. You shouldn't have to consistently seek services and resources outside your own neighborhood. I don't care who you are, what your background is. So to see this is amazing.  It's slowing down traffic, and both the car traffic and the people traffic. So today, people are getting to know each other that normally would just be passing each other by. That is how you really build a strong community because these people are outside exchanging ideas.  I'm really happy that we're doing this. I want to see more of it. We want to make sure that we fill up all of our vacant storefronts. I've been out here just today and talked to people that live within two blocks from here that have never been to some of the businesses here that you've all come to enjoy the last few days. So that's a big thing for me. And that's a big thing for the neighborhood, for them to get out their houses once again and feel comfortable and safe about coming in their community.  Come on, boys! Come on! Come on, boys! Come on, boys!"
}