{
  "video_id": "HEdfuB_fXXM",
  "transcription": " Hey you guys, it's Christina and we are on day 6 of the Fully Raw 21 Challenge. 21 meals, 21 videos, 21 days and giveaways. Today I'm going to show you my Fully Raw food haul or what I have in my house to get me through the week. If you're not already registered, sign up for this free Fully Raw 21 Challenge by clicking  clicking in the link at the description of this video. I'm sharing 21 meals and 21 videos in 21 days, and I'm encouraging you to eat just one, just one, Fully Raw Meal a Day. Everyone who signs up for this challenge and who participates daily by commenting on all the videos and liking if you like them, will get a free e-book from me at the end of the challenge and a coupon code for 10% off items in my online store, rawfullyorganic.com. If you sign up and participate, I'm automatically throwing you in a huge  huge pot for your chance to be one of three winners to get a Vitamix blender, a year's worth of free water from Evermore Water and even a Kuvings slow juicer. That's insane! Please click on the link in the description of this video so that you can sign up. Okay, are you ready to peek inside of my fully roused stash space? That's what I thought. Not that I want to freak you guys out or anything, so I'll just preface this video by saying  that I totally stock up my house with fruits and veggies galore weekly. This is a total haul. Don't ask how I carried it all in. I eat fruits and veggies every day and my family does now too, so that's pretty much what I have here. Keep healthy foods in your home and you will eat healthy foods. Prepare to plan or plan to fail. Also keep in mind that I have so much food here because fruits and veggies are naturally lower in calorie than cooked foods. So I've learned to eat  more  so that it can ripen properly and so that I'm not eating unripe fruit. If you guys need tips on how to properly store your produce so that you get the maximum life out of it, please check out my video called What's in My Fridge and that teaches you my easy raw food storage tips. I've written the full list of what is in my home at FullyRaw.com, so if you're signed up for the challenge, you will see the list there as well. Alright you guys, are you ready? In my house, I have  I love cherry tomatoes! And I use them every night in my salad dressings and my salads. I have a case of freshly picked local Texas oranges, 25 local Texas picked grapefruits, about seven cucumbers, and a whole case of zucchini. And I love to make noodles or zoodles as shown in my other recipes, and they're pretty popular in my house. I have a case of bananas, and we just need to mix it all together.  We use those for our smoothies in the mornings and for lunch. During the summer, my house is usually filled with watermelons and peaches and nectarines. But since it's winter, I have a serious abundance of persimmons, dates, dried mulberries, strawberries, blackberries, and apples. I have a few pounds of locally picked pecans, some rainbow bell peppers, and other meal brighteners like fresh herbs of basil, mint, thyme, oregano, a few beets,  Six pineapples, five to six avocados, two to three heads of purple cabbage, about three to four green onions, two heads of celery, two heads of cauliflower, and about five to six mangoes. I eat a ton of greens, around three heads a day. So here I have about 12 heads of kale, 10 heads of romaine, some collard greens, some celery. Yeah, I know, I'm like the Incredible Hulk. Don't judge me.  Fully Raw Popeye, hashtag Fully Raw Superwoman, baby! This may sound funny to you, but this really isn't that much food from my house. When my siblings are over, we even have some more. This is how much I and a few other people in my house need to feed ourselves eating a primarily fully raw diet in a week or a week and a half. I've been fully raw for nine years and everyone else in my family has come to eat about 80% raw and share this healthy lifestyle with me.  I also have my Fully Raw Juices. Many of you may not know this, but I have my own juice company here in Houston and we sell these fresh, cold-pressed, raw and organic juices at my organic produce co-op called Rawfully Organic here in Houston. I'm currently working on a big project that will allow me to sell these juices not only in stores, but also have my own home delivery service. So if you're interested in that, definitely stay tuned because I have some exciting things coming.  Looking at this stash and thinking that is a whole lot, think again. One of the biggest tips that I can give you to help you save money is to buy in bulk and buy by the case. It will make your life so much easier. Buy locally as well. Seasonal is always fresher and less expensive. I get all my produce from my Texas-based co-op called Rawfully Organic that I was just talking about. If you live in the Texas area, definitely check us out at rawfullyorganic.com.  if you want to get some really delicious and fresh organic produce. While I get my produce from the co-op, I recently made a video called Eating Fully Raw on a Budget and I highly recommend that you check that out. If you're trying to save money while trying to afford this lifestyle, that video will help you a lot. Alright you guys, that is what I have in my house. What do you think? Are you hungry yet? If you have liked this video, please give it a like. And if you are participating in the 21  Fully Raw Challenge, please comment below and let me know what is in your house, what's in your stash. If you guys need more tips, tricks, or recipes on how to go fully raw, please subscribe here to Fully Raw Christina as we have fun living this healthy lifestyle together. If you guys want to follow me daily, see what I'm eating, see what I'm stuffing my house with, you can also find me on Facebook, Pinterest, Instagram, and Twitter, all at Fully Raw Christina. All right you guys, I'm going to go and start making some delicious food and I hope that you get to go and do the same.  I look forward to seeing you tomorrow on the next day of our challenge. Sending you all my hugs and my love. Yeah, baby. Do the dance. Do the dance. Do the dance.  On! Like don't you...  you  you  you"
}