{
  "video_id": "HgVegvv1HPE",
  "transcription": " With more than three quarters of the world's extreme poor living in rural areas, finding ways to improve their livelihoods on and off the farm is key to FAO's work. Here in Niger, these women, for the first time ever,  now have secure legal access to land and have turned it into a highly productive vegetable garden. It all started in 2010 when FAO's Dimitra program set up community listeners clubs here, enabling women and men to jointly take action to solve their problems. Thanks to the Dimitra club, now women and men sit together to analyze, discuss the situation and decide together. It's not like before when only the men met,  decided and told the women what to do.  to introduce better farming practices for better lives. FAO's work on melon value chains in Honduras has not only improved melon quality and increased production, but has also led to more employment both on and off the farm. Like here, FAO is collaborating closely with governments worldwide and other partners such as ILO to ensure better working conditions for this labour force. Promoting safe, decent employment and secure  incomes, with a special focus on youth, is central to FAO's work to improve rural livelihoods. Sometimes poor farmers are unable to turn their lives around without a helping hand. Delia Demisoni is a widow from Malawi. Her husband died of AIDS, leaving her with one child. She also looks after four other children whose parents also died of the same disease, and she herself is HIV positive. Delia now receives $14  a week through the government's cash transfer program.  can now afford to hire workers, providing more employment and freeing up their children so they can attend school. FAO is helping the rural poor to get better access to organisations and productive resources, more and better employment opportunities and conditions, as well as access to social protection so they can better manage risks. FAO is working to secure progress on all of these fronts.  you"
}