{
  "video_id": "HkAejSLGEUU",
  "transcription": " Kuro Media is here with Michael Murren, the successful coach of the PNG Hunters. You're the Intrast Super Cup Premiers. How does that sound?  full credit to our side, we defended our line really well, we didn't make use of the football we had but a proper defence got us through.  and eventually down the end I just wanted to touch the ball one or two times and work for a pitcher but eventually we got a try. The bounce of the football went our way so thanks for that. One of your big forwards, Willy Minogue, to be on the spot and sprint through and score that try. Did you ever think he'd be the match winner? I didn't think it was Willy. To be honest I thought there was someone else outside of him but he's got some speed but he was on the spot so he just had to do the right thing.  And what were you feeling when the video referee confirmed that try was it elation or relief?  So this is what we're gonna do and kick off some but yeah, and I you know, we go through Michael The crowd is really lapping this up and celebrating behind us. What does it mean to the people here to celebrate this with you guys? Yeah, I think for the fans here today I think you know, they they you know, they came all the way they came in numbers to come and support us But back at home, there'll be a lot of celebrations up there and I'll tell you probably people not going to work and you know, it's rewarding for the people that probably out of remote centers that  Now travel days to find a television screen to watch a game so you know for them They walk back home for one more day or ten hours, you know They'll be certified walking home so and yeah, and it's good for the country right now Just finally are your seasons not done with yet. You've got one more game in Sydney. You're off to the big dance How are you gonna get the boys back up for that after this such a brutal game? That's a another tough Ask again, but you know we will celebrate the victory tonight and go back home and  and go through the formal part of it. We're back into training, probably have another one or two sessions before we head on, but we'll be representing the country and the state down there. So we won't let the country and the Queensland Rugby League down. We've got enough troops there to carry us through next weekend. Excellent, mate. Well, well done again. Congrats on a tremendous victory. We'll let you go and enjoy it with all the fans. Thank you. Thank you.  You"
}