{
  "video_id": "hScEsh2A6GA",
  "transcription": " I'm representing for music  I think Ozare pushed himself beyond his boundaries and the limits he normally boxes boxed himself in so I think 2019 was actually a good year and as I said a year of enlightenment. Musically, we reached places that have never been before. My music has never been before, Uganda. My music has been in Ghana, playing like every single day. England has always been a platform or an avenue for Ozare music but it  it has grown in 2019. The US has been receiving and sending back feedbacks since 2019. So honestly, 2019 was the year and there's been bumps in the road because you know success is not necessarily a destination but a journey. So it's getting there. We're working on it now. We're in 2020 but we're still fulfilling some things from 2019.  There's no past here. It's just one continuous life. Oh, did Azari get involved in music? I get involved in music by like majority of young youths are artists from church. I used to sing a gospel song. Oh, a gospel song. I'm going to be honest, I don't know any gospel songs right now. Probably like  I'm not a consumer of music.  I  the same church and them always hear me a sing and them a say yo you need to learn to write and that's how I started to write music and over the years I've mastered, I tried to master the craft and invest my time in developing myself and singing and trying to own, own my craft and own my own, own my little thing you know what I mean and create this person, Ozarek. What Ozarek do for fun. There's no fun time. Honestly there's no fun time because time  is very expensive unlike currency for waste and squander time and there's no fun time I will kick around I will spend time I invest time in things so there's no fun time honestly Ozari is Ozari I'm gonna be honest I'm not trying to sugarcoat anything but I'm gonna be honest Ozari is a self-centered a self-driven a self-motivated  a person who tries to push himself beyond every limitation that people put on his life. Ozari is one who invest himself, 110% of his self in anything, even if it's volunteer work, even if it's just influence a friend. Ozari tried to put all his self in it.  You realize I'm talking to the third person. So this is all I have to come from myself to explain myself. Because Ozer is a very deep person, deep mentally. He carries this heavy heart. That's the reason why he sings so much love songs. That's the reason why it's so easy to connect with him.  I'm gonna tell you something  I think 2020 January morning, the 1st of January, I heard my friend, Bam Drina, in my head, actually in my, I was sleeping, and I heard Drina in my head say, Ma, you didn't say you have it, you have it in a regard, and you need to just push yourself and put yourself on here, you know what I mean? And I woke up, when I woke up, 2020, I think, I was still in that dream, and I said to myself, say, this year, this 2020, I'm gonna be the year of Ozari.  You see me? So it's gonna be the year where I'm gonna hear Ozari music everywhere. I'm gonna see Ozari face everywhere. So, Ozari 2020! Ozari! It's Ozari! There's nothing else. Ozari 2020. Yeah. Big money.  Please check me out on Instagram at OZDRIIMusic and iTunes at OZDRIIMusic and type all of my songs on where I'm Spotify, Deezer, Idol, YouTube, Facebook, Twitter, where ever you are. It's OZDRIII. Ozari, check me out.  Again yeah yeah, sorry again yeah yeah Some friend here yeah, dem fi stay yeah yeah, yeah yeah, fi stay ah  I'm  me and my news when I'm young Corona cuz mommy she never grown up"
}