{
  "video_id": "I4Lf310Zka4",
  "transcription": " Hello, good afternoon everyone. Welcome to my YouTube channel. Make sure you subscribe because today we have a very delicious meal. We are going to make couscous, Mediterranean food. Here we have fish. I have my diced onion here. I have diced vegetables which is the green and the red pepper. I have the champignon.  I have my ginger, I have my frying pot over here. So today we are going to make a very delicious Mediterranean food which is good for this weather. Here I have my fish, I seasoned it very well. I put two or three spoon of olive oil which I'm gonna put in the oven. I add ginger and onions over here.  My ginger and my garlic which I'm adding on top of the fish for the flavor. I have my basil leaf here. I have my great sliced onions which is there. So now we are going to start frying.  Add the onion and fry it. Very good and simple. It makes good soup. I like it, I love it.  Make sure it is golden brown.  I have the couscous already. We're going to add some green vegetables. It's very simple and easy to make. Please make sure you subscribe.  I don't know a lot of vegetables inside. Make sure it's just right.  of our champignon, which is the rosemary. You can see how colorful it is. It's very, very easy to make. Anyone can make it. You don't have to spend too much money to make this dish. This, you can use five pounds to make it, except the fish.  which you can use in a fish market. If you don't want to use fish, you can use meat. Or you use chicken. It depends on which one you prefer. Just make sure you stir. Yeah, this fish is ready. I have to boil it.  To cover it to make sure I put it in the oven It's ready I want the juicy of the fish so I foil it now. I'm gonna put it in the oven now pop it in 20-25 minutes  It's not difficult to make, just try it. It's very easy, anyone can eat it. It doesn't matter the rice, just fry it, it tastes good.  This is it. Then we add our salt and pepper, dried pepper. Thank you. We have our barbecue. Eat your other. Make sure you subscribe.  I want to add some salt.  I'm adding my chicken stock which I did before.  So now we are adding our couscous in. You can leave it for 2-3 minutes. It's not something that you cook for so long. Now we leave it to steam. You can see how beautiful it looks.  water not too much because we don't want it to be so sour we have also calam, mediterranean couscous because we have all the vegetables here all the nutrients  It's very easy. We cover it for a few minutes. And soon we'll have our couscous ready. Here we have the couscous ready. Finished. And here we have our salad. You can serve it with salad. And finish. Or you can use meat or chicken. You'll eat your couscous with it.  Thank you so much for watching my YouTube channel and make sure you subscribe. Very soon our fish will be ready and we will eat it together with tea. We can use it with steak, any type of fish or meat. Thank you my YouTube viewers. Give me a thumbs up when you finish watching the video. Make sure you subscribe.  Thank you. Bye, see you next time."
}