{
  "video_id": "I6xo-Pe3Ypg",
  "transcription": " We're all invested in this thing and you guys have an unbelievable opportunity right now to go out there and do what very few football teams get to do and that is be perfect. Let's go be perfect.  Oh boy.  written on their cards. I mean, we talked about it every time we broke down at the end of a workout. It was the theme. To accomplish that task was just exhilarating for me and everyone on the team. I just so badly wanted to win this for you guys because you deserve it. The guys are a little sick in a really good way. Some of the workouts that we do in our off season and our summer months are definitely extremely challenging and definitely put them through some hell at times and they're always coming back to the front.  so  The spot light back squat max was pretty much our culmination in my report to the guys for having a great offseason, really past two years great offseason.  It's something that I've never seen actually get done, but lifting and our max outdays, any time I can give an experience and get the energy up, I'm down for it. And I thought that would be a great way to do it. And I had no worries about it going wrong. And it went better than I could imagine. Combine something we do at the end of every school year, just got it within our NESCAC rules that we're allowed for on testing day.  Last school year we just did a basic NFL style combine, 225, some broad jump, vertical jump, 510, 540. And then this year we did all those again and we added in the max squat days. Something different that we do with our football team here is we'll draft the teams. We'll take six of the upperclassmen and we'll do a full draft of the entire team. And there are six competitive teams and the entire spring semester we're trying to knock out usually about one competition.  additional week that could be in a speed and agility session, more on the left. And then they're just battling all spring long. Keep things fun and interesting with the big volunteer as well. Getting into like small car crashes, you could say, in the middle of a season every single Saturday. So it's an off-season period. We're basically trying to put as much body armor on the guys as possible. So expose the week was definitely one of our big mottos this spring and I hope that continues on. We're trying to expose the week routine basically come next season.  Hardest workers, I'd say the number one that pops out is our running back, Max Jaboros, Chip. Kid is just a silent warrior, comes in, puts up huge numbers, just constantly getting stronger. Pound for pound, without a doubt, the strongest athlete I've ever coached and probably ever will coach. I'd say another one of our hardest working guys, Nick Rose, is another one of our sophomores, defensive lineman. I think Kid has definitely got a couple screws loose, but in a really good way.  I don't really see anybody putting in the amount of work that they need to put in.  of time and effort that he puts in. Steve O'Reilly is a class clown, everybody knows that. Something that you might not really expect to see with a ball team or a team in a bigger room is the guys just have a lot of fun. We've got guys that are basically animals slash clowns like Steve O'Reilly who squatted 600 pounds at our Max Outt a couple weeks ago.  We got guys like Johnny Medina that are just keeping it loose. You saw on the back squat day, he just started dancing after he hit a PR. We got a lot of guys that keep things loose, they have fun.  I used to get extremely angry at what kids would be dancing at the World War Cap, but now as I've kind of evolved as a coach and I've realized that that's good energy and that's going to get guys really excited about being in the room, I'm all for it. We've got a lot of guys on this team that just bring that high energy and positive energy and keep things loose as well. Hopefully this will be a yearly tradition for us. This is the first annual fucking  Spotlight Maxx out everybody. Let's burn in, let's break it down. One time for Coach Lewis. Me, I love the guys with all my heart. I'll do anything for that. They're really the hardest working group that I've ever worked with in my entire career. 1, 2, 3, NININGHOLE!"
}