{
  "video_id": "ICJXXGd8ZOc",
  "transcription": " You're so nervous, don't move. We're live! We're live! We're live! We're live! We're live! We're live! We're live! We're live! We're live! We're live! We're live! We're live! We're live! We're live! We're live! We're live! We're live! We're live! We're live! We're live! We're live! We're live! We're live! We're live! We're live! We're live! We're live! We're live! We're live! We're live! We're live! We're live! We're live! We're live! We're live! We're live! We're live! We're live! We're live! We're live! We're live! We're live! We're live! We're live! We're live! We're live! We're live! We're live! We're live! We're live! We're live! We're live! We're live! We're live! We're live! We're live! We're live! We're live! We're live! We're live! We're live! We're live! We're live! We're live! We're live! We're live! We're live! We're live! We're live! We're live! We're live! We're live! We're live! We're live! We're live! We're live! We're live! We're live! We're live! We're live! We're live! We're live! We're live! We're live! We're live! We're live! We're live! We're live! We're live! We're live! We're live! We're live! We're live! We're live! We're live! We're live! We're live! We're live! We're live! We're living! We're living! We're living! We're living! We're living! We're living! We're living! We're living! We're living! We're living  You know who you're going to vote for. The youngster from the village, with no beard or mustache, and the village headman. Sorry, brother. No need to apologize. Get out of here. Go and see your uncle. Friends, you know you're going to vote for Gurinder Babu. Read the poster. Read it. Read it. Read it. Read it. Read it. I'm going to vote for him. Read the poster. I'm on the phone. Stand up.  No, I was watching your video. The video you made will affect our college. No, little brother. It will show our fear. It will show our greed. It will show how much our college is in a bad shape. Got it? Yes, sir. Get lost. Okay, listen. Yes, sir. Here, read this. Count all the three numbers. Get lost.  Yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah,  In association with the streets Black gangsta Real shit  Oh  I  We cut the work on the side of the head. Our stick is not like that. People do not do this on an empty stomach. Our stick is working, we do it.  Your style of living life, doesn't let you sleep at night. You're like a wild animal, you don't let me sleep. Where you work, you're a robber. You make millions without money. You're a robber, you rob.  I  Tell them how the world is weak How many leagues have you played, how many weeks have you played? Hey, you, the son of a moustache He's just jealous  for"
}