{
  "video_id": "IWquNO7pJ_Q",
  "transcription": " I'm Jessica Honiger, founder and co-owner of Noonday Collection. Noonday Collection seeks to use fashion and style as a vehicle to create opportunity and change for vulnerable communities of people in order to help them and their families rise out of poverty. And the first group that we ever began purchasing from is this group that you see right here.  It began with Jalia and Daniel, just an amazing, talented couple who really has a vision to see change come to their people.  they can sustain themselves through life.  from broken families and that makes everything very hard.  our hands to earn a little income to support our families. So it all began with the help that was given to us and the work that was given by Nundi. I'm really very grateful that I have a job today because in Kampala it's very, very, very hard to get a job. I'm just so happy that I'm here in African Styles Art Company.  working for them because of no day. I would be on the street. And just being blessed with the job is really a big privilege to us, to me. We really target people who are unprivileged, people who don't have any experience, people who need this job. And our desire is that we see these people change. When we look at them,  identify with them because we went through those kinds of struggles and we were empowered by Nyunde's collection. When you have been helped and God has seen you through a situation, you kind of identify with people who are going through the same situation that you had been in. What Nyunde has done for us, they have not only given us fish, but they have taught us how to fish.  In decoration, I can support myself. I can support my family. I thank you in decoration. They have empowered us and taught us that you can work and you can come out of this. The more sales and the more purchases our customers make, then the bigger this business here is able to grow, the more income opportunities they're able to provide to their people.  able to create pathways out of poverty for others in the countries where we purchase from. When you buy L'Oreal products, you are changing lives."
}