{
  "video_id": "IyM5C_selCk",
  "transcription": " At what age do you lose your virginity? At 14 14? Yeah Is that like the perfect age? Nah, the perfect age would be 12 I think Introduce yourself I'm Golisle Solonbela I'm from Ocelone So the first question is  Do sexual intercourse matter in a relationship? Yeah, they do. They do? What? Does it? It does. Why does it? Because if there's no intercourse, then why do you have a relationship? Okay, at what age do you lose your virginity? At 14. Oh my god! Wow!  Yeah, is that like the perfect age? Nah, perfect age would be 12 I think Yeah Most of my friends say 12 12 12 I was the only one left behind but I was like okay I had 14 Okay, so the first question is that sexual intercourse matter in a relationship yes  I don't know. I don't know. It depends on the partners. But it doesn't matter for you? No, it doesn't. Okay, the next question is, at what age should you lose your virginity? 21. Probably 18, 19. 19 for guys.  Okay, next question is... Your guy is cheating on you. You're cheating on your guy. You walk into this scenario, what would you do? I'd probably take a seat. And I don't know... Probably walk out. Last question for you.  Size or stamina? Size. Size matters. Why size? Wouldn't you like go longer instead of... What's the point of going longer when there's nothing going on? When you can't feel anything. You must feel something.  Why? Why doesn't it matter? Isn't there something that people can offer besides sex? What the f*** is that? I feel like it's a bond there. I just... I don't know. So it doesn't matter? It does and it doesn't. It's a 50-50 side depending on what side you take it from.  Oh God, I don't know kids nowadays fucking lose it at 14. Okay that's a tough one, I don't know. I don't know. Take a guess quickly. A guess? He was grade 7. No! What did I do? Why would I do that? No, that was him. Okay, and what age is he? I think maybe 16, 17. I don't know. Okay, what age did you lose your virginity? Oh shit, I can't remember.  So you said great team? Why did you lose? He's lying. He was grade 10. I'm going to expose you right now. So this man, nah it's fine. I'll leave him for another day.  I'm Kyawaris I'm Sarah Wheatland Okay so the first question is the size matter? In terms of? In terms of? What do you think?  She wasn't ready. She wasn't ready.  16  I'm Tinikwa Shungwane. I'm Samgela Koza.  Okay, so the first question is does size matter? Size of what? What do you think? Size of what? The male organism. Does it matter? Yes it does. And for you? Yeah, it does.  Simple. Second question is, at what age would you lose your virginity? 21. Why 21? 17. And you? 17. Why 17? I don't know, peer pressure. Peer pressure. Okay. At what age did you lose your virginity? 21. 17. 17? Yeah.  I feel so... Introduce yourself My name is Kuti Okay, so the first question is... How long are you willing to wait to have sex in a relationship? Yeah... I just feel like it depends on the vibe But how long are you willing to wait? As long as I can How long? Like as I physically can  Yeah.  What is this for? My YouTube channel, like asking South Sikkim Avenue and old people weird questions"
}