{
  "video_id": "J34pE6PKZPY",
  "transcription": " My birthday is tomorrow Good morning, y'all it's my birthday today And like I woke up freaking late But I don't care. It's my birthday. So this is what I'm wearing Orange top. I got this top from Walmart. These pants are from Hollister And then my shoes are from Foot Locker. So hey guys, so we just finished geometry  We have seven minutes left and the lesson today was easy. It was easy, you can lie it was. It was easy, I must think sometimes it be hard because I don't be getting stuff because I be slow. So we're in second period.  He just  I got it, right  Follow me a bubble 5k  I like the likes and all the beautiful things  What did you what did you baby? Thank you, I'm gonna go to soccer yeah, yep, you're gonna show out. Yeah, not really Me too, but okay, so Hazel making me go to let you have  Are you? I'm hungry. I don't got no food today. I don't got nothing. Follow me on Instagram. Curlyhead Armani. Hit me up. I'm single. Just kidding.  Gonna get a snap from the vending machine. Yeah, no, what do they do? DBS is in my chain. I can't get it down. Hey Get like me  Hey y'all. They're all sold out. Really and I need a drink. They not trying to make big bank off of me. That's stunk. Is that water? Hi, I'm Jillian. Hi, I'm Sarah.  Yeah  Daddy, I owe me be the power of a room. Yeah, we're Spanish  Hi guys! She's putting zeros for everybody.  My quiz  I'm going to be over in one minute. Say bye. Bye! I'm going to be single. Get out of here. I'm going to be famous. Wait! I want to see the pictures we're going to upload.  because I don't care, because my life is worth it  But you can wear jeans today if you wear orange and I'm wearing orange  My outfit's not bad and it's appropriate so I might just wear this So yeah, I headed to church Sadly I say sadly because I don't want to be here on my birthday Right, mom? Yes I'd rather be like out on a dinner which I couldn't have today because of this like I know, but it's mandatory For you, not for me  me as a mother for you as a mother it was mandatory but not for me so I had to come yeah I posted a new picture on Instagram make sure you go like and comment you already know and to who? new credits to you credits to mama bye guys"
}