{
  "video_id": "JnTLpi1uesU",
  "transcription": " What's up, it's Nteya and it's Nikita. Today we are back with another reaction video. Today's video is going to be Lore, Baby and Gunna close friends. Before we hop into this video, if you're new, you know what to do. Hit that subscribe button. Also, if you like the video, give it a big thumbs up and share it.  And don't get started to put it all the social media is one cute beauty YouTube channel links to exotic Magic week check it out here site and get you some her so you can slay all day for your baby Let's just have right into the video  I'm loving the red. Yes, I'm right on time. I know the candlelight dinner Hey, what's up with it right on time for Valentine's Day? Okay. Yeah, yeah, I did Yeah, news better step it up. I mean as you I'm going to Paris right fine I'll be out to flip the parents and holler back having dinner in front of the Eiffel Tower  So he missed the old her like when they first met like she was like a different type of person Because you know after all the bullshit you can only put up with so much bullshit before you start to change on these niggas, right? And it's different from when you're like friends and then when you're actually in a relationship cuz you expect more. Yeah period  I  He's admitting that he actually fucked that bro. Yeah, I'm dirt I always expect for women to take them back like they really do is like when women stop taking y'all back Which I gonna do and then you try to like buy start buying stuff. Sure. I'm nice and doing all this Take them back right? It's like once we're in back together Are you gonna keep that same energy right or you're gonna just turn around and do the same thing? Okay, I'd let me know what's good What's good, but no, um dudes be like cheating  Then  They're both just like sitting like unbothered right and people have she had in the stomach  Right  Even though like if we don't work like you still got that Benz, you know, you're rolling around it but in the day like What's up with it? Right you know, I just want loyalty right? Is that too much to ask for? Yes  Yes, they'll slaying and pregnant pregnant and slaying period hashtag  That's like every baby like it really is like that's crazy, but that's Wow he did Put a ring on it and now like they're about to start your family. They might have a little son. That's right. What's up? That's You know you get Yeah, let's talk about this video any comments down below it was done like lit it was just like a shoe it's like  song he is actually admitting to his wrong and like you know yeah these are my confessions oh I sure would ask thank you all for checking out that video with us please do not forget to check out our description box down below it will link to all of our social media as well as the Q's beauty youtube channel we'll see you in our next video bye"
}