{
  "video_id": "JQFsBnNMa3s",
  "transcription": " Bookmakers have been forced to suspend the market on the gender of Meghan and Harry's baby after an overwhelming number of bets were placed on the royal couple welcoming a girl  It's yet known. However over the weekend Betfair received a flurry of activity betting on a baby girl and were forced to stop taking bets on the sex of the baby.  Betfair spokesperson Katie Baila said, \"'We haven't seen too much betting on this market for a while, but tonight all of a sudden we have seen a flurry of betting activity on the baby to a girl So much so that we've had to suspend the market and stop taking bets on the sex of the baby If the punters are anything to go by, then we could have a new princess in a couple of months' time  Speaking about the favourite names, she added, Diana is the 8-1 favourite, with Alice at 13-1 and Grace at 14-1 for the name of child In October Harry revealed his hopes to have a baby girl with his wife the Duchess of Sussex, during their tour of Australia  The couple announced their pregnancy at an Invictus Games event in Sydney. In a candid moment captured on camera, a bystander was heard shouting, \"'Congratulations, I hope it's a girl!' to which Harry responded, \"'So do I!' The couple could be permitted to choose a more unique name for their baby, as second in line to the throne Prince William and his wife Kate have already given their three children traditional names.  The royal family is said to be more parents to Prince George, 5, Princess Charlotte, 3, and Prince Louis, who was born in April Carolyn Harris, author of Raising Royalty, 1,000 Years of Royal Parenting, previously told Vogue Australia, the further down the line of succession, the more likely you are to have a more unique or untraditional name  It's not unusual when wife Meghan Markle gives birth in the spring of 2019, during a conversation with a well-wisher at the Invictus Games in Sydney in October as he helped a wheelchair user up a ramp The latest reports follow rumours that Meghan could give birth sooner than initially thought However during an outing to Birkenhead on Monday, Meghan told a bystander that she is due in April  Meghan was just two months pregnant with her first child expected in April as she chatted to well-wishers in the northwest town of Birkenhead during her and Prince Harry's first joint engagement of the year She also revealed the couple don't know whether they're having a boy or a girl, as they want it to be a surprise  The church is currently being refurbished. Additionally, recent reports claim Meghan and Harry are rumored to be taking their baby on an official tour of the U.S. and Canada in the autumn.  com"
}