{
  "video_id": "K33Si0yvnec",
  "transcription": " I  I'm not here to die  Oh  Nice, huh?  Thank you so much for making this available for these incredible artists. Where are you Nate? Nate and Clifton, Russell where are you? Don't hide. And Paul, behind you here.  At the moment I'm doing a show on Broadway which has been falsely reported as being a one-man show. It is not. Because there are so many people involved and can I tell you every night, no matter who comes to see it, everybody says to me the highlight of the show is the performance of these four. Where's Olive? Where are you Olive? Olive! So I hope you're hiding up there. Olive, come up here. Of these four. It is such an honour for me to have Olive Knight, Clifton Bindley,  Nate Mundramy and Paul Boone to share a Broadway stage with me. They have come, as many of you may know, hours and hours on planes, hours to get to airports, to come all the way to New York City to have their Broadway debuts and that's worth a round of applause, come on. Honestly guys, every night I feel completely blessed to have you there. You really make the show. And tonight here, however,  If I think I'm working hard, these guys come every night to the theatre and then all day long they are artists, as you can see around these walls. And they have been working non-stop, not only here, back when we were in San Francisco and Toronto. And it's such a great honour to share, for me, to be able to introduce the talents of Nate, of Clifton, of Olive, of Paul. And on the walls you can see their work here. It is extraordinary, it is like them. It is coming from a universal place. They are pure artists.  They work from a place of such integrity and such joy and I know many of you here are already started to be there is still just a few right Russell. There's just a few pieces still available So if you like to get a unique piece of Australian art they are right here on your wall so but right now would you just please join me in thanking and congratulating these guys for their work  And I told the guys they have to sing for their supper so right now you're going to get a special treat everybody.  I  Oh  Woo!  I  Cheers!  That was my..."
}