{
  "video_id": "k53NKmTcnZ8",
  "transcription": " Ladies and gentlemen,  Ladies and gentlemen, please meet the Nokia 800TUF. The Nokia 800TUF is the most durable Nokia phone ever made. And it has the longest standby time. Whether you're on the trail or on the cross-country side, the Nokia 800TUF can take whatever life throws at you.  You can submerge it in the water for 30 minutes. You can drop it from 2 meters to 3 floors. It's IP68 rated for dust and water. None of this of course is particularly impressive for the most reliable, most durable Nokia phone today. This is why we did only build the Nokia 800T to be consumer grade. We built it and tested it.  military standards. Now when I say military standards, I mean specifically the real STP, HMG standards. Now these standards have 29 test cases, out of which 13 apply for mobile. These include pressure, temperature, rain, salt, humidity, sand, dust, immersion, vibration and shock. The Nokia 800T passes all 13 test cases. These standards  This makes the Nokia 800 Top the perfect companion for your work site or for your violent adventure. We've also added anti-slip coating and rubberized edges to the design so you can hold the Nokia 800 Top with confidence. Of course, if you drop it, no harm done. We have also included a loop on the bottom of the design so you can loop it with a strap and a carabiner and attach it to your belt or your backpack.  To seal the deal, the Nokia 800 Top comes with the longest standby time of any Nokia phone ever. It will last up to 43 days. The Nokia 800 Top is built on iOS, comes with essential apps like Facebook and WhatsApp reloaded. Just like the 2720 Flip,  The Nokia 8 on the top can also act as a 4C flash button. When it comes to availability, the Nokia 8 on the top will be available in two colors. The very sensible black that I'm holding in my hand, and also the funky desert combo color that you can see on the display. It will be available in early October at an average global retail price of 109 Euros.  you"
}