{
  "video_id": "k_c5nUaK45M",
  "transcription": " Okay  Okay, let me say that again. Okay, okay, okay. Okay, so let's go. Yeah, okay. Where am I from? Okay, my name is Ronda. And this is Loic.  Okay, so what are the questions? What do you guys like in terms of the food? Yeah, what's your favorite food in Burundi?  Okay  What do I like? I'm the same, Akumunda is my favourite thing What is your favourite thing about your country? The beautiful girls What country are you talking about? Burundi? Both  I like the culture, I like that we're laid back. Yeah, we're very gentle compared to other countries. Yeah, very gentle compared to a lot of other African countries. I was going to say West. Yeah, honestly, we're going there. We had a good coffee. Oh yeah, the Burundian coffee is amazing. And tea! Yeah, and the tea. The traditional dances.  I love that traditional way. I feel like ours is elegant. We have culture. Yeah, ours is like elegant. Yeah, yeah, very, very elegant. Even with the moves, you know, they're like, you know. It's not... Yeah, it's not... Um, okay. Do you have a question for us? He's like, ha ha ha ha ha. Ask a question. All of you have to bring a question. Shibrook. Um... Come on. Oh. Does anyone ever think of moving back home?  I don't know  You know what I mean? Like our friends are here. For you, I think it's a bit different. Yeah, because you went... You live in Rwanda. You can always make friends again. Says the guy who left his whole family in Sweden. Exactly. So that's not an excuse to say, but I have my family here, my friends, but... So that's an excuse? You want to move to Rwanda? You live in Rwanda? I could see myself. What do you live in Rwanda? That's another story. Next question. Next question.  I think I would like to probably own property, economic wealth, you know, trying to build up our economy. Bring the tourism, that's what I'mma do anyway. I'm gonna impact on the tourism. So you wanna build an apartment, get a new travel agency, whatever? Oh my God! You know I'm studying tourism, right? That's what I'mma do! I'm bringing connection on this YouTube channel. Connection! When do I fit in? I'll be the blogger.  I want to get out of that. Anyway, what's the other question? Those were your questions. You didn't say it. Oh, yeah, yeah. I did answer. Yeah, me, I'll move back. Yeah, yeah. One of you have to ask the question. What would you say is the most Burundian trait that you have? Oh, I like that question. Because I don't know. That makes you Burundian. My forehead.  Okay, yeah  Nigeria  What's your trait?  No, no, no Kenyans. Oh, yes Okay, so do you say that that's your trait yeah like a good you like what's your trait that's a brilliant rate You do One last question I'll meet me to my height  I don't know. I'm just everything you know  Thank you guys for watching so you can watch these exact same thing yeah The link to my youtube channel be down below And you're watching it on mine and hers. Yeah, so go and subscribe to in my here's a YouTube channel as well Subscribe to on the line and subscribe to me  i have a youtube channel okay i will post someday i will get one too let us know if you want us to do any more content oh yeah to randa and brundi yeah and also like yeah yeah we'll show you our view right now yes"
}