{
  "video_id": "k_JR4R_4BQM",
  "transcription": " You know your insulin is like low when you you're fasting so what happen is you use fat as fuel so so you know you use intermittent fasting in that way and you will lose fat faster  What's good YouTube, it's your boy Liban and you know, I haven't uploaded some video in long long time  like 2 weeks ago, my last video. And yeah, today I'm gonna record my meals, my workouts and I'm doing right now a mini cut because I can't see my abs anymore so I have to cut a little bit. So yeah, when I start seeing my abs I'm gonna start bulking again. Yeah, so this is my pre-workout meal.  right now and I'm gonna eat this one and after that I'm going to the gym I'm gonna do some back and some back and arms today so so stay tuned  I'm hungry man So I'm gonna wait like 15 minutes then I'm gonna take pre-workout you know I mean pre-workout shake This is my pre-workout supplement right now One day they are gonna fucking sponsor me  One day, but right now I'm doing free free Product review so Yeah, by the way actually this really good pure cut and I'm gonna take this one right now and yeah Let's get one  So I take my pre-workout when I'm going to the gym and So the pre-workout should kick in about 20 minutes  so I warm up like five minutes sometimes I don't warm up I don't know why but yeah so so yeah see you guys in the gym  What's up, what's up? Today is bicep and back My first set is slap pull down So I do a warm-up set here Then I do three sets on every workout and the first set is gonna be heavy on five reps then  I lowered the weight by 10% then I do on the second set 6 reps. After that on third set I lowered the weight again 10% and I do 8 reps. Then I move on to the next workout and so on. So yeah and it is because I follow a program right now called  degree guide by KinoBody and it's really good program and yeah so the next workout is hand to rod same thing here first set heavy do 5 reps and then second set do 6 reps lower the weight again 10%  and  I don't know what this workout is called but anyway this workout is for the lats and I do again same thing 3 sets first set heavy and 2nd set lowering the weight you know same shit and here on bicep curl I do 3 sets  I try to do all the 3 sets 12 reps. If I complete that then next workout I load the weight by 5 pounds and try to do the same again. A great tip if you cutting do intermittent fasting because intermittent fasting is a  It helps you lose fat faster. And while you're doing, while you're fasting, try to go, try to be active. So your insulin is low when you're fasting. So what happen is you use fat as fuel.  Use use internet fasting in that way and you will lose fat faster  you"
}