{
  "video_id": "KE1RZcZvWMw",
  "transcription": " Well guys today is one of the proudest day of my life my daughter is graduating she's going to her prom tonight I can't believe I have a kid that's graduating my lord and man is she beautiful I know he didn't get any of it from this ugly mug but thank God for that I Gotta show you I you know what I don't involve my family family in the YouTube except the little one But I gotta show you guys how beautiful she looks tonight Wow Just tell those boys to stay over here. I'm gonna hurt somebody  Look at you. Come on, give us some poses. Well, I'm doing a video. Do you think this is you will only have this for this? They only happen once right now. Now you see what I mean? She is beautiful. I couldn't get a lot more footage because my wife and my mom keep getting in the way and getting in my shot and they don't want nothing to do with YouTube. So I had to cut a lot of it out. No matter how much I yell, get out of the way.  Everybody still wants a picture and a video but man she looked beautiful. I'm a proud man. I'm a proud man and I got one more on the way. Many more years to come and this one's gonna be a troublemaker but I wouldn't change a thing for the world. I hope she have a lot of fun tonight and wow, wow that's all I can say. The weather is getting good and it's time to get these cars looking good. And trust me, I took the wheels out and I'm like I gotta put these on, I gotta put these on. I already washed ceramic, what do you call it?  Hydro selects on the wheel. They're nice and smooth and clean and just ready to go back on and you know Every time I'm in here and I hear a humming that look is the wife coming down in the car and it looks good without the wheel just imagine how he's gonna look again with all the wheels on so Frank has to do his front and rear bumper because he tracks took the front one in the winter Someone had ran in the back of his car in the grocery store the other day and left a nice hole in the bumper But knowing him he has to have everything is a two front bumper and two rear bumper. Of course he does  If he didn't have to it wouldn't be Frank. So he has they're ready painted and ready to go back on So we're gonna put those on he's having some problem with one of his ear bag His ear bag sensor his crash sensor I should say and we're gonna put Change that one, too I'm gonna put the wheels on my car gonna put the wheels on the x5 and the owner is coming over for the m3 to clean it So we have a few cars in the driveway. So let's jump right into it We're gonna do Frank's car first and then my car  You'll see we're gonna be taking off is a raggedy ass bumper and We're gonna go You'll see much newer bumper with a lip and everything because you know, he took it out. Well, it got trashed over the winter Pretty boy coming up. Look at that So we're getting ready to put all the wheels on but first we're gonna wash that one  We're gonna wash this one and he's vacuuming and cleaning his and Frank's changing his front and rear bumper Like just a lot of cleanup have to go on before We put any wheels on  That's right  Here we go, they're finally ready for the summer. Not like I'm gonna get to drive it much but here we go and Mr. Man just put on  Don't worry, I'll stay and help you  but she is looking good with new LED fog lights and oh sun's going down this beast is clean for the first time since the year started and it's looking good just look at this thing oh my god it looks so good and sounds so good  Oh, yeah as mr. Man said Reflectors Mine was painted like you can see mine there was painted but he completely deleted his which which is much better next time I'll do mine and Now the x5 still needs to be washed but wheels are on spaces are on. Hey, yeah, why is your wipers off?  Tomorrow I'll clean the X5 but wheels are on again and man, she is looking good Just look at her Finally now I still have to clean it, do exhaust, a lot more stuff have to be done to it Everyone's clean and ready. I guess it's just a BMW thing Now it just makes you want to go cruise the street  as somebody would say let's go cruise the street i'm too hungry to go cruising what are we eating gentlemen they are finally done and man you can see yep they look good and man but guess what it's gonna rain i just spent all this time cleaning this wheel and trust me those m5 wheels get dirty real quick i don't know why they get so dirty so dish yeah they collect a lot of dirt and it's gonna rain the next day but what are you gonna do at least it looks good now  I just have the exhaust tip for the X5, I'm going to get it done and I'm going to work on the exhaust for mine. I can't wait to start something else, but that's a whole another story. That's going to be a slow build. Yes, it is. But like I said, you're just going to have to wait and see. But everyone's clean and looking good. What's next? You're just going to have to wait to see what's next. But just remember to like, share, subscribe. Like I said, guys, if you want to see this stuff coming,  give these videos a thumbs up you gotta share them you gotta like you know you gotta do all that stuff you're gonna help the channel grow that's the only way these videos are gonna come out a lot faster but I'm tired of saying that so that's it for now so laters"
}