{
  "video_id": "keHHPvqJLbM",
  "transcription": " So  Volkswagen always wants to be associated with their customers. The kind of people that were here tonight represented who we sell to on a daily basis, so they were our customers in the main. And it was great to see them either be nominated or win awards.  to be supporting it and to celebrate with them here tonight. This is our third year to sponsor these awards and we find it very beneficial. Everyone is here, everyone we want to be with is here and it gives us a good chance to give something back to the industry that gives us so much throughout the year. Our objective is to target the market that we're in and this allows us to have a nationwide target in one environment, one room, for one night and a lead up to it obviously as well. We've recently rebranded as the Urchin Group so this is an ideal platform for us to raise awareness of our brand and to  I suppose push it even further. Well, one of the main reasons that we decided to sponsor the award was to give something back to our clients and also to get recognition, you know, and get people to see even more about KPPM. So to be here tonight for KPPM is really, really important. This is a terrific event and we realise we need to be represented like this and it's a great brand building event for Crown Roofing. This is Dax's first year at the event tonight. It's been an absolutely amazing success. You know, we've met all the  types of companies and people that we wanted to meet and achieve from the night. I'm very proud that we did it and pleased to be involved in the evening. An awards night like this is great for the industry. It's great buzz about the place here tonight and great excitement and very positive. There's very positive people here tonight and it's just very enjoyable. We weren't expecting to win this year so very happy to win it. Very happy to win it. Great statement for the company. It's good for the whole construction industry to be out here sponsoring each other, pitching each other and networking  working together, it's really good. It's great to be recognised even though I find it awkward to just take recognition because I always believe that people work in teams and I'm much happier in that kind of environment. I've had a great career, loved it all so I'd highly recommend it. The excitement was great, everybody was behind us, all our team were behind us and they're very excited. It just shows people that McGrath and Kenny are back. The Irish Construction Awards  are an integral part of our business. You enter these, and to win these, it just shows to your peers that you are the best. And it's very big look up to others to join and get on with."
}