{
  "video_id": "kj5TLqhcD38",
  "transcription": " ♪  Welcome to the WP Group here on the south coast of the United Kingdom. The company started 50 years ago in 1963, but through acquisition our heritage with ExxonMobil goes back much further than that. The Elite Club programme is great. It really helps us focus on what's important to our business and not just what's important to ExxonMobil. We don't focus on winning awards but having got so close to them,  to the Gold Award in 2011 by winning the Silver and the EME Marketing Award for Mobile One. We really went all out to win the award in 2012 and so I was delighted to get that call to say WP was in fact Gold in its cluster for 2012. Mobile expects continuation on the same theme of best practice and I didn't really have to try very hard with my team to get best practice. They were already hard at it as soon as we won last year. We were helped by ExxonMobil  along the way with pointers as to where we needed to improve. Proof of performance was one area that we were falling back on and we got a tip off that we needed to be a little bit better at that area. Lisette is our key monitor of this. She's like the school prefect and when we started to get a little bit behind the curve she reminded us all that if we were going to win again we had to get going and in the end it wasn't a last ditch attempt, it was controlled.  have a good understanding of mobile's brand and its integrity, which is further evidenced by the way in which they have developed their lubricants department to meet our requirements.  extremely useful to us and will help the business grow, our business and their business. A family owned business which internally is very friendly. My role at WP Group involves improving internal controls, streamlining our processes to align ourselves with mobile and also providing management information which assists our team to do what they do best. I love the culture of WP Group.  We operate over 40 HGVs. We have another 8 on order this year. We operate from Dorset in the west and Kent in the east, right up to the Midlands. We take great pride in our fleet as you can see. Keeping them very well maintained up to the highest of ExxonMobil standards. And this is reflected in our high scores with the Traffic Commissioner. There are so many things that you can say about what motivates staff. But in terms of the Elite Club and the achievement of getting the Gold Award for the Cluster this year,  The key motivation was winning. We like success at WP Group. We thrive on success. And I think most people in a competitive world, a competitive environment, need success every now and again to drive them forward to achieve more. The company employs 92 people in these offices, supplying 150 million litres plus of fuel and about 8 million litres of lubricating oil. Hi Harry. What's that?  Elite Club 2013 Secret Planning HQ, let's go and have a look. David, out! Okay, okay. Sustainability is one of our key focus areas this year. We're going to work clearly at establishing the sustainability programme within WP. I love the Elite Club programme. I mean, it is what it says. It is the elite. It is the best of the best. For now, it's a fond farewell from the wonderful WP team. Until we meet again next year. Yay!  you  you"
}