{
  "video_id": "L1J-mrM3DIg",
  "transcription": " I'm back in the studio with the company with the new  piece titled Tearfall. It's had a very interesting incarnation and looking at protein structure within tears. I kind of didn't really know it was there in terms of the exploration but it's really been exciting and what's been very very useful is in this experience in this particular studio creation I've had the pleasure of working with the scientists so my work has been underpinned with scientific knowledge, facts and a lot of humanity.  My head it started out as a way of talking about this particular protein called lysozyme which is found in tears whose job it is to kill bacteria so protect your eyes. Because it's such a vast subject I have taken the structures of protein but what it has done is given me a real human way of looking into the into the world of tears and actually the reasons why we cry so looking at the dancers experiences and asking them to really contribute to  process has been phenomenal really because I've hoped to bridge that gap between a scientific understanding of the lysozymes and the various proteins within tears and actually looked at what is contained within the human emotion and why we cry and the different types of crying. Of either taking information or giving it over really does need to kind of play itself out when you're connecting to different people in this scenario. One of the things that the Wellcome Trust has enabled me to do is to talk to other people and we within  Within this process we have three Sandpits, which is a creative conversation with people that are not necessarily in the studio with me at the time. Within the Sandpits we've had psychotherapists, we've had studying at the School of English, we've had another artist from a different genre, and people from an operatic background, just a number of people that have a different perspective on the subject. And we had a great time. The conversations were very deep and they covered a lot of areas, as you can imagine,  I imagine the subject of tears is vast, wide and deep and everyone has their tears in some shape or form. So it was great to really have that conversation and to bring some of that information back into my thinking and back into my process. And again, enabled by the support of the Welcome Trust, which is really quite phenomenal. If we just mark through the protein line and just think about the quality in which we're actually presenting the arms, the feeling that you have. So we've kind of you probably all got your own version of what this feels like. It's interesting making that  of science and the emotional connection because we did a lot of tasks which are heavy emotional tasks. So crying within a group, going from crying to laughing to crying and how that evoked any kind of emotion within individuals as dancers. And we started making connections with thinking about within a protein, within the molecules itself, whether each person had their own kind of particular story  and that's where we drew the kind of emotional side out to put within the piece. So everyone you'll see within Tearful has their own personal journeys but equally at the same time there is like that sense of community because we are part of a protein structure.  I've been in a process that's been very different for me. I've been working with a dramaturg, I've changed music, I've ventured through various forms of music, I've looked at different scientific texts and also just various books on research in terms of understanding the different forms of tears. The dancers have been on that journey with me from day one. I think one of the biggest and very different experiences I've encountered with them is actually being in the studio and having them cry.  It was hard to take, hard to look at, but actually very, very important in terms of developing the process because I absolutely wanted their experiences within the work so that they could absolutely have something that was tangible to them and the journey continues. For them, they can continue to make that journey throughout the exploration and right through to delivery. The process for me has been really quite varied and I started out with one idea which has completely shifted into something else and it's one of those journeys where you don't quite know what you need  start the process. So I've got quite a varied soundscape which gives me a lot of emotions, a lot of texture, a lot of depth, rather than working in one direction with one composer. So that's been a significant change. I'm working with a lighting designer that really has helped to develop the space and really kind of bring sonography to the forefront, which I've not really had the opportunity to do before, really sort of delve into that area. And I do feel that all these compartments are coming together to sort of bring me  something that is very real and is coming from a very real place, a tangible place.  a profound part of this experience. And having come through the other side with them looking at this process, I feel that I actually, you know, I've got a great bunch of dancers, I have to say. They're absolutely fantastic, but they really stuck it through and we've kind of kept this journey moving together. The time we were a little bit out with that time in there, that we do it a little bit late. Being back in the studio is just one of the most magical moments that you could have as an artist. And it's where my passion and my joy for dance and creativity happens.  So, yeah, being back here is where I belong. I wish I could be here more often. And what's really nice is also that I can take external opportunities and external conversations and bring that into the studio to enhance the practice, enhance the intelligence of what we're creating. So having the conversations to talk with psychotherapists and to talk with other artists about the project itself or about the subject matter has really opened up. And that is a project  that I think I will continue to work with."
}