{
  "video_id": "L76mz5AOOIE",
  "transcription": " you  Sisters and brothers, Leo Girard, Dan Flaner and Carol Andrew, thank you very much for the opportunity to be with you on this important day. As I thought about what I wanted to share with you, three important ideas came to mind. Our family, our fight and our future. It is difficult to express how grateful I am  for your steadfast support to my family. When we left Mexico seven years ago, we left behind our beloved country, our people, and much of our lives. We lost everything. Our home, our friends, our family. It was so hard. We began anew, and we discovered you, our new family. And it is because of your love, your kindness, and your solidarity  I am so grateful to be part of you, the proud, strong and sensitive women of Stella. I wouldn't want any of you to have to endure what I have lived as a mother, as a daughter, as a wife and as a woman. We have fought for our dignity and we continue to fight for justice every day. Because we recognize truth, we have never lost our will to fight.  Each day we have found the courage to keep fighting for that which is right, that which is just, and that which is truth. Our future is a bright future and we have to protect it and make sure that terrible injustice and savage oppression, this story that we have lived, never happens again. Not only in my home country of Mexico, but anywhere in the world, to any woman.  man or child.  powerful that no matter the size of the lies, intimidation or the greed of our enemies we will always defeat them. I want to say thank you, dear Gerard. Thanks to your leadership and kindness my family is safe and alive. And it is with leaders like Leo and you, my sisters, each of you, that we can walk together confidently towards a better future for our families, for our unions, for our world.  My love and deepest gratitude to you, my dear sisters, the women of Stille.  Followed by Federal Police Forces and members of the Army. Trying to scare them and put a lot of threats against them. But they managed to get rid of them and cross the border and be safe. They were very brave. Oralia has always been a very strong woman. And once they were in the United States, I asked my children one by one to leave Mexico. Because we were receiving  all kinds of threats. Threats that haven't been stopped after five years, seven years now of political persecution, of abuses of power, in which they have assassinated some of our members, in which they have kidnapped and tortured some of our colleagues, in which we have been persecuted politically and accused of lies and false accusations  the  brothers who have been especially to us our very great support to survive and overcome this tremendous and coward attack against the Los Mineros. I want to thank you for all your solidarity. Our heart is with you because you gave us and you believe in us. You gave us all the confidence in the beginning and we continue on this  struggle because it's more, it's beyond our principles and values. Our main objective is to reach justice, respect and dignity for the working class, for the middle class and for humanity as a whole. You, sisters and brothers, and your visionary leaders, my dear friend, Leo Girard, Anne Flenner, Carol Landry, Ken Newman, Steve Hunt,  And all of them have been so strongly committed and supportive with us that we don't have enough words to express our deep appreciation. Thank you very much, sisters and brothers. This struggle has been terrible, but we will continue fighting and resisting because we are going to survive and to win. This story is going to be published in my book, Collapse of Dignity, next month of April. I want to share with you  A story which you have been together with us since the beginning. In solidarity, in brotherhood, in friendship. This is a story which we will finally end with a victory. A victory which will be not only for Los Vineros of Mexico, but for the democratic unions of my country. It will be for all trade union movements all over the world. Thank you very much for your friendship, your solidarity.  victory, sisters and brothers, and I wish you a lot of success during your conference. Thank you. Thank you very much again."
}