{
  "video_id": "le0B8XH-W1I",
  "transcription": " ♪  I was so impressed with Meryl and Loretta when I met with them. It was just something I wanted to do. I'm glad I did. Lawrence County did not have a home. It was important to do that. I also saw it as something that was unifying the community, which it did. I think that all the people in this group, they were all risk takers. All eight of us.  As Alan Feinberg explained, it was Arnold Feuerstein that got the group together. He knew that without the support, without all of them together, the opportunity to buy the building would be lost.  Arnold asked us all to co-sign the note at the bank. I didn't know at the time who the other seven people were going to be. We were just eight lucky guys who were able to sign the paper and get the money and start the home because otherwise it would not have gone. That's the best thing I ever did.  When we were trying to get financing at the front end, we tried to create an interest list of people who would become residents. And my mother was living at the time and I got her to sign up. She had no interest in going there, but she agreed to put her name on the list so we could impress the bank with it. Well, she was the 20th person to move in. And she had five of the best years of her life there. And I think that's something I'd like to see other people have the opportunity to do too.  so many people who I know have a much better lifestyle. And then at that point I can think of my mother. It just extended her life and I know it's doing the same thing for other people. And it just makes me feel good to be able to support this organization. Thanks to these men and many of the other early supporters, Heritage Point is enjoying 20 years of success.  As one of the finest senior communities in the United States and Canada, Heritage Point proudly boasts a variety of programs allowing our residents to stay active and vital and productive their whole entire life.  The most rewarding experience is to visit with our residents, talking with them and listening to them. You learn about their remarkable lives and how blessed they feel to be living at Heritage Point. I will be 101 years old December 2010 and I have a great life.  I have lived here since 1990. There is so much here that they give you here that will keep you busy all day long. We really enjoy it very much. A lot of entertainment. And after all this, in order to relax, I go to the gym and ride the big bicycle. I started with a half a mile four months ago and up now I'm up to three miles every day. I want to make a hundred miles by the end of the year. My name is Jeanette Freshman.  I have lived at Heritage Point almost eight years. I think anyone who lives here is very lucky. This place is just a nicest place to be. Everybody here is caring and helpful and kind. My name is David Karp. I moved here because I wanted to live alone but be among other people. I love living here. It's very home-like.  enjoying it. One of the most incredible wonders of Heritage Point is that many who were actively involved in Heritage Point in the beginning are still vibrantly connected to Heritage Point today. I think it's the best thing around and like so many other charities you don't know where your money's gonna go but here you can see it, you can touch it, you can go there, you can talk to the residents, you can be a part of it. It's a wonderful thing.  I support Heritage Point because it's part of it. I've enjoyed the ride and I've made so many of my dearest friends who were involved along the way and are still involved. The next generation really has to go through a similar process. And they don't have to have the kind of faith we have. You have a functioning, successful operation. And now you just want to make it even better.  gave me the best answer to supporting an organization in need. When she was dying, I hate to say this, she said to me, follow in my footsteps. And my husband and I have done it. I would tell anybody who has this kind of an opportunity to take it. You get more back than you give. Supporting Heritage Point is being part of the family. And please join me as we embrace the next  generation of residents and supporters of the Heritage Point family."
}