{
  "video_id": "lFjvRCEybe0",
  "transcription": " Hi, I'm Joanna here from Running Warehouse. Today we're here to test out the Mizuno Wave Precision 13. The Wave Precision 13 is Mizuno's neutral performance trainer. New to this version is an open mesh upper for increased breathability, along with a revised heel collar design that has been lowered for comfort around the ankle and the Achilles. The platform has been unchanged in this update.  half marathon coming up. What did you think about these precisions? I really thought they were the perfect shoe for what I'm doing right now for training. They're a great lightweight trainer. They still have that nice 12 millimeter heel to toe drop, which I really like. It is a more traditional drop. So it gives you that great cushioning, really nice smooth feel and as much protection as I need on the road. But it's a lot lighter weight so I can go a bit faster. So Kevin, you've done a lot of running I know in the Rider 15, so another Mizzino shoe. How does this shoe compare to that one?  Well, basically, initially I thought they were very, very similar, but more miles put on the Precision, I found that the Dito was a little bit more trim. The Rider 15 actually felt almost like a little bit wider on the forefoot, and the Precision for a streamlined and for a little bit race-ready shoe, it felt a little bit more narrow and racy feeling. So Kevin, a big change in this version of the shoe is the upper. What did you think about that? Well, in comparison to the last model, this one's upper is actually quite more breathable.  It's got a lot more open mesh and it's very pliable as well. I've really enjoyed that about Mizuno's upper. It's just a really great fit. The Precision 13 is a lightweight trainer suitable for everyday use. It's a good choice for runners who like a traditional heel-to-toe drop but want a lighter and leaner feel. The Wave Plate disperses impact throughout the running gait, delivering an ultra-smooth ride and firmer protection than comparable shoes. The new upper increases breathability while providing a fit that is snug,  yet forgiving. The Precision's lighter weight makes it well suited for tempo running and longer distance racing."
}