{
  "video_id": "lFKSO0jtTes",
  "transcription": " Here goes Nigel, this could be the final run for Slime Slammers. Trying to make a clean transfer. Trey making sure to get every drop of slime in the bucket. What's up guys, we're here at the Kids' Choice Sports Awards. I got my two helpers. This is Libby. Say hi. Hi. This is Jackson. And we're about to hopefully get slimed. We're also competing against Team Bro.  So Team Healthy is going to win, right? Yeah, we're going to win. Say win. Go Lindsey! Yeah, go Lindsey! Yeah, let's do it. What do you think? Should I wear shorts or pants? Maybe shorts? Ooh, slime. Slime slammers.  Slime slammer. Say hi!  We're going on our side, let's go on my side.  Call my mom!  We just changed into our  Took about five minutes. We got some lunchkins in there. Did you guys like the red carpet? Not that much? Taking names, kid. Taking names. Oh, it hurts your eyes? I know, it hurts. Taking names. That's why Pique wears sunglasses. Oh yeah, ready to go. But Pique is going down, so. I have the secret potion. Snap. Prime time, slime time, baby. Good job, baby. You did a good job. Whoa!  Let's go! Look at all that slime. Slime slammers are going to get slammed. Now, does this make you want to go back and finish fifth grade? I'm just joking, man. Don't answer that for me. I'm just so glad we're not grading this on penmanship. Ooh, sound like a rematch is on the way. Oh, yeah. I heard that. All right. Let's do this! Three, two, one, go!  Wait for the bell to ring. Kel responds with a double shot. The first team to assemble their puzzle will be the winner. They're suited up and going through those beach balls to get those water polo balls. How about that? Oh, green slime.  You guys you voted and your choice and your choice and your choices And your choices Lindsey Vaughn Oh man, thank you. This is so awesome. This will be my last one since I won't be going as fast anymore  since I'm retired, but thank you so much. I really appreciate all the support over the years. And let's try to get one last win with the Slimers.  a lot of ground to make up.  Oh  Listen orange crunch pulled out another slimy victory. No pun intended Very few people can say that they beat her now I have  I  That's all I wanted to do. The Souvenator had to come in and get it done."
}