{
  "video_id": "lHJ_OYAC56U",
  "transcription": " Hi vlog! Since my boyfriend left, I've been trying to adjust to my new life in Japan on my own. I've made friends with people from all over the world and I've had many new exciting experiences. Living abroad forces you to be vulnerable in the best way possible. You have to be open-minded and willing to experience life in an entirely new way. Living abroad is a constant guessing game.  in a different language, guessing the right cultural practices in the current situations, or even just guessing how to read because I haven't mastered all the kanji yet. But you have to learn to laugh at your mistakes. I mess up at least once every day. But it's okay because every day I'm learning. So here's what I've been up to lately.  Is it coming?  Kichijoji  I'm not vlogging very much. Ah! I'm so awkward. Hi guys! So, sorry I haven't been vlogging lately. I've been trying to hang out with all my new friends and I thought that vlogging would be really awkward. I have to go to Kichijoji to get my student bus commuter pass called tsuugaku teiki. Basically, you get a discount for when you commute to school. And I'm gonna go explore Kichijoji. I have like a bunch of shops and  cool places that I want to go to and school started a couple days ago. The class sizes are a lot smaller in comparison to my school back home and I'll insert some clips of ICU right here.  I was an apple for my teacher cause I knew I'd get a kiss Always got mad when the class was dismissed But when it was a session, I always had a question I would raise my hand to make a dead girl do my dance And help me with my problems, it was never much Just a trick of malice, yeah, I tried to speak a touch Oh wow, I was, I could hold a hand, I could rub her eyes She was married to the man, he was a thug His name was Lee, he drove a C, he picked her up from school Probably at three o'clock I was on her dock, yes indeedy  I  Hello vlog! Hey guys! Hi guys! It is the next morning. It's Saturday morning about 11.30am. I don't have a lot of time to talk because I need to run the fuck out of here and meet my friend Luca at the train station. But I'll get into that later. I just wanted to recap.  on my day yesterday because it was pretty eventful but I didn't really talk that much to the camera so yesterday I went to Kichijoji station to get my tsugakuteiki which is like a commuter pass for students so that you can get discounts on your bus fare to commute to school it was so fucking difficult I went to like three different places I had to like speak in like broken Japanese to like the train station guy and the police at the koban and just a bunch of people it was really difficult but I finally figured it out  And I got my tsugaku teki and then after that I went shopping at Uniqlo because I needed to get professional clothes Because pretty soon I'm gonna start doing community service at I want to do it at elementary schools And if I do it at elementary schools, I have to cover my tattoos and dress professionally And I don't really have any professional clothes because I dress like this and then I went to yakitori  by myself. I tried pork liver and pork tongue and the pork liver was surprisingly good. It had kind of a weird taste but I liked it and then the pork tongue was really really rough and not cute. I was like sitting alone at this table and like there was like a bunch of tables connected right next to me and and at the connected table next to me there was three salary men. Two of them were like middle-aged and then one of them was like  really young looking. I was just chilling there by myself eating and then one of the guys at the table next to me, one of the salary men asked me like, who are you from? And I told him I'm from America and then started talking about why I'm in Japan and what I'm studying, my nationality. They saw like the tattoos on my wrist because I was wearing a long-sleeve shirt and I kind of had the sleeves rolled up a bit and they were asking me like what it means and then I was saying how like in America it's really common to have tattoos but in Japan like I rarely see people with  tattoos and then the guys told me that like they actually do have tattoos and that one of the guys is a Yakuza in the mafia and at first I was like oh haha like that's so funny like he's totally joking it's a joke and then like we keep talking and I'm slowly realizing like oh my god I think he's actually a Yakuza I think he's actually in the mafia and I'm like oh my god gotta go I dip the fuck out but they were  I'm actually really chill. Surprisingly really, really chill. Like, nice guy. But I feel like normally it wouldn't be dangerous to be talking to them. But just because I was a girl by myself, I had to go. But that was a really fun night. So that's how I met members of the Yakuza. On accident.  Japanese friend Luka and we are going to the hedgehog cafe. It's called Harry Cafe. It's in Harajuku and I'm so so so excited. If you saw my first vlog, I saw a cute little hedgehog at Yoyogi Park but this time it's gonna be a cafe full of hedgehogs and I'm super super excited. Let's go!  Ha ha ha!"
}