{
  "video_id": "LKHYrdzn3qY",
  "transcription": " The priority should be here. Currently the connections that we have through heavy rail and through road transport are at peak. There are things that we can do to improve those situations. We need to get vehicular traffic off the roads around this area.  area to allow this precinct to work more effectively and to contribute fully as a major economic hub for New South Wales. The biggest issue in Bennelong is congestion. We have five of the ten most congested roads in New South Wales. Light Rail will relieve that situation.  Carlingford needs greater connectivity to Parramatta Macquarie Park. The suburb of 36,000 residents split across three local government areas. With an additional 5,000 units coming into this area in the next 15 to 20 years, Carlingford really needs the light rail in order to get people from A to B. Light rail is a real game changer for Parramatta and its suburbs.  in Rydalmere, Tilopia, Carlingford. Those areas have been ignored by successive governments. This is our opportunity today to actually deliver transportation solutions for the whole of these suburbs and increase Parramatta as the next capital city.  great city and you need to have great infrastructure, great people and this will just bring everything all together. The digital economy is continuing to grow at a rapid speed and Macquarie Park is our own Silicon Valley and if we can bring infrastructure to Macquarie Park in the form of the light rail I think that would be great for Sydney and for New South Wales.  I support the light rail between Parramatta and Macquarie Park because they are two of the biggest growth areas in our economy. It's going to link residents into their workplaces, residents into their places of play and it's the only way forward for Western Sydney. This is a skilled and mobile workforce that would like to have  have light rail options to move people in and out. And that's why I think that if we can get a light rail there into Macquarie Park, that would be a very good thing. Parramatta is going to grow from 50,000 to 100,000 workers over the next 20 years, and we've got to have the right solutions for the transport in our local area. As the Mayor of the Hills, I look forward to working with Parramatta Council and Ryde Council to ensure this light rail gets built. This has to be the priority. It has to be the option that government selects, and it will be  the one that returns most benefit to the state of New South Wales."
}