{
  "video_id": "ll_2r8t9GYA",
  "transcription": " Alright, this is a video of Togawakomodo. Salam! Here's where I live. That's a neighbor boy. There's some mountains. This is the road I live on.  Almabak  We walk this way, here's my gate. And there's some turkeys. And little turkey babies. Here they are. Hey turkeys. Chippa, chippa, chippa, chippa. Here they come. So we'll open the gate. And... Hi! Chippa, chippa, chippa, chippa. And to the right is my home. And to the left we have our van, our car. I have  This is my dad.  very delicious.  It's a beautiful view.  lovely  house. I'm lucky because it's they've built it's brand new. The hole is nice and deep. Here's where you get the teepee and the trash. So it's a really nice outhouse. Hopefully it stays like this for two years. But here's the views. There's some neighbors homes and some cows and little calves chilling. So now I'll take you inside.  and show you the house. You can see the back of the house, it's really pretty. That top room is my room. I'm very lucky. And... Sometimes at night I'll be walking out here and it's pretty scary, but... The sky is filled with beautiful stars and... I just think how lucky I am. So, we're inside the house. We always take off shoes here. It's what you have to do in Kyrgyzstan, so I take off my shoes.  I got fresh shoes. And to the right is a door where it's our indoor kitchen. There's a stove and a microwave and it's a room for cooking. And when fresh loaves of bread are cooking, it smells delicious. Here's the inside door. And here's the hallway. To the left, we have the kitchen, the TV. Here's Torsten and I, my sister, she's 16.  We just finished having lunch. We had chai and salad, borsok, national bread, and there's our fridge and our lovely water filter Peace Corps gave us. They have really nice modern cabinets. And across the hall is their guesting room. Here is where they want to guest people. It's a very big room and it's where parties  happen. It's a big tradition in Kyrgyzstan to guest people. Um, we keep walking down the hall. To the right is a little hanger with towels and hats and then there's a mirror and to the left is my parents room. Ata and Apa, host parents. This is their bedroom. It's pretty nice. And once we walk up the stairs, we will make it to my room.  And here's my beautiful room. Here's my things. Cabinet. My wall is beautiful. The floor is filled with all these felts women here made. I have a table where I can guest people. Where I can read my books. I have a beautiful view. Here's my bed. I try to make it every day. Here's a heater. I will fill with coals in the winter.  winter when I get cold on my calendar a Kyrgyzstan map and I am around right here so literally the middle of Kyrgyzstan and here's my closet so yeah I love my room and I hope you enjoyed seeing where I live Togolok Moldo and there's my beautiful view  The movie's out, now the old girl"
}