{
  "video_id": "lO7oDAwcil0",
  "transcription": " Alright, Primus New Jersey test the showroom. Let's check this bad boy Model 3 out. Open the doors. Kind of finicky, but it's alright. Seats are super comfortable. Nice small steering wheel with nice thick grip. Of course, awesome simple interior here.  I sat in every seat so far and they are quite lovely and plush and not too plush but supportive and not too much heavy side bolstering I think they're really great compared to the Model S I have and this is the you know touchscreen or I guess controls for everything in the car except for these two scrolls this one does sound so far this one  I'm not sure does anything yet. I think it they might be changing it some autopilot features But everything is awesome. I browsed around poked around a lot here Everything is very easy to figure out Some car controls music, you know heated seats Air controls Music the music is the most impressive  I think it's better than the Model S with the high fidelity sound I think. Well this has the premium package of course.  So fast, everything loads so fast. Hi, someone just joined me in the car. So I thought I'd let that guy take a stab at it. And I believe this is the showroom. This is the delivery center. So here's my Model S. I was just waiting for a tire pressure monitor sensor  I have the sweet ass arachnids and uh... This is my car! But it's kinda messy, of course, you live in it, you drive in it, you have kids, you have family, but... Yo, but everyone better watch out because there are at least 20, I'd say, Model 3's in this lot.  I didn't know actually Paramus New Jersey had test drive Model 3's available already. I guess just take it around for a spin for the day. But uh, I'm just gonna wrap around the lot and show you how many Model 3's there are. There's one. Of course, there's one. There's one, there's one. Sorry if I'm missing any. There's one, there's one, there's one, there's one, there's one, there's one.  and a few down there so I count about like 20 model 3's oh there's another one so man everyone is all in trouble every auto manufacturer is in trouble and this one my friend is the performance model 3 with white interior with manufactured plates and  Check that out Performance Model 3 California plates Now you can test drive at Baramos, New Jersey Hot! It's okay And it's got the performance package of course  Alright. Peace. See ya."
}