{
  "video_id": "LUOj--BcEMo",
  "transcription": " YouTube what is up Kyle McKenzie back again bringing you another video this weekend red-eye apparel We are headed to the Mojo money ball over in Columbus, Ohio This is where a lot of teams kick off their year Especially from the Midwest Michigan, Indiana, Ohio Over on the East Coast you got Pennsylvania team from New York all over the place. So we are getting ready to take off now Headed to pick up Kyle that we're gonna hit the road. It's about a four-hour drive from here. So let's  Let's get over there and we will take you through some softball action.  when he gets in the car because he was like 25 minutes late and we put him on blast so we'll see what he has to say but just so you guys see I was only five minutes late and that's pretty good at traffic and everything the way that it is. Right on time. I don't think so. Oh, Kaylee said I'm six minutes late. Six minutes late compared to 25 you guys do the math on that. Game one we've got car Goodwood out of Michigan. It is, it says 31 degrees  but it feels a lot colder than that so we're gonna give it a shot hopefully nobody freezes to death out there  Oh  Let's go!  Go Kai, score!  Hell of a way to lose that one with the tying run standing on third. We did it to ourselves. A lot of stupid, stupid errors. I shit the bed in the first inning as you guys will see.  A lot of runs on the table. A lot of work left to do today now, so... Let's play again here. Alright, if you guys are anything like me, you're going to... I'm superstitious as hell. But I'm going to try and change as many things as I can after a loss. So, since it's cold as shit, you can see my breath, I'm going to change my shoes. Hopefully that'll change something for us here. Iron City, game two. Losers bracket, our first game.  Of course we lost the toss.  We've got a game to win. I'll call that the hangover game. We started really slow. Finally started hitting later. So instead of playing at 7 now, we're going to play at 9.30, which is a hell of a lot better. It'll probably be snow and wind tomorrow morning, high of about 35. So I'm sure that'll be a blast to play in. Day number two of the mojo, playing Darkside. Isn't that their name? Demboys slash Darkside. Don't really know anything about it.  anything about them other than it's our third game and it's cold as shit.  Yeah!  Good pitch, good pitch. Come on, they're looking to walk all the way, let's go. Step back side.  There you go. Bring it with you. Bring it with you. That's ball game. That is a wrap for us at the Mojo Moneyball.  some credit they made the double plays that we kept repeatedly hitting into but they made those plays we didn't I shoulder a lot of responsibilities being the hitter and being 0 for 2 through walks. Another one I feel like we blew another one and two crappy weekend so hopefully you guys stay tuned I don't blame you for bailing watching team a team go one and two every weekend."
}