{
  "video_id": "M-gZMQKFPFc",
  "transcription": " Georgia State they gave Wisconsin all they could handle but the ninth ranked Badgers were able to hold on in the end and get to three and oh with a twenty three to seventeen victory. We were here for it on Brandon Gordon alongside Chuck Long and Chuck I said that Wisconsin escaped and indeed they did escape Georgia State. They were there every step of the way. Georgia State came to play today. They ought to be proud of their effort. Wisconsin has some miscues but they survived.  and made the plays when they needed to to win this football game. They didn't lead. Speaking of some of those plays, let's take a look at some of the highlights from this affair. And you said miscues. They had some miscues. Followed by Shaw down by the goal line. Wasn't protecting the football properly. Ball comes out. And then this field goal, of course, right before the half to keep it a 6-0 game at halftime. Really a win for Georgia State. And then Hornibrook made a nice throw off the receiver's hands. They get the interception. Georgia State answered after that.  that interception to go ahead. And those are miscues you're going to have to clean up as the year goes because you're playing a very tough Big 10 schedule. Second half we had a couple of touchdowns finally hit the board. Power football by Wisconsin to score the touchdown. Oh there's Manning to Davis in the corner on a great back shoulder throw. Here's a run with the guard pulling. Nobody there to make the tackle but here's Hornibrook on the boot.  the penicillin for the decisive touchdown there. Yeah. Ballgame today. That was the eventual game winner as Wisconsin holds on to win a 23 17. You see the turnovers highlighted there obviously in Georgia State's favor. Absolutely. And you know you see the type of possession by Wisconsin always good in that department but the turnovers can equal that out and gave Georgia State a chance to win this game. But in the end it was Wisconsin finishing off and that's what they did.  they do. I mean they're good at that, they're experienced with doing that and they did it today. Dominating the time of possession and the Badgers get to 3-0 before that tough Big Ten schedule comes their way starting next week. Alongside Chuck Long, I'm Brandon Gordon signing off from Madison."
}