{
  "video_id": "mBugj-_pEyE",
  "transcription": " So now it's selfie straight and look how pretty it looks.  Hey guys, it's your girl Emily and today I'm back with another hair video and today I'm gonna be showing y'all how I style this hair Bifat's hair and it's a Brazilian Remi straight wig with baby hairs. It's 24 inches Look, it's 24 inches and it's really pretty And I like the look of it because it goes really good like I like it  I'm going to show y'all how I style this wig.  subscribe before we get into the video and yeah let's get into it and it's one of them comb it out I mean I got a comb it kind of got a little  I love the way I did this though. Like I did such a good job. It looks like a lace like a lace funnel. It looks like a lace funnel. So look how I did look at this y'all.  I love I did it good this time and this is the glue I use You would need lace foam glue Make sure when you put the glue on you push your edges all the way back Like wet your hair push your edges all the way back with any type of any type of gel  or Gorilla Snot because that really helped me. So I use Gorilla Snot and gel to like keep my itches out the way. And I use water to take the wig off or you can use, I don't think you need to use rubbing alcohol, but if you need to, it won't come off. But  Then my point I didn't pluck anything I have this uh spoolie brush it's an eyebrow pencil but I use it for my hair too so I use this side to put the uh the my color of my neck my my skin tone onto my scalp so I use this type of powder it's like uh what's the transducer powder? Transducer I don't know if I said that right buzz powder  I  This is like this is one of my favorite looks I did this week I really like like straight hair because it's really cute And I wanted to put some curls in it Maybe not because you know Maybe some curls at the end No But yeah, where's that spray at? Okay So now I'm gonna use the spray. It's like flat iron spray  You don't have to let the money come between us, no no They not even capable to feel us, yeah yeah Why don't we just take the stacks and go to Pisa, yeah yeah  That way you could lean away with other people Yeah, yeah, yeah Oh my God, looking at my squad Baby, I can Gucci like I'm a rookie Looking at me like, why do you go hard? Cause goddamn, I'm on a cruise ship I do whatever that I want Better understand cause I don't know where I should start Level out the score cause yeah, I've been a star You don't even know but baby, that's just how we are That's just how we are  And you don't even talk to me I had to tell myself don't leave Baby why don't you come with me Hiking up that hill that's easy Oh my god, look at all my sauce See me going crazy, like in the 80's Looking at me like where are all my flaws I don't know I'm feeling lazy Don't even care now, all up in Japan right now I'm pushing for that mula like a friend out now  We be kickin' like a penthouse now I wanna do this shit with all my friends right now We don't have to let the money come between us, no no They not even care for all the feelers, no no Why don't we just take the stacks and go to Pisa, yeah yeah That way we could lean away and all the people, yeah yeah  You don't have to let the money come between us  They not even capable to feel us, yeah yeah Why don't we just take the stacks and go to Pisa, yeah yeah That way you could lean away with all the people, yeah yeah, yeah Oh my god, looking at my squad They be acting Gucci, like I'm a rookie Looking at me like, why do you go hard? It's god damn I'm on a cruise ship  Do whatever that I want Better understand cause I don't know where I should start Level out the score cause yeah I've been a star You don't even know but baby that's just how we are That's just how we are now And you don't even talk to me I had to tell myself don't leave Baby why don't you come with me Hiking up that hill that's easy Oh my god, look at all my thoughts See me going crazy, like in the 80's  Looking at me like where are all my flaws? I don't know, I'm feeling lazy Don't even care now, all up in Japan right now I'm pushing for that mula like a brand out now That 808 be kicking like a penthouse now I wanna do this shit without my friends right now  So now it's silky straight and look how pretty it looks  You can also get this hair from Bee Fox Hair. It's Brazilian Remedy straight hair and it's 24 inches. If you want to look like a baddie, go with this hair. Period. Bye, y'all have a good day."
}