{
  "video_id": "mfZXcckCzEE",
  "transcription": " This week on Behind the Scenes A brand new 3D rig 400 pounds of high octane gasoline and a flying machine of death What could possibly go wrong?  Today we're getting ready to do our 3D aerial shoot. We've just refuelled our Bell 407. We're going to be flying through some of the gorges and valleys to get some awesome beautiful green scenery.  We're heading off to Shushlui up the north coast of KwaZulu-Natal and tomorrow, Sidwana Bay, St Lucia Estuary. So it's going to be a hell of a ride. It's my first time in a helicopter so it's going to be a rock and roll time. My experience pilot for the day is the machine Bill Onstead. Some safety tips to remember. You never know. These may be obvious but nevertheless, they're here for a reason.  Pay attention to the third tip, never approach or leave Apple. Roger Blades are expensive. Some light humour. Like I say, obvious. Let's take a look at the 3D rig and how it's set up. We are here at the 407 Jet Ranger with a Libra mount on. The gyro stabilises the camera and minimises the bumps of the helicopter. It's rougher than you think in the air. This thing was modified over the last week. This is actually its first time out, so it's going well.  The beauty of using this rig as opposed to any other rig that can fit on a Libra is that we can actually control the convergence inside the helicopter. So whereas before you'd have to land and reset and measure and it's an hour setup, we can literally just do it because it's all motorised. And I have presets in the chopper so my assistant just pulls my convergence to where I need it. So when we fly into the cliffs and stuff I'll really make them pop out of the screen into the negative parallax. Negative what? Parallax. You have the screen plane. Anything behind that is in the positive parallax. And anything jumping out  is in the negative parallax. Everything's controlled from inside. Chopper. So I operate from here. Here's my wheels and my 3D monitor so I can frame and stuff. Brad keeps my horizon horizontal all the time. I'm Brad. I control the head here. Stabilization and everything. And then Sean is sitting over there with a controller where he's pulling my convergence. Pulling your what? Convergence. Basically setting our  point where it's comfortable for the viewer to watch. If I can put it that way. Sorry, I'm just a bit out of breath. It's hot out here. The camera's mimic your eyes, and the common point in the distance that they or your eyes lock onto is the point of convergence. You may be locked on something in the foreground, but if it's too hectic, then your background is out of whack. Unfortunately, you can't tell the viewer where to look. Like Brangelina, it must be easy on the eyes. You may have noticed all the gear in the back of the chopper, heavy and cracked.  Here's a quick aerodynamics lesson. For a helicopter to lift and remain up, it needs to be pushing air down. But if the air is pushing down from the top, it's harder to go up. Especially if it's too heavy. Through these beautiful narrow and rocky valleys, the air tends to be pushing down. That's when things can go a bit pear-shaped.  so  This is Holder T. You remember that safety tip?  Right, we're leaving.  So what actually happened? We had to wander the wilderness until Stefan and Bill found a stable place to land. Eventually.  It's a bit windy.  As soon as we found level ground we landed and checked the gear. Brad could finally check his baby. Then we took a bumpy ride with the jet fuel. And off to the coast to finish the job.  so  you"
}