{
  "video_id": "mhZZUveK-uQ",
  "transcription": " Hey guys, welcome to everyday family adventure. I'm Trent and I'm Siobhan and we're standing here at a KOA journey  This is just a quick video we wanted to give to talk about the KOA journey because we've spent time now at three different types of KOA campgrounds, which we didn't know much about the different types of KOA campgrounds when we first started. So we just wanted to say thank you so much to KOA for hosting us and letting us kind of get a glimpse of what KOA is all about and what its different brands are. KOA journey has been so great because it was literally just kind of a stop off of the highway  Easy pull through space we stayed for two nights and didn't even take our car off Yeah, I thought was awesome because then you don't have to put it back on which you have the consistency of the brand But also what you have for us is we work while we're on the road so we could have some just downtime Not only that but because it's not a typical KOA with Playgrounds and jumping pillows and all of those like resorty things there weren't any families here So it was literally just our family. It was a nice time to just regroup get a couple good nights of sleep  We would wake up in the morning and exercise in complete peace and quiet. Peace and quiet. And there's lots of people coming through because that's what a journey is supposed to do. It's like a spot in between your destinations that you can count on the consistency of KOA for. So we actually liked this campground for what it was for. Now, if we were coming here for the purposes of hanging out and doing lots of fun things, this wouldn't be the right KOA for you. We'd be really disappointed. Yeah. But this is exactly what we needed. And again,  Consistency with the brand and here's the other nice thing the more we stay at KOA's We can rack up points. Points. Yeah, you still get points when you're staying here at the KOA journey. And we did this when we took our trip out to Bend, Oregon almost three years ago and we stayed at KOA's and we would stay at journeys on the way too because Again, it was just more points. We were more about the we were more about the journey. Yeah, that's why it's called the journey we're more about like getting to Yellowstone and things like that than  than playing on jumping pillows, you know? So, KOA Journey absolutely does have a purpose and a place. You just have to know what you're getting. Right. So we just wanted to give you a small update on what the KOA Journey is and say thank you to KOA for providing this for us, which was great. And we're gonna let you guys go today. No believer bump, because that's gonna show up on our vlog this Sunday at 9 a.m. So come join us. We love you guys. Totally. That's it. Remember, we can make the world better. I believe we can.  Bye!"
}