{
  "video_id": "mKuvkN87Whk",
  "transcription": " What we're going to work on right now is the 2 on 1 grip and an elbow roll over grip. It's a nice slick grip. It fools people. It sets you up nice and deep for different things like Taniyotoshin or an Aiki and some other throws like that.  So when we're gripping here, what I want to do, I want to capture his lower part of his arm here. So I'm going to trap it like a sandwich, just like this. Now there are other ways to get it, but this is the way that works pretty good for us. So I'm going to grab here like this, catch, catch. Now this is important that I have my thumb facing me. So what I want to do is, from this point, I've got this. Now he'll pull that back.  if I don't do something pretty quick. So when he does this, I catch it and catch it. What I want to do is I want to roll my elbow over, and as I roll my elbow over, that will help me enter into a technique in the throat. So when we're gripping here, come back out here a little bit. So if I catch it here, and when I catch this, I roll into position. See, I can come in and drop and lower my levels and I'm in a position to do that.  Eric, can you come in and show how... We'll coach you through it. So he catches here, okay? Now he rolls that over and that helps him enter. You see, some guys will like to do this. Some guys will like to do this. They'll like to jack the guy's shoulder up, which helps break his balance even more and helps him get more control. Alright, so I'm under and I'm going to lead you back under.  I'm not that way. I like to come in and lower my levels. It's your preference. Okay, so if you like to do that, that's cool too. That way you can shoot right behind him and cut it into some type of a throw, whatever. Eric, like a lot of guys like to do, he'll come over and he will use that and jack the shoulder up. That will help elevate his opponent in the throw as well. So there are two ways. Don't extend your hands and reach for him. He sees what's coming. He ain't stupid.  So when we're gripping here, now the best way to do this is you want to trap it. So think about, when I trap, I want to trap and roll immediately. So catch, move like that. Just like this. Now it's a sandwich now. Again, thumb facing me. And as soon as I do this, when I start that roll, whether I jack him up or whether I just enter, I'm going to immediately attack. I'm going to roll with my shoulder, attack with my hip. Boom.  As soon as you hook up, step and go. So as soon as you hook up with your hands, with your right foot, step across and go. Now see how that creates the momentum? So watch how as soon as he grabs it, boom. See how he's in. That's how that shoulder gets in. That's what we call the elbow roll because you're rolling over the elbow with your elbow. So it's a two on one grip. Come over and then you are in position. And that's a nice set up for that.  more.  you"
}