{
  "video_id": "mvl5ZOIy_sM",
  "transcription": " Thank you seniors and good luck.  Yeah.  In the men's 800, Chris Miedema took first, Max Klink also from Nepal, and Luke Chunk were second and third. It was a good performance from the guys. One thing we've been working a lot on is getting a faster start. Even with a little bit of wind out here today at Lane, guys were through in 25, which is actually exactly what we wanted to see. They ran well as a pack.  Max was right on Chris's entire race, came through is what we were looking t the guys I think gained a today was really just a D kind of race. So the men's Eddie qualified for confer and set himself up for a in Tampa in a couple of w looking to go under 3 50 be great. And then Ian Sa  out of the season and really put himself in a good position to qualify for conference next weekend at Purdue. I took first in the 1500 meter run. I had a personal best of 352. Before the race my personal best was 355. Matt Graham took a solid pacing. We opened up a little faster than usual in a 58 first quarter and we're trying to average 62 so we just had to stay relaxed for the next couple laps and set myself up for a good last lap which is where I've been struggling all season.  After two outdoor personal bests today, 57  and 19 mid in the shot. Right now it's looking good because I kind of like want to be down from indoors right now. Big East, I'm looking to go over 20, 20 meters again, hopefully around 21. So I'm looking in good shape. Discus is coming really well. Like hopefully I'll throw 60, which is a lead in other PB, which I'll want to get around Big East and NCAAs will look promising again. I took first at DePaul Relays in the javelin, discus and shot put events. And I'm really excited for the rest of the season as next week we go to Drake to compete where that's the side of nationals. And then the weekend we go to the Big East.  after is Big East which will be really exciting as we have a lot of people ranked in the top tier of the meet. So in leading in the nationals we have two top ten. I'm ranked seventh in the nation right now, Missy's ranked second. So we both stand a really good chance to make it to NCAAs and represent our school well at the national level. I took first in the hammer today and I took second in javelin last night and it's looking good going into Big East in the next two weeks. I'm really looking forward to the regional meet and the NCAAs coming up at the end of the month. I took first in the 400 meters and  I don't know yet my time, but it was kind of a good race So it was kind of like better from all the races I've been having so far so it's kind of a build-out getting ready for the conference and I'm hoping to be you know in the final for the conference It should be possible with the way I'm running so far because I've been kind of improving every weekend So we'll see how it goes now after  Here we go. Push it, Brian. Here we go.  Let's go, Joey! Come on, Zach! Get up and go, get up and go!  you"
}