{
  "video_id": "NEVcw_yaouk",
  "transcription": " My name is Bobby Volker, I've been an MMA fighter, man, more years than I can count. Probably about 17, 18 years. First got into MMA, I was about, I think 19 years old. Always loved to kind of live it on the edge, you know, any kind of trouble, you know, whether it's fighting or  you know, other mishaps or misfortunes that I caused on my own, of course, you know, whether it be, you know, crime, drugs, you know, whatever, gotten some trouble doing all that stuff. And, you know, when I finally came across fighting, you know, starting in boxing, kickboxing, MMA kind of helped straighten me out, kind of gave me that new thrill I was seeking, that edge I needed. Yeah, it straightened me out pretty good. I don't make this a job. I keep this a hobby because it keeps me so interested and motivated and loving  You know, you make something a job, then it kind of drags and may burn you out a little bit. I've been doing it 18 years, and I still love it as much as I did day one. I got a chance to fight in Strikeforce, of course. I did pretty well in that organization. Then UFC bought Strikeforce, and they ended up taking me over. Great, you know. And unfortunately, my stand in the UFC wasn't great. I went 0-4, had some really good performances, but was not able to get my victory.  victory there, you know, and Dana said, hey, go back home, get yourself together, get on a good win streak, you know, and we'll bring you back. So that's where I'm at now. Five and 0 win streak right now, about to be six and 0. The difference is just my mindset, you know. My mind's right. It's better than it's ever been. My will, my heart's stronger than ever, you know. Still a heavy hitter, still ready to take people out. And that's what I'm going to do.  My name is Zach Buccia. I'll be fighting for the 170 welterweight title at Shamrock FC. I was introduced to traditional martial arts from a pretty young age. I was around three years old. I didn't know there was any difference. I thought everybody grew up around martial arts and going to tournaments and kickboxing fights. After graduating high school at 18 years old, I went out to California to take that even further, to really pursue martial arts and become a professional.  I didn't know exactly what that would mean because the UFC wasn't even a mainstream thing yet at that point. But I wanted to push it and see what happened. I started competing full contact out there in California and it wasn't too long I started competing in MMA. And by 2007 I ended up going pro. I've had a bit of a storied career. I mean I've had a lot of big ups and a lot of big downs and a lot of really, I've just been really cool.  close to hitting that next level or taking it to a big show so many times, just in and out. But I feel like it's all coming to fruition now. I've learned all the lessons that I need to learn and I'm ready to move up. Bobby's a very experienced fighter. He's been around for a long time. So I'm really excited about this, but it's not the first time I've ran into experienced fighters before and it won't be the last. I think this is gonna be an awesome time for me to showcase how I've evolved over time.  And I've put a lot into this one. And I'm just really excited to show it. Because I want this to be very decisive. I want to get in there and finish him. And I'm excited to see what comes after that. I'm a creature of habit. It's my habit to fight, to be around it, to see it, to do it, to ref it, to judge it, whatever. I just really want to make an impression. I want to go out there and I want to finish him decisively and show that I'm ready for that next level.  to push it beyond there. You know, this shamrock fight coming up, for their 170 welterweight belt, this is the most important fight to me right here. I'm going to take what I want, and I want that belt.  So  you"
}