{
  "video_id": "nGNR_vrP-Ek",
  "transcription": " I  Championship Wrestling and the current mayor of Brooklyn Park, Minnesota, Jesse Ventura. Oh, I see these two know each other. Six, six, six, six. First, I would like you to meet three professional wrestlers and take it from me, we're talking more beef than sizzler here, girls. And first, I'd like you to welcome the master of a move that he calls the Stinger Splash. You add six foot three and 252 pounds, here comes Sting!  Sex, sex, sex, sex, sex.  At 6 feet even and 235 pounds, make way for Johnny B. Bass! Finally, I would like you to meet a man who is considered ravishing and by no one more than himself. At 6 foot 3 and 252 pounds, here is Ravishing Rick Rude!  I am so honored! Do I get to take your pants off?  Uh-oh. Uh-oh.  Dusty Roach did. Dusty Roach, the American dream, Dusty Roach. And signed you up, said you must be a wrestler. And now I'm living the American dream. Ladies and gentlemen, you're about to witness the debut of the hottest... in professional wrestling. Please welcome the one, the only, Voluptuous Vicky! Yes? What do you want to ask? Well, for one, I wanted to ask  Jesse Ventura, why are you so gay? People cheating to win. Well, that's a good question. I'd like to know the answer to that. OK, and I'll be quiet and leave him alone. Tell him, Missy, I'll tell you why. Because for 11 years, I wrestled in the ring and for 11 years I cheated in that ring. Why would you want me to change? You know why I'm ashamed, Judy? Because it's not fair.  Attack is platelets and We've gone through we've had a spleen removed all types of drug therapy and we're still fighting it. So how are you feeling right now?  Three months ago. Yeah. Yeah, you love it, huh? Yeah. Did you have another quick question? Do you want to try the belt? I bet you Rick might let you try that belt on here. You want to get the guys to sign this for you? All right. And did you have another question for him?  Jack.  I want to thank Sting and Ravishing Recruit, Jesse Ventura, Missy Hyatt, Johnny B. Badd, the rest of the World Wrestling, uh, the World Championship Wrestling Gang can be seen on TV. It's syndicated on your local stations. And thank you, Christopher and his dad. Let's shoot the fireworks.  We are here, Smackdown Live in Merida, Mexico, in WWE Universe. I want to finally give you an explanation.  Flamboyant  foreign  See the f***ing grade in English, the f***ing, the f***ing, it's like reality. In Bulgaria, we enhance that flamboyance. And we will be an unstoppable team, once and always. Reality. And we will be an unstoppable team, once and always.  you"
}