{
  "video_id": "nIUEHM0LKoM",
  "transcription": " So  so  Meridian Defense keeps plowing forward Apocalypse series unstoppable until, until you hitting the wall with Scented Tornado and this is the start of the show for today's episode. Honestly, outstanding performance from Meridian Defense on Scented Tornado test. Conditions for it were  really bad because we have this muddy, sticky kind of scent right now because of the moisture in the air. It's really humid and everything. It's winter, but it's not that cold. But still, that moisture created really sticky scent. That doesn't mean that the scent wasn't getting anywhere. The way how the Ula was dropping the scent and shaking the scent off, it was going all over inside the receiver and inside the chamber around  chamber bolt everywhere and I'm absolutely amazed guys that this rifle plowed through if I remember this correctly 20 rounds that's absolutely outstanding performance and finally what happened the bolt jammed the bolt basically jammed in the position like this that the chamber didn't closed all the way in that was around in the chamber so he cycled another round through the chamber but it was not enough to close it and as you can see hopefully  You can see the picture cycling right after I took the dust cover and everything. You can see what kind of garbage get into it and what was happening. Smashed rocks, little rocks on the face of the boat, around the chamber and everything. It's absolutely jaw-dropping that this rifle was cycling. And this is amazing to me. You can overgas the AK and it will chug through almost everything.  this rifle isn't over-gassed. This is the biggest news, right? It cycles perfectly, you can drive it quickly from target to target, it's perfect for the CQB ninja shit workouts and everything. I call that ninja shit. But honestly, if you're looking for that CQB type compact size rifle, this setup delivers. That 14.5 inch barrel with that Romanian donk up front really delivers. This rifle  of course you have that huge muzzle brake which helps you to keep the rifle flat on target I bitch about it in the episodes before, yes the sight pressure is tremendous from it so everyone will hate you on the range if you're shooting next to them but if you're doing this for yourself, if you're looking for that type of the rifle for the quick drills and everything this is the setup which absolutely delivers combined with  that shameless plug with that ACSS Cyclops combo I think so that this is the sweet spot for this type of the rifle you got the Cyclops and you can move it fast and that optic 1x prism works perfectly fine with this kind of setup it really delivers so zero malfunctions other than the stoppage after the 20 rounds on the sent tornado zero malfunctions all kind  of ammo basically whatever is cheap we're putting through it so wolf or tula the wolf of hollow points wolf full metal jacket everything goes through it it cycles great now enough with the bullshit talk let's see what we got underneath of the dust cover I did use the compressed air to blow out that sand because otherwise you've seen the pictures it was a complete disaster  so let's see what we have here guys how this is all looking like and how we looking on the components and I still see some crushed sand insane, insane alright the firing pin is functioning moving back and forward crushed sand on both face I'll wipe it off a little bit but I will leave it I'm not going to really clean this rifle  So far here on the locking locks. Everything is looking good. I do not see any damages tip of the firing pin is looking great and that extractor claw is Perfect. It's all dirt from from the scent, but it works All right. All right, the bolt carrier group the Piston head is looking great. Nothing on it. There is on that channel. There is some mark from that camming channel. There is some mark from  from moving back and forward from cycling and you can see that was a crash track right there at the bottom and other than this everything here is looking good on the bolt carrier so we'll see what's going to happen with this but this is all looking good recoil spring for a second because I want to see if there is any rust developing or anything nope everything here is looking great on the recoil spring  so time to dive into the guts of the rifle still crash racks, crash racks on the real truongan unbelievable as I said it was an unbelievable performance ALG trigger looks great and the truongan everything on the truongan is looking good I'm wondering what's going on inside that ultimac right now we're not going to clean it I'm not going to take it off  bottom of the truion is looking good all the rivets are still perfect guys all the drops and all the abuse everything no sign of any wear or anything look at that the wood is looking still great even after being dipped in the pond in the swamp it's still that clear coat is holding up to you  scratches right now from me banging the rifle here especially for the magazine changes. For the magazine changes the dong sometimes gets on the way but you can definitely work with it. But other than this that wood is holding up. The front end pins are looking good. Yep I don't see anything. You got some rust on the rear leaf. We talked about it that was from the swamp and I think on the dust cover yeah there are spots but since this is the Apache  I think this is blending great. Finally the pistol grip is starting to get some beating so that is aging nicely and the trigger too. So this is getting more and more character. I think the best outcome from the swamp was that this receiver blackened it out and you can really tell right now it has a deep deep character it's looking great. Alright other than that  stay tuned we have to do put everything back together we'll run the no-go gauge and we'll see how this is going to end but so far so good the Meridian Defense keeps flying forward coming back to you with the no-go gauge in a second welcome to Missouri we got rain on but  but it stopped raining, camera should be ok no go gates, express setup, let's roll and that's it guys, no way, not even close, one more time just to be sure nothing and one more time, just for non-believers and nothing so there you go Meridian Defense cleared for another final push 1000 rounds moving forward, thanks for watching, thanks for being with us  And as always, please do not forget to subscribe and hit that notification bell so you guys can hook up with our videos, stay current on the updates and things like this. Thank you for watching."
}