{
  "video_id": "o3H4y1Kgu0M",
  "transcription": " All right you guys so Courtney was joking she told me to get her a cookie cake On the day inside I went ahead and got her a cookie cake. It's really for Obviously it's for Elizabeth, but uh I guess you can have a slice No, it's for the baby. It says welcome baby for the baby No, we're just gonna share with the family everything like that, but anyway, so this is our our postpartum treat If you like your cookie cake I love it, it was so sweet of you  Hi!  That's good just a little more  That's so sweet. Do you like her? How do you like her?  That's mom's phone. That is mom's phone. Uncle David's taking pictures. It's just to show us what the baby looks like when they're hungry and when they're tired.  So who do you guys think she looks more like you  Hey Audrey, she looks like you doesn't she? Yeah, you have some curly hair? Yeah, huh? She's got more hair than Audrey did. Hey Grayson, how are you feeling? Are you excited?  That's what makes your belly button Courtney I think you just blew her mind. I'm gonna be gentle  That's a pretty shirt, so I like it Isn't she so tiny  She decided she was ready to come meet you. Oh Man oh She opened her eyes and looked at you  Oh! Grapefruit go after me.  I love how she says Elizabeth.  That's a pretty cool pillow, huh? Isn't she soft?  We're gonna share with you guys, but not not yet. I'll be gone wait till you hold the baby daddy got it for you. Thank you Cookie for you after you hold a baby You're doing really good Grayson  Well, she's been hearing you guys inside there for months. Now it's Audrey's turn. She looks like Audrey. Yeah, she's just skinnier.  She knew good job put your arm right under her head. So you protect it there? You got to leave your hand your hand has to stay on you can't hold her head up yet Keep it there. There you go She's probably a little hungry and we're moving her around a lot so it's just  She'll hold it. Give her one of your fingers. Give her one finger like this. Give her one of your fingers. Take one finger. Yeah. See, she'll hold it. Be gentle with her fingers, okay? Yeah. Yeah. She gets cold real easy. It's cold, okay?  What do you think Audrey? Is she cute? You love your baby sister? Oh, you want some cookies now. You did a good job. Mama and baby.  We're about to go to bed for a little while. Look at our pretty view out of our hospital window. Get to see the interstate. No, I'm just kidding. Like, look at the pretty lights. It's a cool shopping spree. Oh, and the lights changed. Oh, there they go. Yeah, they change every once in a while. They're so pretty. It's a nice, pretty view, for the nighttime, especially.  you"
}