{
  "video_id": "o4Nqa_Ar5i4",
  "transcription": " The Glendale Library Arts and Culture is hosting its very first MakerFest. This event is to celebrate creativity, celebrate the maker space and the sound space that we have here at the Central Library.  Our goal is to have these tools and resources but to ultimately let people be creative. We have a wide variety of STEAM-based activity stations. We're also engaged in bridging the digital divide and now we're at this new frontier of providing access to the community to all  all of the different opportunities for them to learn and grow and learn something that maybe they don't have access to at home. The stations we're showcasing today are a small sample of what's coming to our libraries in the near future. We're showcasing all of our different spaces, the maker space,  which has 3D printing. We have art supplies for people to come in and do art. Virtual reality, they can come in and learn all about that. We have a reflect space, which is pretty much a museum that we curate every six weeks, and it's great. And the sound space. What we have going on right now is a reimagining  of our children's space. We have some crafting stations to get that art aspect of steam and also that the kids can design their own obstacle courses. We also have a wind tunnel that the kids are having a great time with, putting scarves up through the wind tunnel. So this gives our community a big taste of what's coming in the next few months as we gear up for all of those exciting activities that we're going to have available for them in our  children's maker space. Here at the downtown Central Library, it's about being creative and unleashing that creativity. The maker space is a real springboard, learning and empowerment and education. The Little Bits kits were purchased through the California State Library  Innovation Station and they are a new exciting addition to our children's programming. With customized input and outputs, Little Bits encourages children to be creative, collaborate and have fun. The possibilities of what they create are endless. Today's event is to highlight what we have available to the community and what's coming soon to all of our branches and to further develop the connection with our community through innovative programming.  you"
}