{
  "video_id": "o_lLsDzK-JM",
  "transcription": " You want to support Roland Martin Unfiltered? Be sure to join our Bring the Funk fan club. Every dollar that you give to us supports our daily digital show. There's only one daily digital show out here that keeps it black and keep it real. It's Roland Martin Unfiltered. By going to RolandMartinUnfiltered.com, you can make this possible.  happened to Puerto Rico, which actually is a U.S. territory. And even today, he's talking about taking millions of dollars away that was supposed to be used towards rebuilding Puerto Rico that still needs rebuilding, and instead diverting it for this wall project that he seems to be fixated on. I mean, at what point will we be able to find some adult throughout his administration that hopefully will be able to give people the help that they need, especially in moments of crisis?  the United States plays a special role in the region and the world. One of those special roles is making sure that our trade lanes and our trade relationships are well maintained and protected. The Bahamas does not have the capacity to truly handle this by themselves. The American government needs to deploy an aircraft carrier that can serve as a temporary airport to deploy supplies to the island if it has to.  has not been done already. That's the first thing. Secondly, you know, the way that the president is now shifting funds from DOD, from DHS to deal with his wall, his vanity project, is absolutely atrocious. You know, there's a report today of a school and a military base down there in Fort Hood that's not going to get built because the funds for it was taken and thrown towards the wall. What I think would be really interesting is to see how  the president and the White House response to the tragedy is now taking place in South Carolina, North Carolina, maybe Virginia, depending on which way this storm goes, which are states that he absolutely needs to win in 2020. Absolutely. So we're hoping that at some point when we have some leadership that we'll be able to count on in the future to be able to step up to the plate. But in the meantime, where there is help that was coming in, we'll appreciate it any way that it comes.  video in just one moment.  fine haute cuisine, top-shelf libations, breathtaking golf, exhilarating spa, health and wellness options, and much more, while showcasing some of the biggest names in entertainment. The second annual LifeLuxe Jazz Experience continues to build upon its success and heritage with Jazzing Around Los Cobos, a celebrity expansion of accomplishing its goal of sharing all the finest the destination has to offer, including daytime excursions and mini-concerts, including the spirit of jazz,  and Jazz Sunset Cruise. Confirmed guests are comedian-actor Mark Curry with Gerald Albright, Alex Bugman, Paul McDon, Incognito, Pieces of a Dream, Kirk Whalum, Average White Band, Donnie McClurkin, Sheila, Roy Ayers, Tom Brown, Ronnie Laws, and Ernest Quarles. For more information, visit the website lifeluxjazz.com. Now back to your Roland Martin Unfiltered video.  the next, video!!"
}