{
  "video_id": "ofZXcR-GE7o",
  "transcription": " Hey guys, what's up fam? I'm just gonna give you a little bit of background story on Thailand because as aesthetically pleasing as it was I can't just make a video of Like how beautiful it was  Unreal Place. Where do I start? First of all, I usually bring a lot of equipment. We ended up walking through this jungle once we got to this island. And we didn't know it, but we asked the lady  where to go and she was like a mile that way. We go that way but it was actually not that way it was that way. Through this luscious jungle and we were island life in it right like bikinis and no shoes and so I'm just walking through the jungle carrying all this filming stuff.  It lands on me, right? A mile or less? Yeah, right. I wish I had pants. Someone tell me a story. Uh, yeah, she did tell us, hey, walk through the jungle. You need shoes and bug spray. You're going to get eaten alive by spiders. Don't mess it up. Not chill. Can we keep going? That is terrifying. We're just all like running and freaking out, trying to get through the jungle. And we drop this.  in the jungle. I didn't realize until I got to the top and I was like, okay, wow. But we went back the next day and we actually found it! We're screaming so loud. I don't think I got any of that on film, but we couldn't use it in the end because we're missing like another little piece in it, but oh my god, it was so cool. We stayed at this one place. It's just bamboo. The whole thing is bamboo.  Favorite parts about Thailand was that you could get on your own little private ferry yacht thing. Ride around and almost fall off. Whoa! Cool, nice. Oh, careful. There's a tire swing, dude. There's a ladder. There's a cave.  Yeah, the rest of our trip was great. We saw monkeys. Sometimes they would just attack you.  We got to see this part of the world it was great. So yeah if you're thinking about going there I would absolutely recommend it. It's unreal.  And of course there were the moments where, you know, we had to try to make friends, we would serenade people. We were the best performers and we made our own musical instruments to impress the boys.  That happened. Gotta impress them. You got to. So stay tuned and travel on. Bye. Hi. Hey, hey, see you."
}