{
  "video_id": "oj_vKVJHv-M",
  "transcription": " Oh  Good afternoon guys.  Dartmoor just at Post Bridge at the moment on the old Clapper Bridge and yeah just parked up and gonna head on up to Sitterford Tor it's a nice day joined by Dave today as well he's coming along  Yeah, so yeah, go for a walk out.  Here we've got Heartland Tor just in the distance  There's Fenworthy Forest, over in the distance there. And there we've got Sitterford Tor, which is where we're heading. But I'm going to go and check out the grey weathers  Stone Circles first, which is somewhere at the base. Probably around down there somewhere, more in the valley. But yeah, we'll go and check that out. Here we are guys, Great Weathers, Stone Circles. And there's one here and there's another one.  Just next to this one, these have been restored. Apparently it's possible they're as old as Stonehenge. So a few thousand years old. Pretty amazing really.  The distance is the other stone circle. And we are basically going to be following that wall up, there's a pathway which will take us up to Sitterford Tor and find a spot up there to camp tonight.  Just about halfway up on Sissaford Tor at the moment, just thought I'd give you another view of the Greyweathers stone circles from here.  there's gonna be some nice views up here I think Siford's about 400 odd how high up is it? 538 metres high so around the same as Cosden height I think so yeah onwards and upwards  Now we're back on top of Sidi Fatorre, the direction we've come in. And we've walked all down through the valley here to the Grey Weathers and then up here. So we're just thinking about whether we're going to camp here or not. We haven't actually got any water yet. And there is a stream, just if we follow that wall down, there's a stream.  either pitch up, walk down or just walk down there and find somewhere down there to pitch up. But yeah, beautiful views up here, absolutely stunning. I'm happy it's clear.  Alright guys, well as you can see we're all pitched. Unfortunately Dave's come down ill.  He's not felt great but he's been determined to pitch up and stay the night. He's not great, he's really quite ill so I'm not going to let him walk out on his own. We're just going to have a quick hot drink and then we're going to pack up. We've not got any gear out, it's only the shelters that are up so it's not a problem.  back time wise it's getting on yeah so it's quarter to five I'm surprised it's still as light as it is for quarter to five so by the time we get going it's definitely gonna be night walking so be interesting for me because it's been my first night walk on Dartmoor so you know we've both got head torches so it should be fine so yeah just get Dave back to his car and get him home so yeah just so I can have a quick drink and a bite to eat  and then we're going to get on so I'll see you guys next time"
}