{
  "video_id": "oNToiUmx4RE",
  "transcription": " What's good you degenerate f***er! It's currently 4 in the afternoon and I'm out here in Pleasanton getting ready to do some good old pond fishing.  My plan was to hit up the Delta, but unfortunately I got a flat tire while I was driving on the freeway So that plan is no longer in effect I have thrown that plan out the window and honestly I feel like the only reason why I got a flat tire is because of this ugly-ass shirt this Stupid-ass shirt it gives me bad juju I swear this Chicago Bulls shirt gives me bad mother fucking juju Oh  I was wearing this stupid ass shirt my car got stuck over a parking curb So you best believe that I ain't gonna wear this shirt anymore I'm gonna burn this stupid ass shirt as soon as I get home cuz I'm a hundred percent sure now that this shirt is a Goddamn curse now with that being said my plan for today is to try out this new bait that I ordered from Tackle warehouse. It's called the mega bass dark sleeper and  Super excited to try it out. Okay. That's all I have to say for right now So I will see you ugly sons of bitch in a minute  I'm surprised I'm not getting any bites whatsoever. This cheesy stuff is great for frog fishing. But so far, there's no sign of life. Maybe the bite will pick up later on in the evening. Make a few more casts and then keep on walking.  Come on don't lose it. Well shit. Just lost my first Megabass Dark Sleeper. Shit cost me six bucks man. That's six dollars down the drain right there. Oh my god. Got snagged. Made a shitty cast.  God damn it There's one yeah Feels small doesn't feel very big but it's a fish. Yeah, come here  The tricky part of getting him out of this, there's so much grass. Uh oh. Come on. God damn it, he's stuck in the grass.  Slowly pulling him in. Slowly pulling him in. Without applying too much pressure. I don't even know if he's still on to be honest with you. I think he still is. Yes he is. Okay.  There we go, there we go, alright. Slowly moving him in. Finesse is definitely not the best option when it comes to fishing this particular pond because there's just so much vegetation at the bottom. But these fish are extremely finicky so the only way to really catch them is finesse. And this is the first fish that I've caught on the Mega Bass.  Dark Sleeper. Hell yeah! Take a look at that! Ain't a biggin' but hey, fish is a fish. Dope! Alright bud, thanks for the fight. See ya!  I'm just  I mean take a look at this man. Take a look at the tire. Let me show y'all what's going on Or what it looks like I should say oh my god Take a look at this man. Take a look at this shit Can y'all believe that huh look at this flat tire flat mother tire it's a spare tire and somehow I I don't know  I don't know what happened, just somehow it became flat. My tire is flat. I don't know how the hell it happened, but now it's completely just useless. It's a useless spare tire. God f***ing damn. Alrighty, the tow truck has arrived. Only took 10 minutes, so thankfully I didn't have to wait very long. Oh my god. Yep, alright, the guy is moving my car over to the towing unit.  thingy majiggy the towing ramp whatever you want to call it oh my god it has been a long day for me a long f***ing day and I just cannot wait to go home I'll see y'all when I get back okay folks I'm back home now so that's basically gonna wrap it up for this video if you were thoroughly entertained by the shitty luck that I had today please hit the big red subscribe button if you haven't already and  and turn on your notifications so that you'll be notified every single time I drop a new video on Wednesdays and Saturdays. Peace out, mother-  you"
}