{
  "video_id": "otnU38TLMJ4",
  "transcription": " I'm Nicole. I'm the Executive Director of Hope Unlimited Family Care Center, where we are empowering families and supporting our community. But what we're really passionate about is helping families not feel alone. Not alone is universal. You and I experience it, but we are all a part of the solution. It's more than a donation. It's even more than prayer. It's coming alongside a mom-like faith.  stand in front of me in front of my desk and I'm like we're gonna call Hope Unlimited today and she was excited yet she was nervous. Hope Unlimited Family Care Center, this is Kim, how may I help you? Hi, this is Stacy and I've got a student here with me at McCracken County High School. She just found out she's pregnant. Not having a lot of resources, being scared, not knowing where to go, not even knowing if she had insurance or anything, even if she did, I wanted her to know that there was a safe place that she could go that she could  talk to people that they could walk with her at every step of the way through this pregnancy. I had expected some kind of help from them, but I didn't realize that it'd be as much help as I had got. I had ended up with loads of clothes for my daughter and a bunch of knowledge, like the sounds of an infant when they cry mean certain things. The most important thing that I had gained from doing the Hope Unlimited  Learn to Earn program was that I had the confidence to be able to raise a infant at the age of 16. Faith felt like family to us. We just loved her and we wanted her to succeed and we wanted to see how she was doing in school every week and we just wanted to see how she was coming along. It's so important to me as a mentor to be able to make a difference in somebody's life and I really think that that happened with Faith. Now I am in college for my Human Services degree and  and I have been able to manage my time a little bit better, as well as provide some stuff for my daughter better. This was one of the best things that I could have done for me and Audrey, and I'm so glad that I was able to do it. There are a lot of moms and dads just like Faith. They're in front of you at the grocery store. You sit next to them every Sunday at church. They're your neighbor. Life was not meant to be a journey of solitude, but one of community. You can help.  with Hope Unlimited Family Care Center and together we can help moms and dads not feel alone.  you"
}