{
  "video_id": "Pcb8L2FmAKI",
  "transcription": " There's ten punters. So make sure there's plenty of booze and lots of sweeties. OK? And I'm talking about the good stuff. Which girls do you want? Er... Jodie, Lara, Abi. What about Zuza? No, Neil shifted her to Liverpool. Her mum set up some local campaign, Where's Our Little Girl? You know. So he thought it was safer to shift her. But that's still only three. Three's fine.  and our little Bethany is gonna be the star attraction. Hey, babe. Just talking about you. Just saying how amazing you are. Do us a favour and make us a coffee. You sure she's ready for this? She better had be. She's cost me enough time as it is.  Not sure I should be serving you. Eh? Special constable. Don't really get on me all that. Well, I hope I can be an exception. You enjoying it, then? Yeah. Just finding it hard sometimes. You know, trying to separate from being a special and being a mate. Like with Bethany? Yeah. She's falling out of her mum big time, and I know it's got something to do with Nathan, her boyfriend. As a mate, I'd go around and warn him off, but as a special, I can't. She wouldn't thank you for it anyway.  I just wish she'd never gone near him or his stupid tanning salon. Tanning salon? Yeah. The one on Corporation Road. Are you OK? Erm, yeah. Yeah, I'm fine. Can I take my break now? Yeah, of course you can. You OK? Yeah. Hiya. Erm, please can I have some of that shepherd's pie to take away?  Yeah, please. Hey, have you heard Adam's been arrested again, yeah? Yeah. Oh. So he were the one that hurt Ken? I'd make a rubbish copper. I always thought it were Daniel. And why would you think that? Cos he's got a right temper on him. Do you know what he thunk, mate? Oh, he was bad as Adam. He's trying to pin it on him as well. Oh, so a member of his own family even suspects him? Bye, darling. You are gonna knock them...  Can we not just go off somewhere on our own? Well, let all my mates down. I'll tell you what, next week, I'll take you somewhere special. Just the two of us. Really? Promise. But meanwhile, let's have some fun. Here, have some of this. What is it? Oh, it's only like that Valium that you had before, but you can't get this on prescription. Here, I'll sort you some for you.  Er, no, I'm all right, thanks. Drink instead, then? Yeah, OK.  I never thought I'd see you here again. Missed me, have you? Yeah, like a bad rush. Then why are you here? Come to settle your debt? I don't owe you a whole lot. I'm here to tell you to stay away from Bethany Platt.  Come on."
}