{
  "video_id": "peIVJLTnbsY",
  "transcription": " Rise and shine,  That's right, the orange is bursting with vitamins, the ideal fruit to have before exercising. And now, a lesson in Kung Fu. Just like Kung Fu, oranges come from China.  The skin of an orange is very thick and must be peeled. My skin's very thin, not like you and your rhinoceros skin. Its solid skin protects it from bumps. That's why I can jump all around! Yahoo! Yahoo! Yahoo! Yahoo! Me too, I can jump all around. Ouch! Well, I guess not in fact. An orange gets all its energy from the sun and takes a full year to ripen.  Oh, boy, oh, boy, a year's a long time. The orange's color is, uh, orange. Yes, but it can also be red. Watch out, vampire! Of course not! Don't be afraid, it's my cousin, the bloodhorn! Whatcha doin', pal? The orange belongs to the citrus family, just like the lemon, the clementine, or even the grapefruit. All right, now, time for the family portrait. Oops, sorry.  Oh, strange. Huh? A gift? Did you know that for a very long time, one of the best Christmas presents was... Popcorn! Popcorn! No. A deodorant? No, no, no, not either. It's round, it's orange, you can eat it. Oh, a pumpkin? Smaller. Oh. Oh, I have the slightest idea. I don't know what you're talking about. It's round, orange-colored, and used to be super rare. That's right. A long time ago, oranges were extremely rare, so it was very precious. But how did we play with it? We didn't play with it. We ate it.  Let's look at the various ways we can savor our friendly orange. We can have a nice glass of orange juice. When it's hot outside, there's nothing like orange sorbet. Or we can cook up the classic French recipe, duck à l'orange. Phew! Is it hot or quack? Oh, wait! I still have three questions for you. Which country does the orange originate from? Yes, it comes from China.  How long does it take for it to ripen? A year. Bravo! You're good! And what's its family name? Citrus, you got everything right! Say there! I didn't see you doing any exercise. Now it's your turn! Come on! And one, and two, and three, and four, and one, and two, and three, and four, and one, and two, and three, and four, and one, and two, and three, and four, and one, and two, and three, and four, and one, and two, and three, and four, and one, and two, and three, and four, and one, and two, and three, and four, and one, and two, and three, and four, and one, and two, and three, and four, and one, and two, and three, and four, and one, and two, and three, and four, and one, and two, and three, and four, and one, and two, and three, and three, and four, and one, and two, and three, and three, and four, and one, and two, and three, and three, and four, and one, and two, and three, and three, and four, and one, and two, and three, and three, and four, and one, and two, and three, and three, and four, and one, and two, and three, and three, and four, and one, and two, and three, and three, and four, and one, and two, and three, and three, and four, and one, and two, and three, and three, and four, and one, and two, and three, and three, and four, and one, and two, and three, and three, and four, and one, and two, and three, and three, and four, and one, and two, and three, and three, and four, and one, and two, and three, and four, and one, and two, and three, and  you  you  you  you"
}