{
  "video_id": "peJoONtOeOg",
  "transcription": " Hello, I'm Mary. I've been working here for over 20 years now and I also manage the brokerage on the site as well as helping with everything else around the yard. We're now going to take you for a trip around the yard to see what brokerage boats we have for sale. This is a Catfisher 28. We've just lifted her out the water for the owner so she needs to be cleaned off. She's on the market for £39,950. She was built in 1977.  make a brilliant liveaboard boat or also it would be lovely to go through the French canals on and she has loads of space inside. This is a Jeuneau Lagoon 42 foot. She was built in America in 1994. She's on the market for £69,000. She does need a bit of work doing to it to improve the interior mainly but it'll be a beautiful long-term cruiser liveaboard blue water cruiser.  So here we are down below in the Lagoon 42 which you've just seen from the exterior. As you can see she's lovely and spacious inside. Nice little galley, plenty of room and storage and a good double sink there.  to help things along. Double aft cabin, they match either side. The current owners converted them from a double berth into the bunk beds to suit their sailing and their family, but this would be quite easy to rectify and put back as double berths. Okay, twin heads head on both sides, so this is in the port hull. Nice tidy looking head with a shower sink tap.  Another cabin up here in the starboard hull up forward. Second aft cabin again with the double bunks. This is Stardust. She's a Twins 36 designed by Pat Patterson and built here at the Multi-Air Centre in 2003. She's a lovely big cruising cat which is beautiful for long distance cruising, liveaboard, blue water sailing.  This is Aelian, she's about to come on the market. The owner had her built from new so as you can see she's an older boat but she'd still be great fun for somebody who wants to race and I haven't got a price for her yet but that will soon all be on our Multi Health Centre brokerage page. This is Petronic, not our normal brokerage but we're selling it for the  She is a gentleman's leisure yacht built of larch on oak and was built at Appledore in 1947. She must have some amazing stories to tell over all the years. She is on the market for £12,000.  the adventures. This is Allie Kat, she's a Prague Quest 31. She's an older boat built in 1979 but one of the benefits is she has got a recent new diesel engine. She's on the market for 22,500. Nice family cruiser, again another boat that due to its narrow beam will go through the canals if that's something that you fancy doing. This is Bedouin, she's a Fontaine Pajot Antigua Maestra.  She's 37 foot long, another good-sized cruising cat who would take you all over the world. In fact, her current owners have done just that with her, but now having a change of lifestyle. She's on the market at £85,000. We're on board the Fontaine Pajot. Nice and tidy down below and very, very spacious. Lots of bright light coming in.  double bunks in the aft and then you also have two doubles forward as well with heads in between both sides of the boat. Again really very tidy and clean looking down below. You can see on the map here laid out on the cabin table where the boat has  She has been to, so she has done some pretty big passages and been around quite a lot making someone's dreams come true. We're on. This is Hynou, I've only just been asked to put her on the market this weekend. She's a Fontaine Pageaux Maldives 32. She's got new sails last year and the standing rig is only three years old.  She's a really good performance cruiser and will also be a great deal of fun for her family. She is on the market for £58,000. This is the Powercat 525. She's a lovely boat in really good condition. You can see really nice pictures of her on our website. She's on the market for £20,000. She was built in 2007 and she's got twin 44-pile outboards. So a great fun boat to buy.  the end of the week. She's a Dragonfly Sport 28. She is built in 2011 and she will be on the market for £119,000 with VAT paid and she'll be ready for viewing in the new year. For information on all our boats please look on our website www.multihealthcentre.co.uk or give us a call on 0175 2823 900.  Multi-hull centre boatyard in Millbrook, south-east Cornwall. Every shape and possible size and type of catamaran that you could ever imagine.  so  I'm"
}