{
  "video_id": "Pi0A7COd8Ew",
  "transcription": " Hey what's up hi how's it going?  I just finished up my workout for the day and Zeke is laying with me while I stretch. He's more or less getting in the way while I stretch. But he thinks he needs loves right now. He thinks he needs wubs. Calvin's been a kitty all morning. I got my kitty and my puppy. You're a cute kitty.  We're gonna get showered up though so that we can go head on base. Yesterday I think we stopped at the exp and got Travis some paint for the cornhole boards he's working on and he decided he wanted a different color so I'm gonna go and switch those out and then go to the post office because we have another package. I wonder what it could be Vicky. I wonder what it could be. You're so cute. You are so cute.  What are you doing?  When it's just gonna stop anyways because that would kind of be a waste Travis has been in the woodshop all day working on someone's going away gift. He's building Something that's not cornhole boards if you can believe that I don't know what this package at the post office is going to be though So I'm gonna run inside and get it because I'm really curious. It says it's a box It might be something Travis ordered. I don't know. No, do you want to go? Let's go Why are all the pens at the end  Thank you. I don't know what it is. Something your dad ordered. We have mail. Yay. Maybe... Open sesame. There we go. We are now at the BX in the hopes of returning this spring paint for Travis, but I'm not sure if this is something that they will take back.  or if they're gonna try to fight me on it. I don't know if there's a way for them to know if it was used or if they can just tell it's still brand new. I don't know, I feel like I'm gonna have to fight somebody for this. I just need to change red to yellow. I could go and put it back on the shelf, but I'm asking for your permission first. I'm trying to do this the right way. Let me do this the right way. So we'll see if I actually have to fight these people or if they just let it go smoothly.  a little bit easier than I thought it was going to be. I guess all she really had to do was look at like the spout part of the can to see if any had come out of it and obviously it hadn't so I traded him in and now I'm getting yellow and then we're good to go because then we need to do what Calvin? Calvin wants a snack. Because I'm pretty sure he's waiting on me to move forward on this cornhole board, excuse me dog, Travis needs me to draw California on this one.  Can you go lay down please?  videos for a while now. So while I'm trying to do this, I'm gonna start catching up on Got Love's videos because really they kind of take priority in my video watching. I watch them first. Hopefully I can get caught up on someone else's. I don't even know where to start because I literally haven't watched anyone's videos in probably two or three weeks. But this takes precedence, so I need to get this started.  So I'm not entirely sure if I like how this turned out or not, so I'm going to draw on it with Sharpie to get a better idea. Because it's kind of hard to see in pencil. Plus I messed up a lot.  So it's not perfect and I kind of screwed myself up with that angle there and made this kind of too wide at that angle it should look a lot better So we'll see I don't really know I drew a Washington one before and it turned out decent So hopefully this will look the same just don't look really close at it like don't know exactly what California looks like like don't study it and it'll look okay because if you just know like the general shape then it looks like  But if you know exactly every nook and cranny and yeah, just don't do that. It'll look bad, but Calvin's been pretty quiet now that I've noticed Probably because he's sleeping Just as I suspected Good thing I already vacuumed I actually moved Travis's thing here It used to be up on this table, but as you can see we're already accumulating way too much stuff here, so I moved that  because it's so cluttered. Like, there's just too much stuff and it's driving me crazy. And I don't know what to do with it all because a lot of this stuff is like, I don't want to get rid of because I know we'll have more space for it later. But right now we don't have the space for it. So good thing we're leaving in less than two months. I love this shirt. I love the bows with my bow and my bow, but it has a little too much chest area reveal.  cleavage yeah I don't have much of that but I feel like I'm constantly pulling this little bralette thing I have up and I don't I don't want to have to deal with it anymore because really the rest of the day all I'm really doing is laundry and then probably making dinner and then probably just hanging out while Travis falls asleep on the couch but I don't feel like I need to be like dressy like this anymore because I don't think I'm going anywhere else so as cute as I think I looked today I don't really need to look  like this anymore. So I'm actually gonna change out of this shirt, probably put on something else. I don't know. Obviously if I'm changing I'm putting on something else, but I don't know what I'm wearing quite yet because all I'm really gonna be doing for the next hour or so is putting away laundry. Fun. So fun. I love doing laundry. This boy is still sleeping and it's almost 7 o'clock. From one series of unfortunate events to the other. Yeah, we're now sitting in my super loud car because Travis put the stock exhaust back on here so we can JCI it.  But this exhaust has a hole in it. So it's really really loud So we need to fix this exhaust so we can JCI it because the other exhaust that's on it That sounds really well doesn't have a cat in it. So it won't pass emissions so we can't use it But Travis is done with his tattoo now and he met us over here at the seawall where Calvin's gonna ride his bike I think his arms wrapped up though, so I can't see it. Oh, he's looking at the exhaust. Oh Yeah, oh, yeah, it's just  Open down pipe. It was like shaking this. Yeah. It's because it's directly right there. Yeah, it was so loud. I was like, oh God. I thought I had a rock or a nail on my tire, but it was just a rock. That's good. It was like, you're like, no. Yeah. So this is gonna, I'll let the, I'll go to the gym this weekend. But I thought we were going to make it down here in time to see the sunset because when I walked outside, I noticed there was some lightning in the  The sky was orange when I left the house. It was crazy pretty. Ready to ride your bike? No it's not, but it's too dark for this camera. The quality would be none. Oh they're in the back. Calvin's gonna ride his bike though and if you have me on snapchat or Instagram you will see that in my story but it's too dark for this camera now so for now that is it. We'll see you when we see you. Bye!  ♪ I had your lip, I feel it still ♪"
}