{
  "video_id": "PMzvDRDYCr8",
  "transcription": " Okay, just start. Okay, so we're gonna talk about greatest common factor. Factors are numbers that when we put together give you a product. So what are these numbers called? It's a factor. They're factors, very good. And then this answer is called what? Jorge? Wait, can I get it now?  What's this number called though? I know it starts with a P. Fraud. Fraud? Fraud. Go ahead and write it. So if I wanted to find the greatest common factor of 12,  and 24. I'm going to draw my Venn diagram. And I'm going to list all my factors of both. We know what is always a factor. What's always a factor? Lelani? 1. 1, very good. So 1 times 12 is my first factor.  Amai, go give your Team 10 team tally. Is 2 a factor of 12? Yes. 2 times what? Count in your range. 2, 4, 6, 8, 10, 12. So how many times did we just skip out? 6. 6, very good. So 2 times 6. Is 3 a factor?  You have three times four. Go ahead and write it. Good job. Are you? Go to the next page. Okay, now I've done all my factors for 12, so now I'm going to move to 24.  factor no matter what. Josh, what's always a factor? One. Very good. One times 24 is my first one. Is two a factor of 24? Yes. Thank you for raising a quiet hand. Two times 12? Yeah. Is three a factor? Let's see. I know three times five is 15.  18. 18. 3 times 7? 21. 21. 3 times 8? 24. Yeah, there we go. So 3 times 8. Did you want them to put their initials on each card? Yes. Yes. All right. How about 4? Is 4 a factor?  I know 4 times 5 is what? 5, 10, 15, 20. And 4 times 6 is 4 more. 24. Yeah, 24. That's what it is. Can you borrow from my neighbor for now and then I'll get you some? My neighbor's already using it. Can you give me one minute and I'll be right back with you?  Alright, so now I need to figure out what's in common. Is one common? Yes. Always. Is two, just two on both sides? Yes. Is three on both sides? Yes. Is four? Yes. Is six? No. Yes. Is twelve? No. Yes. So now that I have my common, what is the greatest?  Twelve. Twelve. Good job. So twelve equals... Okay, you can cut it, Taylor. Thank you."
}