{
  "video_id": "PpmCLcSbvMc",
  "transcription": " So we do hope that you like this video and let's get into it.  I got a book from Jozma's Cafe  This is what she's getting for my birthday. Dr. Watson. She's also getting a Sherlock. Yes, in the back. It's coming right to this one. What was it? The Sherlock with the violin. I'm getting that from somebody else for my birthday, which is Tuesday the 29th.  It looks exactly like your t-shirt kind of exactly You can put it on your car now, it's wrong door. I mean you should get both stickers Oh Like you should get that for your keys, oh my goodness Get it for your keys you need a new key thing. I just call you that because  So we are currently about to check out Books a Million. But Janie and Felicia are taking an extremely long time. So yeah. There's Janie. I don't think they have the book, Janie. Happy birthday, Felicia. Felicia.  you're so happy you can put it on your shelf? you gotta make some room on your shelf you can take it out of the box? no you can't enjoy it when it's in the box nobody cares about collectibles  We are now leaving Books a Million. So currently we are at the mall and Felicia loves her keychain thingy so much she's putting all her keys on there so we're gonna be here a few minutes before we go in. We're about to go eat a Chick-fil-A, maybe go to Bath and Body Works and maybe a few other stores but we don't know yet so we'll keep you updated. Also I'm tired.  We are letting Felicia try on our dress for Easter. So, she's trying on our dress at the moment. Let's go see her dressing room. Hey Felicia, you almost ready? The vlog wants to say hi to you. The vlog. Felicia, let's look at the dress.  This is my outfit of the day. That's Felicia's beautiful gown. That's really pretty, Felicia. Okay, turn around for the camera. And it goes pretty well with the hat. I think you should get this one.  The subscribers want to know what you ended up with. I'm not getting this dress. It's mine. It looks really awesome. And the hat goes really well with the colors. Do you like my artie?  Oh, yeah, it's a dress about dress  I might get this pen. I asked if they had stationery and they said they don't have proper stationery. they have scrapbook paper but they don't have proper stationery.  Sad face. I'm sorry. But, okay, I carry this camera around. Gosh, I think I have my bracelets. Hold on. I carry this camera around. People think I look really weird. But I have this hat on that has like two things in the back and they say nothing about it. Really? I don't understand that. Time to go find Janie. What am I going to look this up to? How much it's going to cost? I don't know how much it's going to cost. I'm going to have to find out.  I see Janie. I see Janie. I've been watching this video for a long time. You're not twins. I saw that and I just thought it was Eliza.  what?  I'm not going to call you.  We hope you enjoyed this video all in comment down below if you would like to see more of these if you want to see more of logs well just be glad to put up more and If you love this dog like this video, this is Janet. This is my dog. She's very fat okay, so like comment subscribe and  Kill your friends!"
}