{
  "video_id": "PrRzcMZhbko",
  "transcription": " Hi guys and welcome to my channel. So on today's video I am going to do a crochet braid on this big lady's hair. So her hair has been washed, conditioned and is ready to be braided. So if you want to see how we get on with it,  this stay tuned let's get started so we're gonna be using this 3 trace braid for crochet and the latch hook. What I have done is 2 inches in color 1B like so  I'm going to make a sandwich with the leftover bread.  So what I'm doing here is I'm taking the braids and interjoining them from one corner to the other. That way I can have, she can have a middle part and side part. So if she chooses to wear the hair under the braid,  side and she can have a part on that side or either side she likes and yeah I'm doing this on this side and when I'm done with that side I'm going to go ahead and do it onto the other side as well just like you can see  So it's not much left now once I'm done with that you will see what I am on about Then I'm gonna go ahead and interlock the braids So that it will lay as flat as possible So if you see what I'm doing right now, then you get the hang of what I'm talking about Just like that  it took a while so this is what I'm trying to do what I was trying to achieve. So this is my finished braid pattern. I try to lay it as flat as I can and that's it.  So this is what I've done so far So I go ahead and separated the hair in little sizes because I didn't want it to be too full so once I crocheted on I'll go ahead and Knot it like three or four times For that extra security then I'll go ahead and  and twist it because some of the hair this you know the synthetic hair they tangle quite easily so with this method you can be able to run your hand through it without it tangling so much so basically separate in small size crochet it on then latch it up and interlock it about three to four times  Then I twist just like so  Hello!  I  So I'm showing you what I've done here. Still the same process but when I get to the front I sort of interlock the only one strand of the hair so that it can have that seamless look. And I'm just going ahead and twisting as always because I twisted every one of it.  So just to get it looking exactly the same so as you can see just one strand and I interlock it and then I go ahead and twist it So here is the finished look as you can see you can't see the lines of The crochets it's completely seamless it looks flawless  And the hair looks amazing. Yeah. And turn. You're too fast. Why is she laughing?  Thank you guys for watching please like and subscribe and comment down below what you'd like us to do next. Bye!"
}