{
  "video_id": "pRz8yjRZ7nM",
  "transcription": " Hello Earthlings and Pixel Peepers I'm going to do a three part series and this is the first of it, part one. I'm trying to justify in my own mind I bought a new editing program for photography  called I-1 Photo Raw 2018 to replace Lightroom. Because I don't want to pay $120 a year subscription for Lightroom and this program was almost a hundred bucks. I own it forever. Might have to pay for upgrades in a year or two, who knows. But anyways, it's paid for, it's a done deal. And I'm gonna compare editing photos with Lightroom.  I still have lightroom for another 30 days or so or 60 days. This is an abstract picture I took last summer out in the yard of some fungus lichen growth off a tree. So it's really abstract. I thought it would be a cool picture to edit. I edited it with Lightroom, Canon's digital photo professional 4 and the new ion1 photo raw 2018 programs.  It turned out in you decide which is better Who knows here we go? Okay, here's the original picture right here of a lichen Growing on a tree outside the house here, and it's basically focused in right here pretty good Shot with a macro. Let me show you the information On the lens camera it was taken last  July 1 30th of a second shutter speed at f 5.6 ISO 200 73 millimeters with a Canon 80D using a Sigma 18 to 250 millimeter that's actually a telephoto macro lens so that's the original picture out of the camera and I edit it with  Lightroom Canon digital professional 4 and on one photo raw 2018 trying to figure out which Program I want to use whoops Okay, let me get rid of this Okay, there's the original picture right there Let me shrink her down and get her out of the way and I'll show  the edits. This edit right here was done in Lightroom. There's the original. There's the edit. So it was really pretty much focused right in this area here. I think it turned out pretty good. All three programs Lightroom, Digital, Professional 4, DP4,  and Ion 1 for the raw. Took about the same time to edit it. It didn't take me but a few minutes to make these basic edits. This one is Canon's edit, which I really like the colors in that probably the most but it's not quite crispy like Lightroom. And here's the Ion 1 edit.  Honestly, I think All three look pretty good, but this one I'm wanting light room look better in my opinion this one's got better color of course the Canon Color science and editing program is probably always gonna have the best color unless you really get tweaking But I would say Light room or on one  Wins this little test and I'm one is a program. I want to use I already paid for it So it's mine now Canon DPP for is a free program. So I'll always have that one anyways Lightroom is $10 month $120 a year Three years it's gonna cost me almost 350 bucks to use lightroom this one I paid about $100 for  It's paid for forever And I already like using it. It's I cannot if I tweaked it a little bit more I think Lightroom Did the best job on this one? But jeez, I don't know What do you think? There's the original?  Lightroom here DPP for there on one photo raw there I'd say it's that one or that one My next test is gonna be a landscape where there's gonna be a bunch more dynamic range involved And I can tell just by these abstract this abstract edit  that I can definitely get by with on one photo raw 2018 and not use Lightroom in this type of edit but we'll see what the landscape talk to you later bye  you"
}