{
  "video_id": "PtZ3Z-ekdF0",
  "transcription": " Hello, Wishcasters. Hello, Emirates wannabes. There's been a request on our group. We have a group going on for Emirates wannabes, people that want to join Emirates. The topics that you asked for were CV building and tips and tricks on joining Emirates. The first one is going for an open day, not going for invitation only interview, because if you go for an invitation only interview, what's going to happen is you might not get  Recruiters might not even read your CV.  and also show your personality in those 20-30 seconds while you introduce yourself. The smile, the body language, the way you walk, your clothes, the way you speak. These factors are the ones that win. The CB comes later. Having the opportunity to show them the real you, the way you look and how awesome you are is the best opportunity to pass.  open day, the second thing that you do once you step into that room is you have to hand over your CV. And when you hand over your CV, your CV better be good because if it isn't good, you're not going to win that huge competition with all the other candidates. Your CV has to be really easy to read, really easy to understand. The most important skills have to be at the very top. So avoid putting things that are not relevant to your job, for example, your hobbies or how much you love animals or I don't know, your sports, or if you  you're really good at, I don't know, painting, discard these things and include all those customer service things that you've learned at your previous employments. Or if you know anything in the medical field, like if you're a paramedic or if you've done first aid training or if you're a lifeguard, all I'm saying is put at the very top the skills that you're the best at and that are relevant to the job. And then just right below, try to put like the languages  you  Make it easy.  they're not gonna choose you. If you're going for an open day and you have to impress the recruiter, not only your CV has to be good and not only your body language, your attitude, the way you look, the way you smile has to be good, but your clothes have to be good because they reflect your personality. I would try to show the best I could to the interviewers in order to get that job. If I don't go with nice and professional clothes, it means that I don't really care. It makes a huge difference if you have like an iron shirt  shirt, thick shirt, big color, you have a black tie or a blue tie in the same color of your jacket. Pants and your jacket have the same fabric. For example, that makes a huge difference. Your watch is a classical watch, not a sporty watch, maybe like a leather band, brown leather band. That means automatically that you're putting interest into this company. You really want to join it. So definitely they will be willing to hire you because you've impressed them. They appreciate that. You can find these guys  I  But with your friend. If you go to an open day with your friend, you won't be so stressed. And the main reason why you don't pass an Emirates interview is because you look stressed. Why would Emirates ever hire someone that is stressed when they're getting a job? They don't even have it yet. They're not losing it. They're not in front of any clients or in front of any customers. They're just in front of one person, in front of one recruiter. So if you're stressed there, why would they hire you? But if you go with your friend,  Your friend can relax you, can ease you up. You might end up even enjoying the open day. You'll be able to focus more on being productive, on not being scared, on being kind of happy because you're with your friend. You're hoping that he passes, he hopes that you pass. You're smiling, you're more positive, you have more energy. This link in the upper right corner is our Masterclass series on joining Emirates. It's free, it'll always be free, and it's a gold mine. Trust us, follow it from the beginning to the very end.  Let's take a look at everything we've said so far.  about it once you join with your friend laughing about your interview and you being afraid. Do these four tips and I'm quite sure you've done at least 70% of the whole interview. Then it's up to your skills and your previous experience in getting the job. Enroll in our free classroom on Emirates Wannabes Forum. We'll be happy to answer any of your questions and offer you mentorship. We have mentorship programs organized by business class members, first class members, even economy class members. We're all there free to help you guys join Emirates.  Every time someone says God bless you Orlando, it just makes me feel like yeah, this is what I want to do. I love it. I just hope to see you on the other side with you telling me how you join and how you love the job. So that's it for today. I hope you enjoyed the video. We have a lot of content coming out on Wednesdays and on Sundays. I hope I was able to help you. I hope I inspired you a little bit more. Like every episode, I inspire you a tiny, tiny bit more for you to join Emirates. I made it.  you can make it. I mean look at this guy. I look like a homeless. I have a beard, I'm chubby. If I managed, you can manage too. And don't forget, if you ever come to Prague, let me know. I'm here, we can go for a walk, we can have a beer together, enjoy the view somewhere. I know so many secret spots and locations in Prague. I could be definitely a really good guide for you. Enroll in our classroom on Facebook, it's free. And I'll see you next time. Bye guys.  We want to thank you for watching till the very end. We thank you for your support and following. It's oxygen for us.  footage from other days that I've been here and there it goes.  I  you"
}