{
  "video_id": "pXEA_KJgRmU",
  "transcription": " The greatest privilege and honour for me in the last five years? Being able to run and serve as the Member of Parliament for Vancouver-Granville. Hands down, the single greatest privilege.  I solemnly and sincerely promise and declare that I will truly and faithfully and to the best of my skill and knowledge execute the powers and trust reposed in me as a Minister of Justice and the Attorney General of Canada. I never thought I'd find myself in this position. Now that we're here together, I've embraced both the independence and the opportunity. I've always believed in doing politics differently and I've always served my community with integrity. That is how I was raised.  I believe running as an independent in this time is the best path forward. I believe it is the best way to help advance the positive change our country needs. I believe this is how I can have a real impact on our evolving political system. I come from a long line of strong matriarchs. I was taught to honour the truth and tell it. I learned to collaborate openly within my community, to confront issues  and opportunities by building consensus. This is the most effective way I know to get to the best ideas and to find solutions. The climate crisis is without a doubt the issue of our time. We need a bold plan and we need to move quickly, very quickly. Issues of affordability around housing, the cost of childcare and healthcare are what people tell me gives them anxiety.  are vital to our city's future and we need a national pharma care plan. True reconciliation with Indigenous peoples is critical to our nation's future. Through rights recognition, the rebuilding of Indigenous nations will result in a stronger, better Canada, one that will enrich all Canadians. Good governance and democracy are under mounting pressure at home and around the globe. This means good governance matters more than ever, to all Canadians.  of us. We need smart, responsive electoral reform now and not later. I believe we can move beyond hyper-partisanship and find the best ideas. I believe more independent voices can improve our democracy, making it more representative, making it stronger. Who do you want speaking and voting on your behalf? Let's send a powerful message to Ottawa. Our voices matter. Integrity matters. I really believe in  doing politics differently. Together, we can all believe in that and make it happen."
}