{
  "video_id": "Q17JqVEoV1Y",
  "transcription": " Well, so much for the Lupins!  the great deed of turning a tile map into physics collision shapes. In this case, or in the example code, it's box2d. And so, how do you do this? We have lots of rectangles and those grey ones here should be collisions. The solution to that is the Moore Neighborhood Algorithm. It's explained on Wikipedia and there are some sample codes, but none of them  actually work for Objective-C or are in Objective-C. So it took some time and implemented this in a project you will be able to download from GitHub. I'll show you how this works real quick. So let's run it. And we start off with a block map you see is here in the debug log, which is very helpful for debugging.  It's not as straightforward as I initially had hoped. So you see this little A here? This means we're tracing contour labeled A. And this is the starting tile. And let's see what happens next when we run the algorithm. It finds the next one in the clockwise direction, which is actually going counterclockwise because it's always taking this tile and then trying to go clockwise around it. And then it finds this one and then it goes back and  down and left, left again, up and then it will find this one. So it's scanning clockwise but actually tracing here in this one example it's tracing counterclockwise. So let's run this a couple times and you see the A moving forward, around and around and around and down there and further down and up and oh yeah it's coming back down, down here  Going back up and down, around and around, and around, and around. So, and eventually we'll be back at the start, and then this shape or contour is being traced, and we have this one, and let's see what happens next when we find the next one. This is B here, and this is just a single blocking tile, so it'll get to the next one, and  Trace Contour C. D is another single tile. E, F, G, H, another single tile down there. I, J, K, L. And now it gets interesting. M is this one here. It's actually a hole in the blocking. Something you might want to avoid doing when designing your map.  So when this is all done, the game starts and you see lots of physics collision shapes bouncing around. And if we turn on the debug drawing for the lines, those are the lines created by the contour trace. You can see that several tiles in the same direction, where just the line between two points is just one line instead of  one line intersected by each tile's edges, which is one of the biggest flaws when doing the physics collision shapes on timelapse, is to actually create a shape for each tile, which is not just wasteful, it's also causing issues with the blocking, because characters can get stuck in between tiles while moving just on a straight line. This problem is...  not, or should not appear here. And, well, over time, all of those shapes will have entered lava, and they're all gone. I can also enable the physics collision debug drawing here, so you can see the physics basically uses the same, just not as colorful lines.  I see here's one issue. The algorithm is not perfect, so this one just should actually be one line. So I'll have to look into this some more, but in general this is how it works.  Click!"
}