{
  "video_id": "QccLNGI4-68",
  "transcription": " I  A turtle paddles off the coast of Borneo in the warm waters southwest of Asia. Along the coral reef lives the richest variety of life forms in the entire ocean. Many inhabitants of the reef live their whole life in the space of a few centimeters.  Others are visitors from far away, voyagers who've traveled thousands of kilometers. These animals have faced many dangers to come here, guided by the memory of a time when they lived on dry land.  Here is an extraordinary spectacle just eight meters down. It seems as though a mysterious rite is being performed. The protagonist is the oldest reptile living under the sea. There are only a few hundred thousand marine turtles in the world and their number is decreasing yearly. It's almost as if these animals are expressing  sadness over the threat to their species. We're off the Malaysian coast of Borneo, in places still appealing to writers of sea adventures, in a sea to this day infested with pirates. Sibadan is an island unique in the world.  Marine turtles, which are threatened with extinction and becoming more and more rare in all the oceans, have found refuge in large numbers in these waters and come here to reproduce all year round. Luckily for them, this little coral island has been uninhabited ever since it became a marine reserve. The first light of the morning wakens the reef.  The turtle spent the night in the recess of a coral wall. Another slept in a small grotto, lying on a cushion of gorgonian that sways with the current.  Turtles are not equipped with gills. They must emerge to the surface in order to breathe. But unlike us, it seems they can forget this fact. It's time for this turtle to take a mouthful of air.  His ancestors adapted to the sea 150 million years ago, but the turtle remains tied to his history as a land animal. His underwater life is interrupted by numerous pauses to breathe. A good supply of air can last several hours unless some ugly encounter forces him to waste  his energies. When a turtle reaches this size, he has nothing to fear but an attack by sharks or the encounter with man. It's time to drift towards the bottom for a hearty breakfast. Of the seven species that live in the seas, two normally frequent the waters of Sipadan. Green turtles, the most common species, and the hawk-billed  turtles. The hawkbills love to nourish themselves with milk-like sponges, which are not of any interest to other marine animals. Hawkbills are regular residents of the island's depths, whereas green turtles come here only to mate and lay their eggs, traveling long distances  to do so."
}