{
  "video_id": "QFn3VYhWnkM",
  "transcription": " We're just gonna go to a gas station. It's a vlog episode, people. Uh, yeah, I'm in, this is the last day in California. And I'm hanging out with some dudes and we're gonna do some skateboarding. This guy being one of them, this is Doug. Hi. Am skater. Are we ready to go? Where are we going? Doug says a gas station. Max says it was closed last night and you told us to get from the hotel and we didn't listen! Okay, so just take a right right here, whatever first gas station we hit we'll go to. And then we'll punch in, we'll go to USC. You have glasses on your face. I do. I rented a Mercedes-Benz.  A piece for take over the world the revive video second full-length video and wow this is a bad camera car actually That's not so bad. So yeah, this thing's kind of fun to drive. I'm gonna go get some snacks and then skateboard Gas station breakfast snack Okay, so we're at the same spot that we started at when we did the other vlog a sooth who it's skate actually the guy that kicked us out told us to come back today, so we're doing  So you're eating Skittles? Yep. Great breakfast for everybody. Why is your suitcase in the skate spot? What? This is where I live. What's up dude? What's up? Good morning. So we're filming the holiday shoot at the same time today. So a lot of us are gonna get dressed up into Christmas characters. Here's Aaron. And uh, Brian's like, if you're gonna be filming you gotta have a hat on. He didn't say it that mean, but that's why I'm wearing this. Max, how do you feel about this ledge? I think there's something spooky in my...  You are going to be so sweaty Doug. You could be Santa though. That's cool. That's really cool. Woo! That's Jake. Santa has lost some weight dude. That barely fits you.  Oh! Oh my gosh! I did not see that coming. That was awesome. Doug is skating this ledge and then bombing down there.  Doug! That was crazy. I leave for literally like 30 seconds and then this is what Aaron looks like. This is what I'm hoping doesn't happen. Oh yeah dude. This is like the best ledge for that to happen on.  Here's the camera in your face. Oh wow. You have a gain rate at a can I reckon. Look at it, show it to me.  What are we listening to? Real music.  I don't like hate him. I just don't care. I just do not care to listen to this. Why is this on the country station? I don't know. Alright, impromptu lunch at a fast food joint, which rarely ever happens. I'm sorry people for disappointing you that I'm eating fast food. Jump, jump, jump. We used to eat the spicy chicken sandwiches here all the time when we were younger and ate fast food a bunch. And I'm kind of excited to eat one actually.  Is this really a bear costume? Ummm... Yes. If people think we're weird, this is the crap that's why. That's why. See, Aaron Kyler's a snowman. Imagine if you were just driving by and you saw a snowman five-o. After a quick lunch break turned into an hour and some... A real quick six-hour lunch break. We're going to the Hollywood High 16th stair.  That was a disaster, which I'm not gonna go into detail, but uh... Pretty annoying situation. We're gonna go to the DIY though to wrap this day up. We've been to three spots, I've been pretty sure this whole trip.  Oh  Had to be fun, that looked so fun.  What? Dude! If you and Jason Park played a game of life right now, who would win? Jason. Don't disappoint us. I'm open-minded. It still works. Alright, so I'm ending this little day skate here. Thank you guys for hanging out with me. I was kind of running gun because we were  We had so much stuff to do on this California trip that all I could do is kind of film random skating here and there so I hope you guys liked it. That's it. Let's watch this. Disappointing. I do new videos here every single day so hit the subscribe button if you want to see more from me. And then this guy has a face and we're just gonna stare at it for about three more seconds and then the video is going to end.  Okay."
}