{
  "video_id": "qSIEqrWwJIE",
  "transcription": " Hey beauties! So today we're going to be applying our 1-2 lashes. So I'm super excited. I ordered these myself, paid for them myself. This is not sponsored. I just was really curious about these and as you know I don't wear false lashes if you watch any of my tutorials. I don't have great lashes in the first place.  first  to  of your lashes in the right spot towards the outer edge. Again, they're like half lashes. And then you bring the other one underneath and they sandwich your lashes and theoretically stay in place. Penny's like not feeling it. But you're also not supposed to blink in between, which to me just seems kind of unrealistic. But we're gonna see. Alright, so let me adjust my mirror here.  Okay, so they're not as close to my lash line as they should be. They're like hanging mid lash. Yeah, so let's try this again. So how you remove them so that you don't like irritate your eye is you just kind of separate them. Okay, so you move your hand, you gently do this just so that you like separate them from each other. My eyes are like so  tiny. I'm like Milhouse from the Simpsons. You know, they're just dots. Not that much there. Okay, I might try to put it a little bit further in. So it is a little bit closer this time. And it's relatively comfortable. I mean, I can  still feel that it's there, you know? But it's not like insane. But I kind of do really want to trim them just so that now again it is not, you know, it still needs to be closer to my lashes. Now I noticed this and this is new because I've watched a ton of these tutorials and you might have too. This is new. They now have a little magnetized applicator, John. Okay, so it's the One Two Lash Applicator. So we're going to see if this is any  more successful than just myself. Okay, place the applicator in front of you. Okay, if you needed to tell me that, I need more help than just this. Alright, focus. So theoretically, this is what we're doing. So that we can then clamp it on gently and theoretically.  it will close around our lash in the ideal spot. Of course, I mean obviously. This is science, people. Okay, that actually was not horrible. Oh, yeah, that was actually really good. That is on. Alright, you know what? I accept your challenge. Okay, so I'm just setting, so you wanna set the lower lash  I have not done this yet.  I didn't have YouTube back in that day, but that would have been mighty entertaining. So I'm gonna say that that's not on properly and my eyes are watering. Oh my god, this is contacts all over again. I feel like I'm 12. Except I have boobs. Alright, focus. Alright, so I'm gonna take these off and we're gonna try again. I mean, I kind of look like a llama or something. You know what I look like? That snuffleupagus guy from Sesame Street with like the really long legs.  I wonder if that thing can be used to take them off as well. I imagine maybe it would. I don't know. Maybe we should try that. All right. All right. All right. I think I'm ready. All right. Okay. Get my jaw on. Okay. Top right. Already dropped it. Awesome.  Okay, so this will not remove it, but it will magnetize to it. Okay, I'm sorry. Bad eye humor. Okay, all right. Left, now this is my tough one. This is not my dominant eye. Set up.  So it doesn't always work. Be firm, but also gentle. Because like, they're fragile, because they're lashes, but at the same time, like, you have your lashes and you don't want to like, destroy them either. Okay.  I'm getting better at this, but I don't think I am. I just want to share. Okay. Okay. Sorry. Okay. I feel like I'm about to jump into a pool. Except I'm not. All right. God, this is just like contacts. I'm legit  I got LASIK so I could avoid this. I got you. Alright. Alright. What are you doing?  this is probably as good as it's gonna get so we're gonna go with this. After spending quite a bit of time with these precious things I've learned a couple of things. Okay so I feel like with regular false lashes you definitely have an advantage over someone who doesn't do false lashes with these because it's still the same concept you're still lining it up on your lash line you're still getting really close to your eye and you're still  I'm still going to be wearing lashes. So I still think that if you wear them on a regular basis, you definitely have a heads up. But I do think these are fun and I do want to try to wear them. I do like them. I don't think that they have moved in the amount of time that I have worn them, which is not very long. I also think that tightlining your waterline and wearing eyeliner just like with regular false lashes would be an advantage as far as having it look more realistic.  So I hope you guys found this amusing and I will leave a link below for these guys if you are interested. They are not cheap but they are pretty cool. So thank you guys so much for watching."
}