{
  "video_id": "Qt7rNu8LDv0",
  "transcription": " You  Yo, yo, yo, what's up everybody here we are the man cast and the special episode coming at you from the Vapory in Reno. Y'all know me. I'm your boy man of steel 14. Yeah, mr. Chocolate right here and you can see RJ over here from the Vapory. Tell us about yourself RJ and you know, give us a little bit about your background. My name is RJ originally from Sacramento 35 years old small business entrepreneur. That's who I am. Excellent. Excellent. And you know, that's what the man cast is about. We're trying to get to these small businesses and get your information out there to the people.  people. All right. So as we said, we're at the Vapory. So let me ask you, RJ, what made you decide to open up the Vapory? I decided to open up the Vapory in Reno, Nevada, for some personal reasons. Some stuff that I was going through in Sacramento, I decided I needed a change. I needed some fresh air. So with that being said, we decided to plan on moving regions to Reno, Nevada, and plan on opening this small business here. OK. And it's great. And you guys also have a store in  Yes we do.  live and I've seen all these other stores around me in Southern California, Northern California and how fun it looked like to open up a shop. So I decided, you know what, let's do this shot in the dark and go full speed ahead. Excellent. That's awesome. Now for the viewers out there that don't know what vaping is, can you explain in layman's turn exactly what vaping is? Vaping is an healthy alternative to smoking cigarettes. This is a way to, to inhale nicotine  without all the negative side effects. Okay, okay. And so does that help you quit smoking? Absolutely. Absolutely. All right. Good to know. And so I know you have like the best selection of everything in store, but for vaping, but what else do you guys have around here? As far as other products that we offer in our store, we have a small clothing line by Cloudkicker Society. We're actually introducing other local clothing lines like 25th Hour and Roughwood Clothing. Okay.  Nice. Now I know there are vape meets or vape competitions around. Explain those a little more. I know there's cloud competitions and things like that. Tell us about those because I'm really intrigued by that. So as far as like the vape meets go, we're trying to gather vapers from this whole region to get together and talk about vapes. Talk about what mods they got, what juice they're vaping. Along with that, we offer cloud contests where whoever has the biggest cloud will be recognized as like the king of clouds.  They'll receive like awesome prizes and street cred if you would. Okay. And so now for our viewers out there who enjoy their cigar or cigar or cigarette, you know, how much would it start to, or how much would it cost to start up with vaping? To start vaping could be as low as $25. We offer complete kits as low as $25 plus tax, and they can go all the way up to like $500 if you don't have a kit yet. But if that's what you're looking for,  for that's what we have to offer. I'll tell you what I got my little starter kit and you know I love it and it gets addicting you know like I definitely want to get that that bigger mod and you know you know try and get those big clouds and you know it's it's fun it's really great and it's a great alternative to smoking to help you quit and I know you have charities that you try to work with. Yes. Explain that to us. So as of right now it is a season so we're working with Toys for Tots Drive we're trying to gather  toys for the children that are less fortunate. We are trying to drive people in that vape already to donate their toys by giving them a free juice. So if you donate a gift, we will actually give back to you as well. Nice. So along with that, we are also working with a gentleman called D-Dub-Dex. He is a renowned builder in the vaping community. So what we're trying to offer is two rebuildable atomizers built by D-Dub-Dex  We're trying to offer the community a chance to win these atomizers through a raffle. Now along with this raffle, we're selling these raffle tickets for $2.50. So whoever does win the raffle will receive the atomizers and then we will donate all the proceeds to the winner's charity of choice. So that's how it's going. So you get to pick your own charity that you want to donate to. That's great. That's great. All right. All right. You know, I've had a great time here. I love looking around. You guys are going to see what the shop looks like. There's some amazing artwork on this wall.  We have a foosball table looks like a nice place to come here kick back and just have a good time Shop for some great things you'd want you know, thank you for having us RJ. It's incredible Do you have any closing thoughts or anything you want to say to our viewers? Yeah, actually I do Smoking is dead and vaping is the future. This is a this is a quote. That's been used over and over again I personally like it. So I'm gonna say it again, you know, definitely we love that now What's your Facebook handle for anybody out there that needs to get ahold of you guys, but you can find us on?  the Vaporee Reno or the Vaporee Fallon. Excellent, excellent. Again, RJ, thank you for having us. Now for our viewers out there, stay tuned. You're going to get some shots of inside the place and so you know what to expect when you come here. Thanks for watching everybody. See you later.  so  so  so  you"
}