{
  "video_id": "qYCtEAthTfo",
  "transcription": " foreign  It's a trap to trust you. Since one day you decided to leave our love in the night. You are the one who opens the mouth.  is  in animation everything you would see in your mind's eye while you were watching the improv show. Let's get started with a game I like to call styles. Come out here Jeff and Chip. Jeff and Chip are going to act out for you. They're going to of course make up a scene for you because it's an improv show. What we need from the audience is somebody in the back section. I want you to yell out something to fear. Something to fear. Cheeseburgers. Underwear. What do you want underwear or cheeseburgers? Underwear. Underwear.  I want. Okay. Underwear. Some of the fear, underwear. And what happens is they're going to start at a scene regularly and then once in a while, uh, Brad's going to stop the scene and then ask for a different style of movie or television or drama or play or something like that. And then you're going to make another suggestion and they're going to act it out in that style and continue the scene. Got it? Good. Take it away with Afraid of Underwear. What are you doing in my room? What are you doing in my underwear? Two good questions.  Look, I came into your room because I wanted to see what you've been doing with all my stuff. I've been wearing your underwear. I just want to know what it's like to be so popular and so rich. I have no good underwear, and you have all the great underwear. You know what? I think the only thing separating me from being like you, Randall, is underwear. I'll tell you what, my underwear is fun to wear. Freeze! A style of movie. A western.  for the two of us. One of us is gonna get them boxers, the other one's gonna hightail it out of town with nothing on them. You want these boxers, you're gonna have to come over here and take them off yourself. Are you Sam Elliot? Maybe. Well I'm a little scared of you, but I'm gonna take you on. Alright. Freeze. A style of theater. Musical. Musical.  You want my underwear? You're going to have to take it from me. I could take these underwear off and then I'd be free. If you're going to take my underwear, you're going to be the one who fears me. I won't put up with that horse hockey. You can't steal my new jockey.  Freeze! Dance break! Freeze! Another style of movie. Horror! Silence! Horror! I heard horror. What are you doing to me, Dr. Roommate? I'm taking your underwear off of you and planting them into my DNA so I will become  I've become an underwear man. Freeze. A European dialect. French. You see, I've always wanted to be inside your thong. Oh, well, let me sing, sing a thong. Sing out loud. Sing a thong. You know, it was very kind of you to give me the wine before you did all this to me. Freeze. Another dialect. Italian.  It was very nice to give me the Chianti before you do this to me. Why don't you get up off your lazy butt and give me my underwear back. Big Jimmy, you got a lot of, lot of hoots for coming in here in those boxes. I'm wearing all the underwear in this town from now on. No one's got underwear but me, all right? Me! You want my underwear? You want my underwear? You want my underwear? You want my underwear? You want my underwear? You want my underwear?  Another style of movie romance. Yes. I want you under way of water If there was ever a roommate that I wanted to give my underwear to It was you your love is like silicon underwear the brush of soft fabric caressing my soul freeze close together dance break  type of theater Opera Opera theater Opera wash my jockeys wash my jockeys  How about that? How about that? For entertainment. We'll be right back, back to our band. How about that? How about that?"
}