{
  "video_id": "qZx7BUfi53w",
  "transcription": " So  Good morning Good morning Robo! Robo Squad, alright So you guys wanna guess on like game theories? Like what do you think the game's gonna be? What do you guys think the game's gonna be? I don't know what the game is gonna be Seth, any ideas? I like the idea of coin slots and putting coins in those slots I don't think we're gonna have an open field this year though So no fast robot?  Any game theories, Susumaya? Wreck-It Ralph. That's what I keep imagining. I think it's gonna be like Mario. Or Mario, yeah. Where you have to like, place stuff, climb up steps, and then there's like a flagpole. Imagine Mario Kart. Yo, that'd be so cool. That's what the technician does. It sits on the robot. Wow, that would be cool actually.  Look at that walk at high school ready for kickoff. Let's get it. I did so excited. This is year 15 You're so old. It's also year 7 with the robo squad. So, you know  Yeah, we don't need you anymore. You know some of these kids on the team aren't even 15. Yeah. Monic, are you excited? Yeah, I'm definitely excited. Yo, what's up? I'm here with my boy Monic. I got that new album dropping February 2018. Shout out to my boy Tyrell. Great job in the studio. You know, that was sick. We laid down some hot beats. That shit's gonna drop and it's gonna sell out. Carnaby, hit me up. You know, when shit goes hot, let me know. You know, whatever, whatever. Just let me know.  question. Shout out to Damon on 4557 and hey listen we have to come up with a new challenge for Damon he needs another tattoo. He told us he's gonna get another brick tattoo. Maybe. Actually I like the Inspire bricks so much I don't have any tattoos. Welcome to the 2018 FIRST Robotics Competition and this year's game FIRST Power Up.  Two alliances of video game characters and a human operators are trapped in an arcade game. To escape, alliances use power cubes to control switches and a scale, pass power cubes through the exchange for power-ups, and ascend to face the boss. Teams may preload up to one power cube per robot, additional power cubes for a vehicle, and power cube piles along the entire scale and can be used to launch a portal.  The alliance that earns the most points wins the match and defeats the boss.  So, what do you guys think about the game? Were you guys confused? It was because I was so confused. The beginning was really confusing when they did the cubes thing. Yeah, that was just like an intro. But then I kind of understood what was going on.  How do you feel about the game? Are you like confused? A little bit. I don't know what's going on. Okay, so you'll know what's going on in like five minutes. Or like two weeks. Or yeah, because we kind of don't know what's going on now either. Really? I don't think anyone knows. Carlos, what do you think of the game? Yeah, what do you think of the game so far? How do you like it? It's your first year on the team. It's a lot to memorize.  Once we start playing and like start talking about the game you'll you'll understand Yeah, we don't understand now either. It's always like that during kickoff All right, Maya, what do you think about the game? I think it's really cool I mean, it's a very interesting game to end my robotics career Game is awesome. I love this game. There's so much strategy. There's so much strategy involved in this game. It's gonna be amazing  Lecture.  Quick recap on what all that was. Basically all we did right after kickoff we went to our little assigned room area and we just read through the rules. Each student got a chance to read through the rules because you know you can't play a game unless you read the manual. That's the most important part. And we got all the points. Exactly. And now we're looking at the field pieces that they  build  Again, I said it right I said it was a scale. Again, we're thinking about just making one side of it. We don't have a lot of materials, we don't have a lot of time, and we don't have the space in our shop. So, gotta cut corners. And then that's the bar. And then this over here is... This is where you hang from. Skip is this tall. So we basically just, you're the roll up. Oh, it's tall.  I'm so sorry. So Skip is going to be the robot. Wait! It holds 300 pounds. We're back!  You guys need help with mentors that you don't have and you need  somebody to help assist you with anything from award writing, sponsorships, mechanical stuff, electrical stuff, anything. Go to www.frcrentomentor.com and then there you can find different mentors from teams all over Connecticut and then you can rent them. They all offer different services. It's free, you don't have to pay anything. This is our way of helping the community. You know, because 558 comes in clutch.  You"
}