{
  "video_id": "R1t1ktp6WDY",
  "transcription": " This is a demonstration of why you use Excel Combination Charts and how you create Excel Combination Charts. This demonstration uses the EasyChart 2 for Excel add-in. Let's create a simple X-Y chart with 3 Y-axis fields using this raw, unsummarized data. Begin by selecting Date Entered as the X-axis field. Next, click Select Fields to Chart. Notice the Date Entered values have already been automatically aged. Let's change EasyChart  EasyChart 2's automatic Y-axis selections so that number of sales is on the primary Y-axis rather than on the secondary Y-axis. To finish, click Create Chart. This chart with its green background uses the current EasyChart 2 default format for an Excel XY chart. Notice that it is difficult to see number of sales because the values are very small in relation to the sales amount and owed amount values. Unchecking Retain Y-axis Scaling and checking  Rhythmic makes it possible to see the number of sales values. Notice that the Y-axis scaling now increases by a power of 10 rather than by a constant amount. Let's uncheck Logarithmic and check Retain Y-axis Scaling. Now let's create an Excel combination chart by going back to EasyChart's automatic selection worksheet, switching Number of Sales to the secondary Y-axis and clicking Create Chart. Number of Sales is now charted  as a line graph with its own Y-axis scaling on the right side of the chart. This makes it easy to view the much smaller values in the number of sales field. This chart with its orange background uses the current EasyChart 2 default format for an Excel combination chart. You can customize this chart using Excel's standard charting options. You can also save the customizations for reuse as the new EasyChart 2 default format for Excel combination charts.  EasyChart 2 has separate default formats for XY charts, Combination charts, and XYZ charts. This concludes this video on when to use and how to create Excel Combination charts using EasyChart 2. Please visit www.datapresentation.com to download a free 15-day trial of EasyChart 2. Thank you for your time.  you"
}