{
  "video_id": "RCwTPOjyNUM",
  "transcription": " The Duke and Duchess of Cambridge made a special visit to the Royal Marsden Hospital in Sutton today to mark its new centre for young people officially open. Twirling the new Oakes Centre for Children and Young People, the Duke and Duchess met a number of inspirational patients at the hospital. The Royal Marsden, of which the Duke is President, is a world-leading cancer centre.  In 2005, the Duke carried out work experience there and spent time on the children's unit.  Ladies and Gentlemen, this place is inspirational. I mean that in the truest sense of the word. It really inspires me. It is not just the extraordinary professionalism and dedication of the Royal Marsden staff. It is not even the great courage and spirit of the children, young people and their families here at Sutton. It's a combination of the two set in this wonderful environment. I always come away from the Royal Marsden feeling totally uplifted and Catherine and I will certainly do that today. We're both so delighted to be here.  and this very special occasion, the opening of the Oakes Centre for Children and Young People. This facility promises to be an invaluable new addition to our world-leading hospital. Once again, the Royal Marsden is pushing the boundaries, raising standards of excellence and showing the way for others to follow. All of us in this country should be immensely proud of the fundamental role the Royal Marsden plays in the global fight against cancer. The bright, positive environment that the Oakes Centre provides for the children and young people who come here  here has only been made possible by the generosity of the Oak Foundation, the Teenage Cancer Trust and the Royal Marsden Cancer Charity, including some key donors, several of whom are here today. As President of the Royal Marsden NHS Foundation Trust, I thank you all from the bottom of my heart for making the idea of this magnificent new centre become a reality. It gives Catherine and me the greatest pleasure to declare the Oak Centre for Children and Young People open.  Thank you."
}