{
  "video_id": "RgEwUEp82YE",
  "transcription": " Hello, I've arrived at Manchester Airport from Nottingham where I lived for the last three years.  I'm on my way to Terminal 1 where I can get my airplane to Cancun, Mexico where I'll be staying for the next few months.  Okay, so I've now checked in. I'm now going through security. I'll see you on the other side. Okay, I'm now through security and I have an hour until the gate opens. So it's time to do some shopping.  carry-on backpack. Bringing those same liquids of 150 milliliters to Manchester Airport security, I discovered that I could not fit them in my carry-on backpack. The issue here is that Manchester Airport limits liquid sizes to 100 milliliters. Therefore, before you fly, it is important that you go on the particular website of the airport you are flying from  and ensure that you know the rules and regulations of the airport before you travel. I'm on my way to board my flight at gate 23 to Cancun. First I've got to find gate 23. I have found gate 23 and we are boarding in 10 minutes to Cancun. Ok I'm just about to board the plane to Cancun. My flight will take 10 hours and it will be 1 minute of your YouTube experience. Enjoy the experience.  Hi.  We are on the hour.  10 hours later, I've been leaving Manchester airport  I am extremely tired, however on the bright side I have finally arrived at Cancun International Airport. I am now collecting my baggage and then we will make our way to the hostel where I am staying for the first three days. See you soon! Ticket to the bus station please.  Thank you. Outside to the right, platform number 4 in 20 minutes.  for Cancun and the Yucatan Peninsula area. They deliver tourists and locals alike to regions throughout the Yucatan Peninsula. For 72 pesos I got from the airport to my hostel.  Okay, I'm now in the ADL bus station in Cancun City Centre. This wraps up this episode of the Storybook Voyager. If you enjoyed this episode of the Storybook Voyager, then press subscribe down below and tune in tomorrow where I'll show you the hostel and the  city centre of where I'm staying."
}