{
  "video_id": "RIZpUl0EsBY",
  "transcription": " The Winners Organization, a group of college and pro football players inspiring a generation to reach for excellence.  Big dream. I said, mom, I want to go to college. Listen, nobody in my family had ever been. You see, I don't live by what my eyes see. I live by what my heart believes, because what I believe is bigger than what I see. Eyes that look are common, but a heart that sees is rare. My question always for young people is, what do you see? You see yourself, 22 years old, receiving your master's degree, your bachelor's degree from that university, your mom in a crowd, proud.  You know what, we got homeboys man, they want me to get high, get drunk, I can't do that because I gotta persevere until something happens. Push. P-U-S-H. Everybody say persevere until something happens.  Moving forward today on my vision. I got beat up by 15 guys in the school bus. 15.  Remember the bully's name? His name, I'm not gonna yell his name out, but let me tell you something. I wanted revenge. 2,000 pushups? Yes, I was angry, I was bitter. I was doing those pushups. And the thing I wanna mention to you, a friend of mine told me, yeah, you'll get strong and you'll beat them up. You'll win the battle, but you'll lose the war because you'll wind up being just like him.  This girl no unwanted pregnancy no unwanted disease no bad reputation No broken heart, you know why because she made a right choice because she listened to a right voice  You're not born winners or losers. You were all born choosers.  Born alone, left to die, rejected, often criticized.  But now I'm changed. My grandfather raised me because my mom was in and out of jail all the time. My stepdad was in and out of jail all the time. My family got split up when I was little kids and I was raised with my grandfather. He only went to the third grade. My grandma only went to the fourth grade.  I challenge you today. I learned something in the middle of growing up like that. First thing I learned is it's not how you start, but it's how you finish. I don't know what's going on in your life before today. I don't know what your father did to you or your mother. I don't know who booed you, the school district, the court system. No matter what has happened in your first half, you can have a great second half.  from the IU Bloomington Postgraduate Studies. You can have more if you don't settle for less. I came to school at the very bottom. I was a remedial reading student. Didn't score high enough on the SAT to even get in school. Started at the very bottom, but found myself graduating from the University of Southern Cal. The very top, highest grade point average, Dean's List.  Academic All-American Nominee."
}