{
  "video_id": "rl6UuhonvHI",
  "transcription": " Hey we're at the Old Town Farmer's Market. We're gonna check it out here. I got my little helper today. We're gonna go see what they got.  Alright I'm sampling a tomato here. You want some? No. No, she doesn't want any but I'm going to taste it. It's really good. Definitely market fresh.  Getting a mixture of peppers now. Are you gonna eat some? No. Why not? Are they too hot? No. I just like them in stuff, not bite into stuff. Oh, okay. She likes them in the salsa. Ah, that's good. I'll eat all of it.  What's wrong is that cheese spicy Is that a lot of spicy We made a plate here And now we're gonna try some of the goods everything is You know grown fresh here in Kansas  for the local. So we're going to try some peppers. Maggie tried the cheese. It was really spicy. Was it spicy? She's now chewing ice. She's chewing ice because it's really, really spicy. The biggest cheese ball in America is what they call this. It's really good. Did I get some on you? Oh, that's really good. It's not spicy at all. You want to try?  It'll kick in.  tongue spicy do my nose now it is spicy now it's in my nose hey but it's good it's not too spicy I don't need any ice or anything but we all know I like spice I like heat so how is it  Good You want to get some marshmallows? Okay, how much are your marshmallows? Marshmallows are five dollars  Shot of coffee here. What do you want him on coffee? Guatemala and coffee We're gonna we're gonna test it out here No, Guatemala. Oh, that's good. Not watermelon Guatemala That's really good coffee  So live local go to your farmers market we just went to the farmers market  A bracelet and marshmallows and a ring.  I'll put everything in the links below on how you find out about this place and What you can do and who you can see and all that if you like this video give us a thumbs up Give me a thumbs up Thumbs up. Don't forget to subscribe and so I'm Troy Who are you? Subscribe subscribe Hey, I'm Troy and this is Mags and we're reminding you to live local. We'll see you next time I was driving. I was at a stoplight  And I decided to try one of these little peppers and I took a nibble of it. Oh and it was a little sweet So I was like, oh, that's one of the sweet ones and then I popped the whole thing in my mouth Started chewing it up and that was like two miles away Luckily, I had this water bottle in the car. It's my mouth is still on fire It's burning. My face is red a little bit of sweat. Ah It's some good heat though. I just wish  I was eating chips and salsa or something with it. Oh, cuz man, it's hot. All right, live local. We'll see ya."
}