{
  "video_id": "Rq47dTlPbCk",
  "transcription": " Hey guys, it's Jacob from Boba Bosses here with Garrett from Boba. Yep, going to the gym. I'm gonna train myself.  My mom just got done doing a few side jobs this morning and gotta make that money Remember guys always vlog when driving. That's the safest way. It's getting a car accident. Oh kill yourself. I Don't see you in the camera got my Lenny and Larry's cookies not selling out guys, you know people say what Garrett? What do they say? Oh two tacos from Taco Bell equals Lenny and Larry's cookie doesn't look like I want to eat tacos right now You can spend your macros better  I agree.  I'm actually really poor so I need to go to the chiropractor soon. Probably gonna start doing a podcast Let us know in the description box above if you want to see a podcast. I love how we get two comments We're like yeah guys just leave leave all these comments we'll go through Leave a comment above in the browser link Google your comment below to your right you'll see An ad probably gotta make that money click the ad gives us money click that ad check out check out Legion I'm not selling out  again I actually don't have a car actually I do like Legion that's really I really like Legion I don't know if there's stuff it doesn't have any bullcrap lens doesn't have muscle muscle maintenance plan and as I have hydrogen ball sack plan I don't know it doesn't have any of those no blends we don't play with those blends pretty good everything about this thank you bud anything about this thank music  It's about two minutes ago, I completely failed even doing warm-up set with 60s. So I'm just doing 50s, high volume.  I'm guessing it's like 20 Wow For a dollar new bulky food, let's go. Yeah. No, no. No. No. Yeah. No, I know I was like, oh boy the storms coming might God Wow Wow  Are you sick? Did you guys watch that? I'm the pirate ever freaking heard What the fine was the even a pirate are you're a freaking idiot. You're an idiot Yeah, what do we got? Oh? Is that moe's our baby? So where's my chipotle? We got some Burger King in here. Where's my chipotle? See what oh, what do you think of this Jake? Oh? No idea  Yeah, if he clasps his hands one more time during this video, I promise you I will cut his hands off. I like y'all to see and witness Garrett trying to buy online ticket on Fembingo. You guys want my credit card? All right, we're gonna see X-Men right now 615 Unfortunately, I'm out of calories. So rest in peace my snacks.  I always frequently drive. I always drive I'm trying to buy my thing Walk while you buy your ticket. No, I can't focus. I'm in a buying a ticket to know just follow you mind Thank you, bud. This is for that guys. This is some difficult stuff Please go wait Wait, all right. What did everybody think of that?  Absolutely, I give it a little be a month dead What no no? We're at one of my favorite restaurants Applebee's PDQ yeah, what do you think about PQ? That's true. We're waiting for our other friend Maddie. She's not here Jesus  you"
}