{
  "video_id": "RThFUxN_PG4",
  "transcription": " So recently there was a nuptial flight of a Lacius nuptial flight in my neighborhood And I thought I'd record it to show you guys for those who haven't seen like Queen Anne's before What they look like and what it looks like when they're flying For those who don't know nuptial flight  are when virgin ant queens, so queens that were just born, they fly in search of a mate and after they find a mate they shed their wings and then they attempt to found their own colony. Now the unfortunate truth is that an overwhelming majority of these ant queens, like 90 plus percent, don't make it past their first year or even their first week. Now this is because some of them are picked off by predators like other ants, spiders, and some of them are just squished by larger animals like us and some of them will die from, for example,  heat exhaustion, some will land on water like pools or lakes and drown. It's very tough for them to survive even the first week. Once they do start their own colony with a few workers, most of them will die off due to competition. So really, only a tiny percentage of these ants actually form their own colony and are able to reproduce. During these nuptial flights, you'll find ant queens just about everywhere, especially with some species like Laceaeus and Camponotus.  of them during nuptial flights, it's really hard to miss and so you'll definitely be able to catch a few. A good time to look for nuptial flights is right after it rains and it gets really sunny. And this is another reason I recommend people to not buy ant queens, especially when they're beginners, because ant species like Laceus are super easy to find. While some species are a lot harder to find, these guys have really large flights and they're a good ant for beginners because they don't die easily. If you're interested in trying to find a queen, it's still not too late. There are a few species  it will still fly before the end of the year. Basically flights usually end around mid-August so until that time just keep an eye out and you should be able to find your own Ant Queen. Good luck out there guys, that's it for this video.  suggestions, whatever, well feel free to leave it in the comment section down below. As always, your feedback is really welcome and appreciated. Well, that's it for today. Bye!"
}