{
  "video_id": "S-oGX8DmuhQ",
  "transcription": " I'm currently an intern at the AMRC with Boeing. I'm a marketing intern here. That includes working in a student enterprise company where both groups have to develop two new medical devices. In addition, I also get to work with their central marketing team at the AMRC. And I get to get involved with lots of new projects such as the Tram Aerospace Conference that I've recently helped organise. My course is really broad so I get to do classes in economics,  I studied at the Chinese University of Hong Kong for a year. I feel that studying abroad, especially business and finance, which is so popular in Hong Kong, definitely helped me because it's such a competitive course. And at my university, the classes were bell-curved, so you were competing against your classmates. And I think this was good skills to learn to put me up for the real world of work.  a pilot but before then I'd like to gain employment in an interesting industry related to my degree. So I'm really hoping that my experience and opportunities that I've taken whilst at university will help me. I've wanted to fly for as long as I can remember so I was lucky enough to have my first flying lesson on my 16th birthday and ever since then I've wanted to get my licence. I get to work at my local airfield, Sheffield Aero Club and I'm also learning to fly alongside there so it's a good opportunity. It makes it all worthwhile when you can fly over the beautiful scenery in this area of the country. For example,  I flew over Derbyshire this weekend for a party and then we flew back the following day so it definitely reminded me why I was learning to fly. I think Sheffield's a special place because despite there being 26,000 students at the University, it's really common to bump into someone you know and it makes it feel like an intimate and friendly place. My advice to anyone hoping to study in Sheffield would be to firstly work hard because it's worth it when you do get there and also when you do get there to take any opportunities that you get whether it be a part of your course or not because it really helps make your time at Sheffield more fun and  worthwhile."
}