{
  "video_id": "s6Mq_rKuJQ8",
  "transcription": " Hello and welcome to advice here on AutoPortal. This of course is the place where we help you buy better by answering your car buying queries and today's question has come in from one Mr. Mahir Das who writes in to us asking us between the Ford Ecosport and the Vitara Brezza. Now he has driven both the cars and he feels that the Ecosport is better to drive but it is of course the  Brezza which comes across as the better package. So he wants to know which is better value and which one should he go in for? Well, Mr. Das, you are absolutely right. The Ford Ecosport is the better car to drive, especially in its diesel version. And why is that? Because it has a bigger engine. It's a 1.5 liter engine compared to the Brezza's 1.3 and it's also more powerful. It's about 99 bhp compared to the Brezza's 89 bhp and that makes it a much more powerful car. While the Ecosport also has the edge over the Brezza is in power delivery.  and it starts responding from a relatively low 1500-1600 RPM which makes it a much better car to drive in the city. But that said, the Maruti Brezza does come across as a very strong package. It is very good to look at, it comes loaded with features and it also has a very keen sticker price and that along with the fact that it's a Maruti means that after sales as well as resale values will be very strong and it really is choosing between a better driver's car and choosing between the better package.  So if I had to choose between the two then the choice would be simple if you're looking at a driver's car an outright driver's car or everything else then the Ford EcoSport really has no equal in this segment but of course if you want a car which offers you a little bit of everything then the Vitara Brezza really is a very strong package.  directly to me at Ashish Massey 1. It's flashing below your screen right now and I will be happy to help you on all our platforms. It's bye for now and hope to see you soon."
}