{
  "video_id": "S7cKirMMA60",
  "transcription": " People are so used to these things that they don't feel it's wrong or out of place. They just think it's a part of life. What's the problem? This needs to change.  Making the workplace safe for women, how do we do that? We can't get into a policing mechanism as an employer. Create an enablement by communicating. Communication training and over communication in a sense is extremely important to ensure we don't have to go to the redressal part of the law.  Connecting with women employees across the country, getting feedback from them on what are the various challenges they are facing, making a serious attempt of setting the right context. PepsiCo follows a zero tolerance policy on all such issues. Prevention of sexual harassment and anti-gender bias training is a part of the larger diversity and inclusion journey and initiative  that we've been rolling out for some time.  Mind Bugs was essentially an exercise of figuring out what people think  play as a format to educate people. We took it across the country, multiple languages. The reactions we got on the vernacular language formats, it was really, really encouraging. A street theatre by nature is a very interactive format.  And what that really did for us at least, is it helped open up minds. Early on in 2014, we sent invites to all the corporates in Global Business Park. I was very amazed to see the kind of participation that we got from almost 700 people who turned up for that event. We had actually invited the DCP of Gurgaon, Ms. Nazneen Bhasin, to come up and talk at this forum. We chose a platform or a format like a Nukkad Natak. We were able to actually reach to the grassroot levels of our organization. We had men and women  equally talking about how they felt and what they experienced and it brought alive a lot of issues which would otherwise have never been spoken about. We really enjoyed that speech presentation.  We are happy that the organisation has come. It brought out the message very clearly. And plus it was the fact that it was enacted in Gujarati also which helped the labour, even the casual labour to understand the concept. It made it easier to understand the concept. It was deeply entrusted in people. All our employees have given a very good feedback about this. Near about more than 120, I think 150 people have participated. The feedback itself is a testimony about the success of the programme.  to a few more of these programs in our country. All of the pieces put together made a very, very powerful rollout. I really see this as a movement. And as in any movement, we need many people to join hands. I pledge to be part of this movement. I pledge. I pledge. I pledge. I pledge to be a part of this movement. Join us."
}