{
  "video_id": "SgMoHqjlbe8",
  "transcription": " Vundree Studios asks, I'm an 11 year old and right now in science. I'm learning about how the universe was created. I'm a Christian that thinks that God created the world, but I'm worried that if I don't believe in God for one bit, I might not go to heaven. Please help.  right to have doubts. A Christian should never fear doubt. They should doubt and they should challenge their faith because Christianity is true. It's true so we shouldn't be scared of things challenging it because the reality is that when we go through school and go through life people are always going to tell us something different. People are always going to preach or teach us something that is contrary to who God is or contrary to what the Bible says. It will challenge our faith and it will cause doubt but we should know that our faith will always hold true  because it is true.  I  And now I have strong faith that it will run because it's like new and nothing wrong with it. It hasn't done anything to me before. But what if someone comes up to me and says, hey, your Sonata, it's bad. It's going down. It's not going to turn on. I could take that information. I could be like, I don't know, and then like really doubt myself for a second. But there's a track record to my Sonata now, not like the old one, not like the old one that was old and busted. The Sonata is new.  and so I could have doubts in it but then when I actually put it to the test and when I turned it over it goes. Here's the correlation, I don't know if this made sense or not, but that our faith in God is the same way, that God has had a track record in your life, in my life, in testimonies, if you just recall what God has done for you in your life and how he's effected, like that is what your faith is based off of, predicated off of, and even further than that, more than just experiences, is the Bible. The Bible is a document of things that God  has done in the past to where people remember and recall and it reignites people's faith in the middle of doubt. So when you're doubting, go back to the Bible. When you're doubting, just recall what God has done for you. That's what people in all of history throughout the Bible have, that's what they've done. They have always, to spur worship, to spur faith, they have always recalled what God has done for them in the past. So like people in Israelites have remembered the Exodus or people have like remember the Passover. This is why we take communion. This is why we go to church.  remember what God has already done with us, because that's what our faith is based on. It's not blind faith, it's reasonable faith based on facts.  you"
}