{
  "video_id": "sIXsU2bGkqQ",
  "transcription": " You know, this is a film that's held up as one of the great romantic movies of all time. It has a staying power. It never goes away. Officer and a Gentleman is one of the greatest movie love stories of all time.  It consistently holds my interest as a great love story, an iconic love story. It just holds up so well. It's a remarkable movie. I pursued this material doggedly, determinately, and some would say obsessively, because I thought it would make such a wonderful musical. I think everyone can relate to that story of trying to improve your life.  We've been doing the audition process for nearly two weeks now. It's essentially a really quick culling process. It is a difficult show to cast because they need really strong voices and real acting chop. It's coming down and down and down. You heard them sing, found out what sort of voice type they had and you basically pushed them through to the dance call.  Choreography is a very important element to the show and a lot of the people that we're seeing are brilliant and they really are standing up with the experienced music theatre people at the moment. I think it went okay and now we'll just see what the next step is. I tell ya, it hurts. I think it went really well. I hope for the best. And this week has been the finals and that's when we thoroughly start working people that are up for the lead roles.  I'll help you after that. You may. Don't you do it! But if I got it, I'd be leaving the grave.  You know, I picture you as the kind of guy who'd zip off one day and my F.A.D. departed to the end.  from beat to beat. I think what people are going to enjoy about it is it's sexy, without a word. It's got a great score. Written by two Grammy nominated songwriters.  And it's rock based and it's musical theatre based at the same time. There's a real edge to it which I think is exciting. It's going to be something totally different to what Australia has seen for a long time. And as great a movie as I believe people think an Austrian Gentleman is, I believe they will think that the musical is even greater.  you"
}