{
  "video_id": "SmC5GZffVFg",
  "transcription": " I don't think I'm getting on the stage because this is some extremely dangerous stuff that's about to take place. We have the amazing Mad Matt. He is the indestructible man, ladies and gentlemen. Big round of applause for Mad Matt. Now, he is out of his fucking mind, alright? Can I make this clear? Like, later on, when in the newspaper, like a reporter's asking you what happened before the blood was everywhere and someone died,  I want you to tell them that I warned you completely out of his mind. This is a fantastic act and it's important to note that man-man here, he doesn't do tricks. There's not some bullshit way that he's doing this. He does stunts. This man puts his life in danger for your entertainment. Now what you see here is a little act that is called dead man walking, ladies and gentlemen. It features two  Chainsaws to real chainsaws and not to not three but four blades. We've got these bayonets pointed in a direction that I suspect Bad Matt will find himself in you can see here. The cannibal attack is pulling on a metal cable Now that is a winch a winch like a tow truck has on the front of it to pull cars out of ditches  Not one, not two, not three, but four separate locks. I can't get into my apartment when I've been drinking and this guy is going to be attached to four separate padlocks. This man has 40 seconds to escape. Not one, not two, not three, but four separate locks before his body is pulled by that wet shoe spur. While it drops out of pitchers and stumps out of the ground towards the four  And the two working chainsaws. How many of you think he said get out of this fucking thing? So he's not gonna pull a David Copperfield bullshit where he hides behind a screen and you see his silhouette while he takes off the Velcro. You're gonna watch him being pulled towards this death machine, which I call my ex-girlfriend. Ladies and gentlemen, a big round of applause for Matt.  I'm a trouble with a heart  You"
}