{
  "video_id": "SMnZzGZUmWo",
  "transcription": " In time, you will know what it's like to lose. To feel so desperately that you're right, but to fail all the same.  Dread it. Run from it. Destiny still arrives.  Crepshus. Crepshus. Is it Crepshus? Crepshus. Crepshus. Crepshus. All right, anyway, let's check this out. It should be good. Get over there and subscribe to Crepshus. He's a pretty damn good editor, dammit.  He was famous and basically getting set by two well-known guys. I don't... I'm gonna start again. Let's track this from the beginning. Your life's work in the hands of those murderers. Is this the last act of defiance of the great Tony Stark? Or are you going to do something about it? I should do anything to get him to kill me. You.  Sorry, there's some trucks out here.  This isn't gonna change what happened. I don't care. He killed my mom. This has been so long. So long. Well, I couldn't leave my best girl. She's too strong. Without my hammer, I can't. Are you Thor, the god of hammers? That hammer is to help you control your power, to focus it. It's never your source of strength. It's too late. She's already taken Asgard.  Hmm.  mhm  this trailer is dangerous  You feel so desperately that you're right yet to fail all the same. I hope they remember you. There was an idea to bring together a group of remarkable people.  To see if we could become... Something more. So when they needed us... We could fight the battles... That they never could.  I expected it to be a very action-packed one, but no, this one was a sentimental one. This one was one with meaning. I like that. This is a change. This is a change, Krepses. Krepses. You gotta tell me how it's pronounced, Krepses. Is it Krepses or is it Krepses? It almost sounds like scrumptious. I don't know why it reminds me of that. Is that what the ladies say to you? Hey Krepses, you're scrumptious.  the  If you did not, that's fine. You can kiss my black. Mr. Krebs is watching. Derriere. 2 million subscribers. Woo!"
}