{
  "video_id": "SOJfcshF9_Q",
  "transcription": " You  Jericho did not come down until the people shouted. We took shouting out of the mouth and put it in feet. This is called dancing. Shouting is done with the mouth and death and life, death and life is in the power. The Lord said tell the people this morning the reason why they're late for their exit and can't get off on time is they're too quiet.  So the demons are in front of you, bills are in front of you, sickness is in front of you. But God said this morning if you're bold enough to lean on it, y'all, oh some of y'all. That's why he said make a joyful. No, no, you gonna catch it, you gonna catch it.  About midnight it was about when they opened their mouth the walls of Jericho did not come down until the people Shouting we took shouting out of the mouth and put it in feet. This is called dancing Shouting is done with the mouth and death and life death and life is in the power  why they're late for their exit and can't get off on time is they're too quiet. So the demons are in front of you, bills are in front of you, sickness is in front of you, but God said this morning if you're bold enough to lean on it, y'all, oh some of y'all, that's why he said make a joyful... No, no, you gonna catch it, you gonna catch it.  Too long to praise him you follow there was no special time about midnight It was about when they opened their mouth the walls of Jericho did not come down until the people shouted We took shouting out of the mouth and put it in feet. This is called dancing Shouting is done with the mouth and death and life death and life is in the power  The Lord said tell the people this morning the reason why they're late for their exit and can't get off on time is they're too quiet So the demons are in front of you bills are in front of you sicknesses in front of you But God said this morning if you're bold enough to lean on it yelling Oh some of you that's why he said make a joyful  You won't catch it.  you  Too long to praise him you follow there was no special time about midnight It was about when they opened their mouth the walls of Jericho did not come down until the people shouted We took shouting out of the mouth and put it in feet. This is called dancing Shouting is done with the mouth and death and life death and life is in the power  The Lord said tell the people this morning the reason why they're late for their exit and can't get off on time is they're too quiet So the demons are in front of you bills are in front of you sicknesses in front of you But God said this morning if you're bold enough to lean on it y'all it Oh some of y'all that's why he said make a joyful  You'll catch it.  you  You follow there was no special time about midnight It was about when they opened their mouth the walls of Jericho did not come down until the people shouted We took shouting out of the mouth and put it in feet. This is called dancing Shouting is done with the mouth and death and life death and life  Is it the power? The Lord said tell the people this morning the reason why they're late for their exit and can't get off on time Is they're too quiet So the demons are in front of you bills are in front of you sicknesses in front of you But God said this morning if you're bold enough to lean on it y'all it Oh some of y'all that's why he said make a joyful  No, no, you gonna catch it. You gonna catch it."
}