{
  "video_id": "SVKqjjdskwc",
  "transcription": " Further in stance, try and get it to take the one bounce forward. Trying to saw it off. Here it comes. Look at this. Yeah, it was wonderful. Sort of the path and the. In the stroke, but I could just be making sure they really picked their line as we have a great look here and yeah. Dustin Johnson there with an opening birdie jumps out of that step top.  And with the driver, that's a shape that should fit his eye. A little bit of a dogleg right. Went left yesterday looking a little right, but this is headed right. Right and the highway that is he just reduced this part 5 to a short 371 yards. I have his tee shots 145 yards here.  Yeah, took over out of play with that club right there. He's going to have a great look at Eagle for his birdie. OK, great start for him. Birdie Birdie start. It does to the Southwest kind of trying to head this way. 8 iron for Dustin with this whole right on the front of the green playing little down breeze.  Oh geez. I thought if that ball had a little spin, it might just dive in.  Might have been a little misread. It looked to me like he was aimed for it to go right. Tap in four, stays at 19 under. Up by three. Huge galleries following shot.  Johnson and they roar with their approval as he leaves at about 2025 feet below the hole. Now Dustin Johnson. On the team with the club that. Well, there's three clubs he makes a living with that one there. The driver, his wedges and his putter. He has been pummeling the ball with the driver.  Oh yes. Dustin Johnson now three under through eight holes today and 20 under confidence in his walk everything back on the tee. And Dustin Johnson. His shot being reflected by our top tracer technology. Perfectly positioned in the fairway.  into into the screens, turns it in for into a birdie hole. After that tee shot, the wind might be helping it go back to the right, but it's just not. There you go another one. In there nice and low. Clip the clean. Yeah, take the slope.  I yield smart decision. This is going to turn to his right as it gets to the whole. And finally. Finally, 13 is lucky for Dustin. If he can fly it today, of course. He loves to bring this one way in from the left side. Yeah, he almost cleared it. This one's better today. Love seeing that loop off our top tracer. It's a beauty.  10 out of 10 spectacular drive again. The two USGA winners in this final pairing on who want to USM at Southern Hills and. Dustin, who won a US Open at Oakmont. Her father, such a national hero, they've adopted Dustin, one of their own. That's a pitching wedge. How about that shot? No conservative play there. That's what he does."
}