{
  "video_id": "TJMrW-vgNz0",
  "transcription": " And now  First Drive, Porsche Panamera Turbo SE Hybrid Sport Turismo  SUVs that do essentially the same job. Although this is increasingly becoming the case even abroad.  variant, the range-topping Turbo SE Hybrid, which we had the chance to sample in southern Spain near the Ascari racetrack. View 66 photos, as cars go, this Panamera is pretty close to total bliss. The Turbo SE Hybrid contains the same twin-turbocharged 4.0-litre V8 that powers the non-electrified turbo, in which it's rated at 550 horsepower. The extra syllables in the long moniker denote the addition of a 136-horsepower electric motor that's integrated with the  8-speed dual-clutch PDK automatic transmission, for a total system output of 680 horses. Maximum torque is rated at 626 lb-ft from a low 1,400 rpm, off from the standard turbo's 567 lb-ft at 1,960 rpm. Again! Do it again?  package, Sport Chrono is standard on the Turbo SE Hybrid and the Turbo SE Hybrid will run through the quarter mile in a claimed 11.6 seconds, again 0.2 second quicker than the normal turbo. Top speed increases from 188 to 192 mph, although this improvement exists merely because Porsche has set the governor differently. This performance, by the way, can be replicated as often as you wish. Unlike the case with some fully electric vehicles that can deliver peak performance only if  few times, there's no issue with overheating here nor is output reduced as the state of charge is depleted, according to Porsche. In theory, this plug-in hybrid also can travel at up to 87 mph in EV mode or with an ultra-light right foot and reaching nowhere near the EV top speed up to 30 miles on a fully charged battery, per the optimistic European cycle. On the road, the Turbo SE Hybrid performs admirably. The power on tap defies belief, and the electric motor ensures instant response to prods of  It should be noted, though, that the regular turbo with the Sport Chrono package delivers almost equally aggressive responses because its turbocharger can be preloaded to provide instant boost for up to 20 seconds at a time. More money and more mass. Driving on electricity alone feels a bit gimmicky but fun, although we never managed to come close to the promised 30 miles of maximum range, as it would take an extraordinarily patient and disciplined driver to achieve that figure. In EV mode the Turbo SE Hybrid is super-cool.  we had at city speeds, but beyond 50 mph or so, tire and wind noise dominate. Once the V8 fires up it is always audible, especially in Sport and Sport Plus mode, but that's by design and welcome. If this V8 seems too loud to your ears, choose another driving mode. Or get a Lexus. If buzzing along on the power stored in the 104 liquid-cooled lithium-ion battery cells rocks your boat, we get it. Be advised, however, that this ability comes at a penalty.  Hybrid at $34,400 beyond the cost of the Turbo model, it also weighs over 600 pounds more by Porsche's own numbers. The added mass can be felt when putting this behemoth through its paces. The limits of adhesion are sky high, but the standard Turbo feels more agile, precise, and light-footed. Partially offsetting the price premium is that all the driving dynamic systems offered as options on other Panameras come standard on this model, excepting only the rear axle steering.  system is the only other performance-related option. That's because the sportly vehicle needs all the help it can get to feel like a proper Porsche. As much as its maker likes to tout a connection with the 918 Spyder, hey, they're both hybrids. We'd advise anyone who wants a Panamera that handles like a sports car to go with the regular Turbo. The massive battery pack also shrinks the available cargo volume from 18 cubic feet to a mere 15, which is a rather paltry number for a station wagon.  Not the sport wagon has 23 cubic feet of cargo space. But, as in any Panamera, you sit in extreme comfort and luxury whether in the front or rear seats. And the car can be specified with a full array of telematics and infotainment technologies that are generally intuitive and easy to use. If you want a hybrid because you like the technology or because they are incentivized in your area in the form of HOV lane usage, tax breaks, preferred parking, or rules that restrict access to parts of your city to battery  battery-powered machinery the Porsche Panamera Turbo SE Hybrid Sport Turismo certainly is among the very best and most fascinating choices on the market. If you simply want the best Panamera, or even a scintillating performance station wagon, we'd recommend taking a closer look at the regular Turbo Sport Turismo.  you"
}