{
  "video_id": "tNeWPZw0Igw",
  "transcription": " Mombasa, heavy flooding has been experienced across the coastal city following heavy rains. And this has not only been blamed on the poor drainage, but a problem that has been persisted for several years despite pledges by the county government to address the matter. Let's now cross over to speak to Francis Mutalaki who is following on that story. Now, Mutalaki, a few weeks ago there was no rain. Now we have the rain. It's flooded. It's a challenge. What are we looking at?  Well, after two days of heavy downpour, those are the pictures and the scenes in many parts of Bombasa County. Houses submerged and even some of the families cannot be able to move out of their houses. And this is as a result of the poor drainage system according to residents of this place which is Bamburi area. And currently where we are is a road between Bamburi,  to Majaoni and Utange, some of the areas that have been heavily affected by the ongoing heavy rains. But I want to bring in one of the residents from Mombasa County so that you can talk to us.  Marine Road.  I'm  I'm  I'm  I'm  How is the business going?  This is the situation currently and for the last two days it has been raining but until this moment as you can see most of the motorists cannot be able to move safely from this area. Also, border, border and tuk-tuk, that is one of the transport that is mainly used here in Mombasa and residents of this area are concerned that both the county government and national government need to do more in terms of the drainage system which is a county function.  more of improved drainage system as well as for the national government to make sure that this old Malindi road, because many years ago, Malindi road used to be, this used to be the Malindi road. Then after the improvement of the other road, then motorways were shifted to the other end. So they feel that after that development, then this road has been neglected. But now they want more in terms of the infrastructure."
}