{
  "video_id": "TqwXQ3zeAI0",
  "transcription": " Hey friends, it's 930 on Friday and it's a crazy busy day today so I'm going to try to take you along with me as much as I can. Both Braxton and the girls are having their Christmas parties today and so it's a little crazy. I'm going to show you a little bit of what I've been doing. So I'm getting Braxton's thank you cards out so he's going to hand those out at the Christmas party because we're a little bit late on doing that. For the girls party I've got Santa hats for the kids. Me and one of the  parents split between the two of us and got Santa hats for all the kids and let's see what else. So I have my HP sprocket and basically what we're gonna do is I'm gonna have a backdrop set up. Let me open this. So I have all these props for the kids.  so  And we've got a backdrop and I'm gonna be taking pictures of the kids so I'm gonna alternate them  while they're eating their snack I'm going to take pictures of them and then when they're doing their little book exchange I'm going to be using the HP sprocket to print out their pictures. Let's see. So here's the paper I'm using. It's zinc photo paper. So this is sticker paper and so when I print them out I'm going to hand each child an ornament and they can stick their own picture on here. So I bought enough sharpie markers for each of the tables so they can  all write their names and the year on the back. Here's all the ornaments in here. I got these at Hobby Lobby. There were four packs for $4.99, but I used the 40% off coupon for each and so I think this is about five packs in here. So it's like little pieces of wood and I think this will be so cute. I like for the kids each year to have an ornament that kind of represents that year. So I think all the parents will like this as the craft for the party because this is something that can keep forever and hang on their Christmas tree.  And they'll always remember this year, so I'm excited about it. Let's see what else. Also got these little baggies so we can put the ornaments in there. But one of their mom is helping with this and she's doing these little water bottles with reindeer. Little reindeer noses. You've probably seen them on Pinterest before and she's also making these little snowmen out of donuts. And then under here for Braxton's party is a fruit tray. I just picked this up.  it up at Walmart. So I'll be handing out all the teacher gifts and it's gonna be a fun day. So initially Braxton's party and the girls party was on the exact same day but but the girls teacher was so sweet she let me move the party back just a little bit so I'm able to go to Braxton's party for about 30 minutes and then I'm heading over.  I got it!  What did you get?  I'm"
}