{
  "video_id": "TsFhCunNbX0",
  "transcription": " Every great farmer starts with John Deere and this is the story of how it starts here.  We're looking for varieties that yield good quality hard bite potato chips. Step one is to find good land, we want good fertile land that's sandy so that we can grow nice potatoes. We grow about 20 to 30 different fields depending on the size. Step two in the potato growing process for hard bite, we want to source the best seed, we want to find good varieties. So for chips, we want varieties that the sugar stays relatively low so that they don't burn in the frying process.  that's been filled really well, that tastes really good and then look really good as well. So step number three, we want to prepare the land. So we want to work the land. We want to get the clumps down to a minimum so that while we're harvesting, we're not picking up dirt. When we're preparing the land, we usually start with our eight series tractors. We have an 8320 and the 8295. We use those tractors to subsoil the dirt for drainage and to dry out deep down into the soil. And we also use it for plowing,  we flip the dirt over, cover any weeds. Step four, we want to plant the potatoes and this is what we're doing right now. So after we've cultivated, we use the six series with row crop tires. That way we're driving in between the rows to avoid compaction where the potatoes lay. And we use a 6175R for that. We typically run three of these at a time. And we also use these same tractors to harvest the potatoes as well.  and the soil is going to be able to grow well. So step five, about three to four weeks after we plant, the potatoes start coming out of the ground. Once they're about four to five inches high, we cultivate, fertilize and water the plants if it's dry. So all our tractors, we run GPS, John Deere GPS equipment. All our GPS equipment comes through Prairie Coast. The main reason we do is for efficiency.  So it makes it a lot more efficient. Step six, we harvest the potatoes. We run 61, 75 hours to do that. Typically during the dry season, it goes fairly smooth. As you all know, it gets pretty wet in the Fraser Valley. When that happens, we typically run eight series tractors pulling our trucks through the field. Step seven, we store the potatoes. Most of our storage is in the back of the truck.  So this is all at our Cloverdale location. We also have a little bit of storage in Atmosphere as well. So step eight, once we've stored the potatoes, as the customer needs, we wash, grade and size the potatoes. This is also done at our Cloverdale facility where our storage is. So step nine, so after we've washed, sized and graded the potatoes, they'll slice the potatoes into chips.  in turn go into the fryer where they fry the potatoes. Step 10, we want to season and package the chips. We do this after they've been fried. From there, they get packaged. They go into a packager and get packed into the various size bags that Harbite produces.  ♪ ♪ ♪ Step 11, we want to do quality control. So for hard bite, they're constantly monitoring how the chip tastes, monitoring the burning, if there's any black spots on the chips. And if there is, then they'll reject the load so the customer doesn't get it. Step 12, once the potato chips have been packaged, then from hard bites plant, they'll be shipped out to the various customers. Step 13, the customers will enjoy the hard bite  trail trips."
}