{
  "video_id": "UggJrENa_Qw",
  "transcription": " Hello mate, how are you doing? Killskills here, back with another video for you. Just before we start guys, if you're new around here, please, please, please click subscribe. Also, there's a little bell by the subscribe button, that's the alert button. If you want to be notified every time I upload.  then click that button. Right, moving on to the video. I've got some mega news for you guys. I've been asked to go to China.  so  Anyway, I've been asked to go to China to appear on a TV show called Amazing Kids. It airs to 190 million people. So on the 18th of March, me and my dad and my grandad are trying out first class five star all-inclusive for the week to film this  TV show called What. So the purpose of this video I need some new freestyle shoes to take to China with me and look what I've got. Let's get this bad boy open. Also guys, there's a couple of ball shoes here as well. Oh, there's another bag.  One. Two. Three.  so these balls are a size 3 from adidas they look pretty sick and they'll match whatever's inside it says only the best for the after  You  What in the hell was that?  So I'm doing anything with my soles like flick ups. Grippy here, quite flexible as well. We've got nice laces, nice soft thin laces. So you've got a smooth white sole plate. You've got a full black checkered upper with white Adidas sign on the side. So these are really sick. I was thinking some freestyle shoes.  I was wondering what would be the best freestyle shoes. My dad thinks that Elasticos are really good at freestyle. They are, I'm not like being mean to Elasticos or anything, but like these, they've got really good grip and they've got really good smooth grippy soft plate. And as you can see by the checkered upper, you can see like little squares and you see the reflection.  lots of squares and they're really really grippy the ball so yeah I love these moving on to the balls right on the ball here the front side it's a splattered paint with an adidas sign in the middle of the paint you've got a gold adidas sign here at the back the balls are really sick they're all the same  they're really cool, i love these they're probably going to be really really really good at freestyle especially these so let's get these bad boys pumped up one two three so guys that's the balls pumped up let's get the other one out  All ready for my trip to China. I hope you enjoyed this video. As I said at the start, please, please, please subscribe and click that like button. My aim on YouTube is to get 100,000 subscribers. Leave your comments down below. I do try to reply to all of your comments, but I'm really busy with football, so it's hard for me to reply straight away. But I do try and get around to doing it. So yeah, hope you enjoyed this video.  Peace and techers, cheers girls.  You"
}