{
  "video_id": "UqCRnhHPaF0",
  "transcription": " AHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhh  Hey what's going on guys, Bjorn here again, Goosebumps number one Aussie fan bringing you another video. Now I've got some really, really exciting news to share with you guys. New Goosebumps fans and old. I cannot believe this is actually happening. A company by the name of Creepy Co has just announced a first wave line up of Goosebumps merchandise. And it is featuring the original artworks of Tim Jacobus. And that is why I say new and old.  because this merchandise is for everybody! I cannot believe they are actually doing it and it's funny how we just made a petition, we reached out to Scholastic and Sony and this happens. I mean clearly they would have already had this stuff, you know, in the early stages of planning but it just, you know, it's like a coincidence, you know, it's so amazing, I can't believe it. But yeah guys, and it's a first wave line up so expect to see a lot more. So, let's just jump straight into it!  3 different Goosebumps shirts featuring 3 of the most iconic book covers and they are $26.99 each and you have Night of the Living Dummy, so you've got Slappy on there and I love how you've got the red writing just like the book cover, it's amazing. And then you've got the Haunted Mask and you also have Welcome to Deadhouse. I mean, you can't have a First Wave line-up not featuring the original Goosebumps book, of course. Now, also you have these enamel pins.  And I cannot actually believe it, but there is one of Curly. Now, that is probably the only thing here that doesn't feature like an original Tim Jacobus artwork. It's a more obviously newer one, but yeah, it is really really cool. I can't believe they're actually doing one of Curly because I've seen this image before. I can't remember where, but it was definitely not like an original 90s one, but it's still, you know, he's got the pink ponytail, he's got the glasses, and yeah, it's Curly. But the fact that they've even done something Curly is just amazing.  And then of course you've got Slappy, you know the usual. He's in everything. Whenever they do lineups for things, there's always something Slappy. And the Horned Mask of course. So yeah, you've got the Horned Mask and then you've got One Day at Horrorland. So that, those are so cool. I just, I cannot wait to get my hands on it. Next you'll see there's also a t-shirt featuring the most iconic Goosebump book. So every inch of this shirt is printed with fan favorite titles, front and back printed for maximum exposure and maximum fun. So that is 34  and  it's all 100% licensed merchandise. So yeah, it includes a Welcome to Deadhaus Jumbo Print Tee, Limited Edition Flashlight, Limited Edition Logo Pin, and Haunted Mask Sticker, and that is $42.99. So, of course guys, there is going to be a second wave of this stuff, as I said before, and yeah, who knows what's gonna be in that. So I'm really excited to find out. So yeah guys, as you have just seen, there is some really, really awesome Goosebumps merchandise coming your way. But remember, get on there right now  I mean they probably will be gone by the time I upload this video, but get on there right now and secure yourself one of those book box sets because there's only 100 of them so get in there quick. Anyway guys, I hope you enjoyed this video, and I will see you again soon.  Thank you."
}