{
  "video_id": "UUVxmfaB08Q",
  "transcription": " It's 4 40 a.m.. I'm on my way to the airport. I'm going to Texas today Back at the airport again. Take care, sir  Heyo  Been waiting to open this. You have one of these? This is a Nintendo thing? Yeah. No, I've just seen it. I was just gonna get it. This has to be the only in-flight Switch unboxing. So this appears to be the tablet. Joy-Con.  Joy-Con 2. Charger, controller, handle.  The problem with all really good video games is that I won't get any work done until I beat that game. It's so good though.  Alright, back in Austin, Texas.  Hotel check-in change shower run All right, so I'm here in Austin, Texas for the South by Southwest. It's like a music festival  Film Festival, Technology Festival. I'm here with CNN. I'm speaking at an event tomorrow afternoon. So I kind of have a lot of free time, but there are like a zillion people in this town and it's a little hard to get around. I mean like you can't get a taxi, it's hard to walk, it's packed, but I did bring. I got the Boosted Board, so before that happens though, I'm meeting my friend Ryan  We're gonna go for a run. Okay. I run. Running with Ryan. Juice and miles. How many miles? 4.27. How many more? Six. Okay. So we can't swim? No. We were gonna go swimming, but we can't go swimming because it's closed.  the room my my like room comes with access to like an executive lounge I don't know what that means but I'm gonna go find out I just ate four of those cookies I'm gonna go I gotta get out of here  Lunch was good, lunch was good? Lunch was delicious, it really was. Now Paul goes to work and I'm gonna go to bed. Paul?  Later! That's the convention center there where like the whole South by Southwest event is. I'm just kind of bopping around now. It's the best way to see the city is on a skateboard, especially when it's like, like this whole street's closed. When it's this congested, you can just zoom around on the skateboard.  Casey Jeff, Casey's a sh**. Hopefully you see me on a video one day. This motherf***er rocks. Nice to meet you man. My favorite thing about coming here every year are meeting all the friendly people. There are so many great... Nice car. Are you taking a still or a picture? Video. Alright. Nice to see you. Nice to see you Casey. Can I have a triple grande skim iced latte please?  That's not a drone shot. I'm actually just in my hotel room All right. I'm going to like a dinner now. That's kind of the end of my first day here at South by Southwest It was pretty awesome How about this for an end of the day surprise? Look at these delicious treats. This is some sort of guitar with bar snacks These are cookies or something. Those look like bonbons and look at this note I don't know what that font is, but it's very handsome dear Casey. We're excited to have you  Well hey, thanks a lot JW, I really appreciate it. I'm gonna go ahead and eat this and see you tomorrow."
}