{
  "video_id": "UvsDfp_gNo4",
  "transcription": " I'm at the biggest video game convention of my life. Alright, I'm at Gator... What is this? Gator Gaming, I think? Gator... something like that. There's people everywhere. They give out free Red Bulls, dude. Free Red Bulls.  Give it back to me. We get free Red Bulls. This is like my fourth one. I got like so much energy. I just feel like jumping up and down. Ready to rape somebody at Madden. I think I said that already. Is this your normal free game routine? Yeah, Red Bull before every game. Red Bull gives you wings, dude. Just go crazy. Go crazy. I'm about to play my first game at Madden over here. Kill some noobs. First game, baby. Get hyped. Yeah. Just gotta do my thing.  Asian domination. Asian domination. Here we go. 7-0. We'll come back. This is either the face of defeat or the potential face of victory. I'm about to win, dude. I don't know what you're talking about. 14-0? I come back from 80-0 for breakfast. He's willing to go to the ends of the earth.  That's the kind of stuff we need right there  That was freaking amazing. I mean, I think I saw him at like Mad Nation or something. He was the guy with the jersey. That was probably him. I mean, I lost 21-0. Let's get a good look at this guy right here. Before... Uh oh. Uh oh. There he is right there. Right there in the gray. No. Dude, I was having a bad day. Peyton Manning did come through for me. The Colts shouldn't have picked him. Should've went with the Saints instead. Yeah. Like I said, the Colts, they suck. Never playing with them again. Next time I play, gonna win it.  Peace out.  I mean, I'm willing to go all the way. I mean, I'm just gonna prepare. He's ready to pawn some nukes, guys. Route hack, going on to round two. Tell me what your KD is. It's like 3.1, you know what I'm saying? That's no big deal. Come on, what's your KD, man? Like 3.58. Say that again? 3.58-ish. My real KD is like 55 to 1, but I don't want to brag, you know. I mean,  It's bad enough that I got a ruined kids gaming experience and stuff like that, but I just figure I'm gonna come I'm gonna be like be like the ninja. I might just do quick silent and deadly What is it final four elite eight one of the two and I'm not gonna lie the competition has steadily grown We've gone from new tubes to pro pipers. You know what I mean? I mean these guys are They're getting there right games about to start. Yeah, I'm gonna try to pull my a game. What's your strategy?  Work hard, play hard, and work as a team. There's no I in team. I'm going to show these guys that right now. How many kills are you going to get? Hey man, you know, it's all about teamwork. I'm worried about assists right now. Are you going to be like Kobe? Are you going to be clutch?  you"
}