{
  "video_id": "UXEgcBFBoRo",
  "transcription": " Good morning! Buen dia Barcelona! We're all here! Ready to explore? Yes! We're gonna see an amazing thing I think  I don't know it Are you excited at all? I am so excited How excited? Like so much If you could show me in... Take it easy That guy was angry If you could show me how excited you are in a 5 second dance What would your dance look like? Off to explore Another day here in Barcelona and I'm absolutely loving this place I don't wanna leave  Definitely have to come back. There's just too much to see, too much to do. And I love it. All of it. Language. Spanish, but it's European, but it's tropical, and there's palm trees, and there's parrots, and there's... Beaches. Sexy people and beaches. It's just awesome.  How do you build something like this? There's so much detail! It's absolutely incredible, like I don't even know how one person can come up with all of this and make it happen It's incredible So much detail See, he's more like a painter He doesn't look like an architect No, no, no Alright, Sofia's been waiting for this moment to come in here  I  you  you  This place is like stepping into a different world, a different  Era it's a different world. It's Overwhelming it's I've never seen anything like it how Gaudi Came up with the plan for this like blows my mind I can't even understand because there's so much detail and everything means something like if you look at these pillars These are all trees trees and they're all different made of different different  size stones are different width the branches like branch out at the top as you can see and there's like leaves and so it's meant to feel like you're almost like you're in a forest this is a very futuristic design i mean you feel like you're kind of stepping into a future concept of what a building will look like in a thousand years  but it exists right now. This is a collaborative effort of all the masters of design and architecture into one building. So I'm starting to do something new, because people always ask me to take a picture of them. So the first thing I do when I get their phone, while they're getting ready for their pose, flip the camera, take a picture of myself with a funny face, and then I take a picture of them.  And the review is always funny when they swipe to my picture. We're now in the gift shop. This thing is crazy. I'm gonna see if this will work on camera. Whoa. Okay look, this is Kristen's face. Whoa.  If you are in Barcelona, you have to go. Get your tickets online by the way, they're cheaper. Yes. Before you go. And get the student ticket. We are on our way to Parc Güell for sunset. And we're gonna make it there just in time. I don't think I've ever seen escalators like this.  the hill because it's a pretty big hill. Alright guys, it's getting a little dark but we made it. Look at this. Crazy looking.  You"
}