{
  "video_id": "Uy4viSMpQBA",
  "transcription": " Hey guys, it's Alex. Welcome to Bangkok. Today we are at Thailing Chan Floating Market and we just sat down to a delicious lunch. I'm gonna show you around the market and show you what you should maybe be doing if you decide to come visit. These are gonna be so good. First we had two shrimp river grills. One of them's already been destroyed. Here's the other one. And then Chris is enjoying some beef noodle soup. Which was also super good.  And as you can see, it was cooked right here on the grill.  We were absolutely starving so we filled our bellies first and now we're gonna go look at the market stuff so the shop  All that kind of cool stuff.  they know they're not delicious and they get fed. So the actual floating component of this market isn't that big but it's big enough to be really cool and you can get a delicious lunch, lots of fresh seafood, but what you really want to do is check out the market and just kind of wander around.  Make sure you come with a big appetite because there is so much food here.  This is gonna be my souvenir. It's a little tuk tuk made out of a Chang can of beer. So cute! Alright, we're gonna get some durian fruit. So this is where we're sitting right now. It's cute. It's by like a little river way.  It's really cute over here. But I would definitely say that if you're going to be eating here you want to go eat by the river and actually have the experience of eating with the floating market. So I definitely recommend the Thaling Chen market. It's a fun way to spend an afternoon and you can get a feel of the floating markets without having to go Thaling Chen. Thaling Chedum. Thaling Chedum market in Bangkok. It's only 17 kilometers.  It was about a 30 minute taxi ride at 8 in the morning. It's only open Saturdays and Sundays. We made that mistake and almost came here yesterday on a Friday. By we we mean me because I'm the only one who researches things on this trip. But definitely come Saturday or Sunday 8am to 5pm. 17 kilometers from Bangkok. How much was the taxi? So the Uber that we took out here was 176 baht which is about $5.  Uber Black  So that's all I hear from Ta Ling Chan floating market. I hope that you've enjoyed exploring with me and I will see you again soon."
}