{
  "video_id": "v2Tlscx1Rzc",
  "transcription": " I got the new board from electropartsonline.com for $17 or $18, free shipping. This is the old board, the T-con board. So hopefully this new board will fix the issue. Okay, now we're going to turn the T-con board on.  me out and see if it fixes the issue. Alright, plugged in. Let's take a look down here and see what we got. Oh God almighty, this is a defective screen. Oh boy, yeah. Yeah that doesn't look good. Oh, lost picture again. Yeah, so no go with that one. This is a  lost  voltage. The voltage is assigned. So I was reading 1.3, very low voltage.  It actually says Shop Jimmy right there, there's the stamp.  All right, so I replaced all the boards the power board, the main logic board and the t-con board which controls the screen to display panel But I think we have a bad display panel. That's why it's not working plug it in take a look and  And yeah, same issue. Yep. My loss, your gain in knowledge.  I  I got lines on the screen for maybe like a minute and then blank screen all over again. So it looks like we got a defective screen. Yeah, so no matter how many boards I put in, they're all gonna go bad. Thank God for the good exchanges and warranty and everything else at shopjimmy.com. I think they have a restocking fee, but I'll get most of my money back, which is pretty cool.  online.com. I believe there's no restocking fee, free shipping, so that's kind of cool too. Better actually. And then I'll get most of my money back. Lost a little bit of money, wasted my time. Well I don't know if I wasted my time. Made this video, hopefully it helped you out. If it did, give me a thumbs up. And if you want more tech videos like this, or this is more of a troubleshooting guide, not really a repair video. But still, if you want some of these videos like this coming your way, subscribe to my  Tampa Tech, click on the bell notification down below to stay notified on the latest videos. And if you want to check out my other repairs that actually repair TVs, click on this repair playlist. And if you know anyone that this video will help, go ahead and click on the share button below and share this video to them. Now I'm going to have to find a way to recycle this TV."
}