{
  "video_id": "vCTLISHzJyM",
  "transcription": " This is Audi's third generation TT. Let's do a quick history recap. The first one, while it's been many years since it was first released, actually was a really groundbreaking car. It looked fantastic.  second  means that you can customise it however way you want. So at the moment I have this wonderful sat-nav view in front of me. If I want to bring up my speedo on my rev counter I can make them bigger. If I don't want to have any of that sort of stuff and I want to have my phone or the radio or my trip computer I have it all at a touch of a button all on this side of the steering wheel. No faffing about in the middle. The air vents, well look at these things. I mean you've got the temperature gauge in the middle of the air vent and you can control opening and closing it down here. They look like the turbines from a jet engine.  engine and on this side if you push the middle of it you get your heated seats. Everything is just so beautifully self-contained. I have not seen an interior this good, I don't think ever.  engine in a roadster or a convertible.  by taking the roof off a TT and putting a diesel engine under the bonnet. So it really doesn't really matter what's going on underneath so long as you're saving a few quid, isn't that right? No, it's not right. It can't be right. You've got to have a petrol engine in your convertible for God's sake. Now, it's not exactly warm in Dublin at the moment, but if you're going to buy a roadster and not put the roof down, then why buy a roadster in the first place? So I've got the roof down. The issue with that is that what starts out as a semi-respectable  haircut at best turns into something completely unfathomable. I mean, what is that? So if you think you're going to be one of those people going, oh, it's a bit cold, it looks a bit like a good rain, I don't think I want to put the top down, go and buy the coupe. However, the TT has a really nice trick that not every roadster has or can do. And if I start driving, finally, come on, South Dublin traffic, I can show you. Because as I'm driving along, if I feel any spots of rain coming, I can decide  to put the roof up as I'm moving. So you don't have to pull in and pull up the handbrake and go through all these stupid processes in order to get the roof up. And it goes up really quickly as well. And then from once I'm inside and the roof is up, it's actually quite quiet. It's nice and refined. And then in terms of everything else about the car and what makes a car, its steering and its suspension and its handling and its chassis, well it's very quintessentially Audi and that means that it's very good and soft and supple over the horrible bumps in the road, but yet it corners lovely and fast.  flat and level. And that to me is just very, you know, what I would expect from Audi. You might be blown away by it. I may be a bit numb to the experience at this stage because I've driven quite a lot of them. But as a Renault Megane tries to crash into the front of me. But I mean, look, there's a lot to be said for something that's built to this quality and you do get what you pay for when you pay the premium price. You get a premium brand, premium quality and something that just looks not like anything else on the road.  you"
}