{
  "video_id": "VED-6BLrWFg",
  "transcription": " Hey guys! It's Deja and Di-V and welcome back to Squared! We're your Saturdays here on Squared. And for this week's video we are going to be doing a study with us, taking you guys along so you guys can see how we study and you guys can study along with us in case you are studying too. That way we can all suffer together. Yes! If you guys like this video be sure to give it a big thumbs up and subscribe down below to the Squared channel.  Okay guys, so I'm studying for my Paul in the early church class This is one of my Christian studies classes that I'm taking this is actually my last Christian class that I'm taking I could take more  but for general ed requirements this would technically be my last Christian Studies class. And what I like to do is I will go online and open up all the PowerPoints that he has online for us. And this is the study guide, study outline for his exam. And then these are my notes that I've actually taken on the study outline.  and on the powerpoints as well. So, what I will go through and do is I will take all of this and I will basically use this to see if I missed anything in my notes and put it here, I'd write it here. And then I also will look at the powerpoints, see if I missed anything in my notes and write it here as well. And I like to use sticky notes to just highlight key points and put the answers, so.  I put a lot of sticky notes here on my papers. And then I have some more sticky notes. And then I also have more sticky notes. And I also will highlight as well certain parts of my notes that are important. And yeah, so that is usually what I will do for this class at least. So I love to keep my highlighters.  and my sticky notes handy. And I mean, you can get sticky notes from anywhere. I think we got these from like Walmart or something. And then highlighters as well. Nothing too fancy, but this is just what we're using at the moment.  Classical music. But the thing is, we don't like to just listen to classical because sometimes it can be a little bit boring. So we like to spice things up. So we like to listen to the ethereal remixes of songs and of classical songs because it just sounds much more heavenly and dreamy and just, I don't know, just sounds a lot better. And it gets us more in the mood to study. And we have a favorite YouTube channel that we go to in order to listen to all the ethereal remixes of like some classical songs, which is called  a.krishna that's the name of the youtube channel and we just like to listen to the ethereal remixes on here i'm not gonna play any of them because you know copyright but we'll show you like just what it looks like  I'm not sure if I'm pronouncing all of them correctly.  So yeah, and that's what we are about to do. So it's time to get our study on and do a time lapse a bit of this. And if you guys are at home and you're studying for an exam too, then study along with us.  do  Okay guys for my class that I'm studying for right now it is math it is actually algebra for college students This is my second time teaching this class Yeah, but anyways I'm doing chapter 10 at the moment I have not done 10.1 we have a quiz tomorrow and  and I'm doing 10, I finished homework for 10.2, 10.3, and 10.4. There's just some questions on 10.4 and stuff that I don't understand. The ones that I don't understand, I put a sticky note next to to ask for help. But these are basically like what I've finished. And in 10.2, there's only one problem that I got wrong and I don't know why, so I put ask for help.  No, that is 10.3. Okay, yeah, but I still only got one wrong and I don't know why. 10.3, two of them I don't understand, so I need help on those. 10.4, this one I don't understand, and also the last four or five problems I don't understand. So, yeah, and those problems will be on our quiz tomorrow, so I sort of have to understand them.  So yeah, and I have my handy dandy calculator, especially because we're doing logs and exponential functions and stuff like that. So there's a lot of tables and graphing and everything. And I also have my ruler that I have to use because to make sure my graphs are nice and neat. And yeah. By the way, guys, I don't know if you guys noticed this. My cat's crouching. I just wanted to point that out. I'm like showing the ruler and then I have a little-  I hope you don't think I did something. It legit was from my cat. She's always scratching us. I have so many scratches on my arms and on my hands. I have so many scratches. But we're going to get her nails declawed. And I know, I know. She's a cat's life man. But she's going to be indoors anyways. And I cannot take it anymore with her scratching us. She's so cute but that's the only flaw to her. Yeah, she scratches too much.  please leave them down in the comments below. That way then you can share them with everyone so everyone can have better ways to study because everyone wants to be better at studying so they can get better grades. Thanks for watching! If you enjoyed this video, remember to give it a big thumbs up and also check out our main channel down below. If you guys would like to see yesterday's video on Squared, be sure to click right over there. If you'd like to see more of us on Squared, click right up here. And if you would like to subscribe to the Squared channel, click right over here. See you guys next time! Bye!"
}