{
  "video_id": "vNHS63vQoOc",
  "transcription": " We weren't always motivated by love. So basically we got married really young and it was like this whirlwind of a romance. So for the next six years of our lives it was having to come before God every single day and being obedient because the last thing we wanted to do was be married. Communication was really hard at times. I think that it just almost felt like we were speaking a different language.  With communication, it was sometimes we didn't talk to each other for days. Sometimes it was screaming and yelling and you're the awkward couple walking out of the apartment that has just had the fight and the whole entire apartment complex is coming out to see like, who is the crazy couple? It was us. It was a day, day by day type of process for us trying to figure out how to keep this marriage intact and keep it together.  Dare. We started with the free test online. There were a bunch of great questions on lovedaretest.com that showed us areas of the book that we should focus on. Basically, the Love Dare is a set of devotions and daily challenges. Over the course of 40 days, you are dared to show simple acts of kindness and love towards your spouse. And all the while, you're encouraged to write down these experiences along the way. Before we started this,  this  came to realize how the things that I spew out of my mouth can really affect the other person. What we really learned is that patience is more than just holding your tongue. It's taking a deep breath in, gaining new perspective, and then giving the condition of my heart over to God. And that was just day one. Day 13 was love fights fear. The dare was to talk about healthy rules of engagement.  may or may not have fought over that dare. But it was good in the end. We actually began the process of learning how to disagree in a healthy way. Day 18, love seeks to understand. Day 22, love is faithful. Day 30, love brings unity. Day 20, love is Jesus Christ. Day 40, love is a covenant. We were talking more intentionally. We were reading the word together more intentionally. We were giving to each other.  each other more intentionally and loving more intentionally. At first it was challenging, but soon I found myself falling more in love with her than ever. And in the end I felt like we really began to learn what real love is all about. And we were really excited to find out that they had a Love Dare book for parents too. We're in the middle of these dares as parents right now and just like the Love Dare book helped us grow together, the Love Dare for parents is really bringing  about change for our whole family. These books, along with the free online tests that come with them, are so much more than books. They're really a journey.  you"
}