{
  "video_id": "w0Mg6Stk58U",
  "transcription": " So anyway guys, thanks for watching, I hope you enjoyed this video and...  talk about this whole collection thing I mean these little pets are ruining your life look at them they're everywhere no they're not silly I just like collecting them and I'll admit my room's a bit of a mess but I'm in the middle of making a video Maddie your pet crickets don't even like them look  No, no, no, no, no. They're just playing. I guarantee you, if you walk into your bathroom, there'll be pets in there, no doubt. You're addicted, Maddy. Fine, I'll go check. Um, fair enough.  Okay, maybe I'm a little addicted to them and they are kind of everywhere but I love making my videos and speaking to all my friends online and just connecting with people who also really like LPS. There's nothing wrong with that. Yeah, I guess you're right. Just make sure to keep it clean, okay? I don't want to find pets in my bed soon. I'll see you later Maddie. Bye. Okay, now  Where was I?  Oh, uh, sorry, I didn't see you there. You're a... pet? Yeah, I'm one of your pets, actually. I kinda sit there on the shelf a lot because I use dogs and cats in most of your videos. Yeah, sorry about that. I'll try and use them all. Where am I? And what's going on? And why the heck can you talk? I'm here to tell you that you did it, Maddy. You finally did it. Congratulations. Did what?  I'm confused. What the heck? Get off me! Get off! Oh, sorry Marmalade. I guess it was you who woke me up. What did you mean? I finally did it, huh?  Huh, gonna give me the silent treatment, huh? I'll get it out of you somehow. Huh, I wonder who it is. Oh my dog! Hey guys, it's LPS Honey! We did it!  Thank you, thank you, thank you, thank you! You guys don't know how much it means to me. We reached over 2,000 subscribers! Like, that's insane! Yeah, considering how much we suck at making videos. Don't listen to him. No, but really guys, thank you from the bottom of my heart. It really means so much that you guys enjoy my videos. And yeah, I just really love interacting with you guys in the comments section or through DMs on Instagram. It's just really, really fun talking to you guys.  you guys and chatting about all the new LPS and old LPS and the series I'm doing and someone is banging in the background. Okay anyway, um I wanted to take the time to ask you guys to leave some questions in the comments down below because I'm going to be doing a Q&A. It's actually going to be like a three-part celebration. This is part one, part two will be a Q&A and part three will be a room tour because I've been asked to do a room tour a few times  And I think you guys should get to know me better with a Q&A. So leave as many questions as you want in the comments down below and I'll answer as many as I can in the next couple weeks when I film the Q&A video. Again guys, thank you so much for over 2000 subscribers and I can't wait to see where the channel goes from here. I really hope we grow as a big community. And yeah, I look forward to seeing all the questions you ask me in the comments below. And if you enjoyed this video, of course, don't forget to like, comment and of course subscribe. And I'll see you next time.  bye guys so like do we leave too or"
}