{
  "video_id": "W1UUL7_bElQ",
  "transcription": " How do you feel? About what? You're getting a tattoo today. Your first tattoo. I'm a little scared. It's gonna be pretty. Because it's ugly. I know. Cute little room. Little patio. This is your wood plant. See, it's right here.  I'm pretty sure they are messy. What was I getting? I don't remember.  Welcome back to our channel. In today's video, Johnny's gonna get his first tattoo and he's nervous. I'm anxious. Nervous. He's like talking about like weird things he's never talked about. About weird things? Yeah, you're like, oh, do we have gas? Do we have gas to make it there? No, that's weird. You did. I'm just saying. You never say that. I'm just saying there's a bunch of terrible tattoos out there. Yeah, you've seen terrible tattoos on Instagram.  I didn't impersonate even one person. So I was a little nervous. And you like paused, you're like, you sighed and then you paused. You never do that. You like stared into space. This is forever. I don't wanna have to look at my arm and hate it, you know? But don't get me wrong, the artist, he looks like he does great work. And obviously we came all the way to California for this. Last minute, by the way. But yeah, I'm hoping for good.  And he was an artist before this Yeah, I think he look at his bio. He said is from Barcelona They used to do murals over there Came starting tattooing and then he came to LA Well, see We had an amazing breakfast though Got an Airbnb last minute too, but it was a really nice spot. Yeah, it's super close to the beach  walking. The place that we ate was called Mercedes. I don't know what it's called. Yeah, it was Mercedes Bar and Grill. Really good breakfast there. That was good service too. The lady was nice. Yeah, she was nice. And it was kind of cold. It's chilly for sure. But people were surfing and walking their dogs. People were wearing shorts. It's nice. It's nice out here in Cali.  I'll hook this on your skin so you can see how it fits. If you want it bigger or smaller. I'll also lengthen it a bit more from here.  It's big. We have work to do. If you make a piece of realism here, it has to be this size. Realism is not like this, like patches, like plates. Realism has to take everything. I don't know if you have thought about continuing with the arm. If I make something small, it's very difficult to put it all together.  so that you can continue later.  How does it feel? Very good.  So today is day two of my tattoo. Hopefully I'm gonna complete it today. Just a recap from yesterday. I'm sure everybody wonders about the pain. That's what I was mostly concerned about. It was my first tattoo. Some people told me it was a bad deal. It was gonna hurt a lot. Some other people said it was gonna be okay. So what I can say from my experience is that the pain, the constant pain is tolerable.  from 1 to 10 like a 4 out of 5. I managed to go through it pretty well actually. You just kind of stay distracted some and it typically helps. Just the only point I think maybe for like a 10 minute stretch mark I actually got like a little lightheaded and started sweating. I don't know if that was the pain getting to me or I was in a bad position or something but after that I drank some water and I felt fine. The tattoo is looking really nice. Today we're going to do the shading aspect of it. Yesterday we did the lines so it's going to bring out that tattoo and bring it out to life.  you guys know how it goes. There's Ashley. See you guys in a bit.  Maybe it doesn't hurt, because I've done this to you. I was thinking... I've been to Los Angeles. First I thought, how can it not hurt? It's impossible. I've been thinking about the vaccine. I've been to Los Angeles. If not, I'd better not go.  7 hours? Today? Yesterday, I didn't tell you but yesterday we started at 12.30 and we left at 7 or so. Today we did fly.  Super talented!  I'll be posting pictures how it looks as it heals and see how the differences are but for now I'm very happy with it. And I think the guy did a wonderful job So I want to thank him and thank you for staying with me the whole 15 hours. Yes, we'll put everything in the description below Thank you. 10. That was it 10,000 boxes tattoo shop His name is Arthur Arthur Arthur  Thank you for watching. And yeah, you guys for watching the same with us. I will see you guys"
}