{
  "video_id": "wA5pD_-mBMg",
  "transcription": " Hello, so we are at the airport in Vietnam, now in Ho Chi Minh City. So we are just sitting out here. I've got a Burger King, which is a fillet of fish and then some chips. And basically we're just waiting for our flight. It's like in an hour, so we haven't got too long. And yeah, then we've got  basically an evening in Bangkok and then home tomorrow so we are looking forward to it actually we are on the plane on our way to Bangkok and I'm about to edit another day back in Bangkok got to go through passport control  and then we might catch the SkyRail to the hotel rather than our taxi to save some dollar well, bar down we are on the SkyRail which is actually everything there's an airport here too lovely, beautiful  like heaps of struggle literally our bags are so heavy they're really badly designed and we were sweating out do not buy these no face bags like just to let you know if anyone's considering it don't buy these backpack looking bags they are really poorly designed and they dig in your back and everything else so really good but anyway come into the hotel room and it is gorgeous um our treats for the last night so yeah this we've actually got a kitchen  a fridge and a microwave and everything else. We've got, oh my god, yes, we've got a bath and it's literally really nice. And then, ooh, there's another wardrobe there. And then this is the bedroom. We've got a balcony and then watch this. Wait, wait, wait. You open up the wardrobe and the light turns on. It's pretty neat.  50 for 40 quid for a night So like our first night well that was in Amsterdam. We had a shared bathroom in it was 40 pound a night This is like cheaper than that. Well two pound cheaper, but still cheaper than that and it's so nice you get so much for your money. Yeah and then This is what we see And then I think the pools upstairs which I cannot wait to go in but  we're starving right now so yeah pretty decent for the last night so we're just walking to find the New Yorker cafe which we've checked or we're just gonna try and find some lunch anyway but there's not a lot of street food on this part where we're from so it's a posh part yes  not as like crowded and stuff which is nice so we're just trying to find somewhere to eat thank you after 4 weeks I finally got a good cup of tea and we're not even home yet no we're in Bangkok but we're in the New Yorker cafe and I've got an American breakfast coming I'm watching the American politics debate  You got a big English breakfast coming. I got a big breakfast. Yeah. I'm a big girl. And I've got a tuna sandwich. Because I love tuna so much. Classic hair. Here we go. You happy Al? Very happy. And this is my tiny little tuna sandwich.  Good evening Elle has decided to convert herself to a monk We're going to shave her hair and her eyebrows in a second We're about to go to the swimming pool actually We are I smell self-health washing powder We've just come up to the swimming pool and it is an infinity swimming pool and look  that is pretty cool very nice with what a view  It really is another side of Bangkok Just walking down what we think is the red light district  There's a lot of strip clubs, that's for sure. I don't know if you can see in the background. So I don't know if they turn us off for videoing. So I'm trying to get them in the background. I'm done. I don't think we have dinner here, though. No, we're trying to look for a place for dinner. We walk along this road full of strippers. It's really funny.  Taking a photo? You're filming aren't you? Yeah! I'm angry at you. We are in a lovely little Italian in Bangkok. It feels like Italy. It literally is really nice. It's lovely. Carbonara.  and lasagna looks amazing it does, it smells so good  you"
}