{
  "video_id": "wE2TaVedY5Q",
  "transcription": " I  I've just been informed, it was actually 13 years ago, in Stephen Ryan's, there was people that were on the street that time that are no longer with us. But Stephen Ryan was there, I was there, Daniel Wallace was there, and we came up with this idea about bringing art to the people and to raise the profile of Rochestreet. Because most people would say, it's on Rochestreet, and I go, where's that?  And you'd say, do you know Helene Maud? Do you know Eve? Do you know whatever? So we said, let's raise our profile and bring art to the people. Because, I mean, even myself, I wouldn't feel comfortable going into an art gallery. Kind of a bit intimidating. So we brought it to the people. And that's how the whole idea happened 13 years ago. It was all about, we decided to make it about charity then. So this year, our two charities are Limerick Search and Rescue, fantastic charity, and Midwest Spina Bifida. How it works is 25% of all art sold goes to our two charities.  and in years we've been doing it we've raised over 100,000 euros. This is very much a family street. If you look up and down the street there's families here. Do you know it's a family serving family street very much so and I think in this day and age of all multinationals and everything it's nice you get great service on the street and we all know each other. We all kind of back each other up I hope.  So without further ado, I think I'd like to introduce our two charities.  Mayor, Chairperson and ladies and gentlemen, on behalf of the Limerick Marine Search and Rescue we'd like to thank the Rochester Raid Traders for nominating us as one of the recipients. We're a voluntary unit where I'm called 24 hours, 24 hours, 7 days a week and we're 28 years doing what we're doing on the voluntary  basis and it's only that people like yourselves that might consider taking us as a charity for the year or for a period of time. We couldn't survive, we couldn't survive because we were working at the very beginning out of our pocket. Now those days are gone and it's people like yourselves that decide on taking us on and we're so grateful to you people for  in association with the other charity that you've thought of us. So once again, thank you very much for your kind offer for us. Thank you.  create goodness for each other. And when a group of traders here on the street come together for two most needy causes, that's what it's all about. Love reading your comments, and Nigel's comments, they're all so positive. So please, the message is positivity, Limerick is open for business, and this is an example of it. We're very honoured to have as our guest speaker this evening, Pat Short.  Thank you very much. It's great to be here. I'm delighted to be here on Rochester Street because I have huge memories, fond memories of Rochester Street. From the mid-eighties actually, strange enough, I learned to play saxophone on Rochester Street. Yeah, I did. I used to come up from Tordes every weekend. Peter D had a school of music around the corner, you might remember that, just there. I spent a year or two there playing saxophone and studying jazz.  positions here in Limerick. So that was my early start on Rochester Street. I have really good memories of that. Then I came to art college in Limerick and I used to fall up and down Rochester Street. I don't have such good memories of that but I had great times. It was kind of strange being here again tonight with the Mayor outside where last time I spent some time with him I was pole dancing in Castle Connacht. He'd tell you all about it later on. He nearly got me swinging from a pole outside there again tonight. But it's a fantastic  I think it's a wonderful thing what's going on here on a serious note because it is a great thing bringing art to the street and Rochester Street is almost like the centre of Limerick. So it is very much the heart of the city and a great community kind of vibe here and has been going for a couple of years. So I'm delighted to be invited along by you and the lads to be part of all of that. So by putting art in the windows it brought people in to look at the community and the area and I think that's a fantastic thing.  here and I hope it's a huge success for I know it has been for the last number of years for all the business people because I know being involved in business myself it's hard enough nowadays running a business to mind running a festival like this outside of it. It takes a huge commitment and I think everyone on the street here should be applauded for that it's a fantastic thing and it's great that the charities take something out of it as well. So listen I'm delighted to be here I won't hold you up any longer get stuck into the wine in the back and I'll see you for a bit of posting outside with the Mayor later on. Thank you very much.  Thank you."
}