{
  "video_id": "WU1-jSwNySQ",
  "transcription": " Hi guys, um, welcome back to another YouTube channel. Um, I have my iPhone here and um, I wanted to do a thing with James Charles because I love James Charles. So I'm just gonna go ahead and take a screenshot and with the screenshot it shows up this right? Okay, so what you want to do is you go up here  a  you all the stuff of James Charles that I made of him. So after I'm done doing all this stuff, I'm going to show you practically the video that I made of him. So I'm just finishing it. I don't know how many pictures I took so far, so no judges.  Okay, I think that would be enough pictures. Okay, I'm gonna go right here. This thing. It's like a picture maker. It's, I don't know what it's called. And I only took one, two, three, four screenshots. I need more. So let's take like,  I'm definitely not doing that These are not freaking James Charles  These are photoshopped Okay, oh, where are you taking? Oh, that was a horrible one, you know, it's just no no, I don't want that Yeah, that's better, okay If you guys have an iphone and you don't know how to work it uh comment down below because I'll definitely Help you work your iphone  and boom! I think that's enough.  I'm gonna do that. It's okay. And then if you want to follow me on tik-tok, we can follow me like I have snapchat and stuff Okay, and then I'm gonna find James Charles I follow all the James Charles  I can't contour so well.  I'm not a liar.  And then I posted  Okay, if you want to follow me  Here's my stuff and I have zero bikes because Read my bio. I'm a nobody. Oh Yeah, shaming And my account is private so I will follow you back  And there's a you guys It's not showing it's just showing me There's you guys Hey, okay. So anyways, my thing says hey boo and if you want us just screenshot that Okay, and one two three eight eight eight Kitten one two three  8 8 8 and it's spelt kitten kitten 1 2 3 That's all for the vlog today and I hope you enjoyed the video and if you're watching this please like it, please  Love you, bye!"
}