{
  "video_id": "XdDESCBRIXk",
  "transcription": " Summer in the City is over for another year. The concert ends, the lights fade to black and everyone goes home. Right? Wrong. Meet John Lohan. He's a project manager and systems engineer with SoundArt in Winnipeg. John and his team have been hired to look after the sound at the Prudential Main Stage for this weekend's festival.  the weekend, make sure the headliner's sound guy is happy with what he's hearing, and he's got a clean, even palette to work with when he starts mixing their band. Lohen, who grew up in Steinbeck, rolled into town Thursday night with his truck full of equipment, but says his work actually started weeks before. It began with designing the system, which was put together with the artist and the venue in mind. And then we actually get together and start prepping and putting the system together physically in the shop, then pack it into cases, load it into a truck, and show up here that evening.  In this case we had to liaise with the guys building the roof and the lights, saying that we're coming in, instead of coming in Friday morning, we came in Thursday night because we had a sound check early Friday morning. And just letting the roof guys know that we're going to be a little bit earlier, and they had to share their space with us so we weren't surprising them when the truck showed up early. And then it's basically show up, pull stuff out of the truck and set it up.  volunteer crew you work with as well? Yeah, Summer in the City has been great. They have got a fantastic group of volunteers. I think it was last year at the end we got a taste of what the firefighters could do as far as our outgoing crew goes and I mean those guys know how to work and take direction and they made the out go so terribly fast last year and this year they're here for the in, the load in and the load out and a lot of other stuff in between and then  and all the other volunteers have been fantastic. It's one of those shows we can come to and not be worried about crew. I've been told that there's some young guys here that are kind of aspiring to do this as a career. Have you bumped into any of those guys? Yeah, there's been a few guys who have been interested in this kind of stuff. And when they ask questions, we answer as best we can. If there's any worried parents out there, we tell them the truth. This is not a career that you want to raise a family on. You don't have to. But it can be fun.  but it's a lot of hard work. What keeps you going in this? It's fun. It's fun. I get to play with the world's biggest stereo system. Well, not the world's biggest, but I get to play with a big stereo system. You've put in a lot of time this weekend. Do you get a break from mixing all the bands? Often, if the band is big enough and they can pay their own sound guy, they'll often bring their own sound guy because they know him and the sound guy knows them and knows their songs. And it allows them to put a bit more of a polish on the  What's it like working with big-name artists and the crews?  I guess during a weekend like this when things are working, do you get any free time to just kind of sit back and enjoy the show?  guy and make sure everything is running smoothly for them and when things settle down and they get into a groove then you can sit back a little bit more. Reporting from summer in the city, I'm Chris T. Tartt.  you  you"
}