{
  "video_id": "xsO7lu70Ghg",
  "transcription": " What's the question?  Having fun means having a really fun summer. Having fun and trying new things. And making new friends. Having a good time. Walden is a place where you can bond with friends and have a good time. Walden is the best! I get to come here for two months every summer and I love it a lot. Walden is tripping. I like how everyone's like one big family. Walden is a place to eat really good food. Walden is awesome! Awesome.  You get to wake up and have breakfast with your 500 friends. This is my first year at Walden and I've already made so many good friends. First year in Walden. First three years. Five years. This is my seventh summer. Eighth year. This is my fifteenth summer here, my fourteenth. Fourteenth. I've been at Walden for sixteen years. Camp Walden is trying new activities and meeting new friends. Walden is the place to be. The beauty of nature. With all the friends I've made.  around you. 49, day sleepover with all my friends. Walden means the world to me. I love it so much. I've been here for so long. It's all my best friends and I just love it so much. Walden means friends, family and a place that I could go and to just get out of the city. Walden is my family and it's where I belong. Walden is friendship. Because we don't have camps like this in Australia. Walden is love. Walden is bromance.  Walden is better than Gesher. Walden is and always will be my most favorite place to spend my summers. Walden is WHBL. Walden is sexy. I love that camp is a getaway from the city. A place where you can get away from everything that's going on in the city. Walden is our break from technology. Walden's the best. The Camp Walden is the best camp. Best camp that I've gone to. The best camp. Walden introduces friends. Walden's a place where I can connect with all a bunch of my friends.  friends meeting people. Walden is... Walden is my first love. Walden means lots of fun all summer. Doing things that you normally don't get to do. Walden is where I grew up. WFM. Walden is a new experience. Walden is... a great place to spend the summer with my family. Walden is flipping awesome! The most beautiful place on earth. The place where everyone is accepted. Walden is my life. Walden is dancing in the rain!  Walden is our favorite place on earth. The place where dreams happen. Walden is Walden Gates. I love how when you come back every year it's like you never left. Just everything. It's just a beautiful place. What's not to enjoy? It's just a good place to go to camp. It's amazing. Walden is so special to me. It's like my home away from home. It's a home away from home. Home away from home. My home away from home. Home away from home.  My home away from home. A home away from home. It's our home away from home. It's a place I look forward to throughout the whole year. Thank you, Camp Baldwin. Thank you for the great memories. Bye!"
}