{
  "video_id": "xW56ML986WA",
  "transcription": " So  Hey guys, Joe Spiro, Street Shoes Ballin'. I'm Ben with Alexander's Pro Shop in San Antonio, Texas. And today we bring you Hammer's all new Red Legend. So Ben, talk to us about the Red Legend here. Well, this ball has the MBT Pro-Lice coverstock on it to get clean through the fronts and mids. And it has a gas mask core, which was made famous in all the Black Widow line.  It has a 2.50 RG with an 058 differential and an 016 intermediate differential. So when they started talking about this, when I got excited, I loved throwing the Assassin. The Legend, it was okay, but you know, I'm not real big on the Legend, but this one, when it came out, I love throwing paralyzed equipment. So I couldn't wait to get my hands on this one. I can't wait to take this one out and throw it, man. What do you think? Oh yeah, definitely. It's going to get a lot cleaner through the fronts for you and have a lot more motion off the back.  Well let's get it out there, put some high resonance and see what we can do with it. Alright? Y'all stay tuned guys, we will be right back.  so  so  so  so  so  I think this ball is going to live up to the name. Oh yeah, definitely. It got real clean through the fronts and mids and had a lot of motion out the back. That pearlized coverstock with that gas mask core, that is a deadly combination, man. Oh yeah. Welcome back guys. Y'all just watched me throw Hammers all new Red Legend. So Ben, you were watching, you saw what was going on, different angle than what I was doing at that foul line. So what did you think about this ball? This ball got real far down lane, especially with the layout, a 75 by 5,  by  that energy a lot. I'm excited about this one. I did something a little bit different with this ball. The first day I had it I took it out of the box, I drilled it, threw it out in the league, I shot 660 with it. Just first three games out of the box. Great ball. It's going to be a lot of fun to throw and I'm really going to enjoy having this one in my bag. Ben, you got anything else to add? Come by and get your Red Legend today and become a legend. All right man. Once again I'm Joseph with Street Shoes Bowling. I'm Ben with Alexander's Spurs Shop in San Antonio, Texas. We'd like to thank  Thank you all for watching our videos and you all stay tuned for more. Hey guys, if you like the ball that you just saw in this video, stop by abulletsupply.com and order yours today online or if you're in the San Antonio region, come on by Alexander's Pro Shop here at Astro Ball and pick one up in person. Thanks a lot guys.  So were you... You said... You said you could... Yeah, yeah, I need to get back in the gym.  So you rather work with this? Oh, it's a 10 pin again. Oh, I haven't done that in... I got the 10 pin though.  you"
}