{
  "video_id": "xxkw6OT_flM",
  "transcription": " They don't have a backbone, they're like jelly. But they do have an exoskeleton. Some have exoskeletons, some don't. Some are like jelly, some are not. A lot of those guys actually don't have a heart or a brain or even a lot of the same organs that we do. And it's not very nice to call your friend an invertebrate, just so you guys know. But it's really cool. So both vertebrates and invertebrates are living  made of cells. You guys know your body is made up of cells? So we'll kind of talk about that. And then this one is another big fancy science word. It's called consumers. In other words, you think all those things they need to eat something. And there's some of those things, actually a lot of those critters and vertebrates, and vertebrates, that one of their favorite things to eat is from the dead stuff.  So we're going to hear a lot about poop and this. Which is good. I'm going to hit the light. It's a little bit of a problem. The one closest to me. Alright, so just to make it a little easier for everybody to see. The first critter is actually the simplest. Oh wait, how do you do it? I forgot about that slide. This is really quick. But vertebrates and invertebrates are in all the oceans combined.  invertebrates. So most of them do not have a backbone. Which is really cool. When you think about it on land, there's a lot of things you don't see or you don't pay attention to. Think about all the critters, let's say, in your room that's super dirty. I hated cleaning my room when I was a kid. But what are the spiders in the corners? All of the bugs.  We're talking about creepy crawling bugs and slugs and things that, you know, are creepy. No. Okay. So, and then the rest of it, so it's 97% don't have a backbone and 3% of them have a backbone. So you're talking about the fish and the sharks and the whales and the dolphins that I've heard three or four times that people just really, really, really want to see. Hopefully we'll see them. If we do see them when we're on land, it's normally after lunch.  Okay, um just so you keep your eyes peeled a little bit. But yeah, I think that's really crazy. The big number. Well like I said, the first critter that we are going to talk about, right? Is Sponges. Could you not videotape me?"
}