{
  "video_id": "Y3mXyd8i6bo",
  "transcription": " All right, we're making the scene in the Capitol, all right. Yeah, so we're going to go to lunchtime. Okay, it's time to go have lunch. One of the last meetings we had after Jennifer introduced the bill was with Pete Olson's office. Congressman Olson is a local representative from Texas.  Thank you for having us. I'm sorry it's a little crazy. Thank you for all your support of this very important legislation. This is my second opportunity to be able to lobby on Capitol Hill and the first time I had a ton of fun and I think this time is going to be the same. Slightly different with the whole family of course. This meeting with Congressman Olson was a little bit more of a relaxed setting and it allowed for us to talk a little more frankly about some of the  issues that we were there to discuss. Both Bill and I were former patients. We traveled across states to get health care. You know, my parents spent, they didn't go on family vacations. We went to Baltimore so I could have surgery. My mom, you know, thankfully had, you know, pretty good health care that allowed for that, but not all families have that. Right, exactly. You're special in that regard. Exactly. My folks had to buy a second policy to carry so, you know, the medical part would be covered by one and the  surgical part be covered by another. How about these two? Would they look in... I mean... Well, they do have complex medical needs as well. They have a different type of skeletal splasher than we do. Hopefully, they won't need as many orthopedic surgeries down the line. But Will's already had three surgeries thus far, and he's four. Zoe, knock on wood, hasn't had to have any, but we're still getting all of her evaluation and workup done. So... But as they get older, they're at risk for, you know, the legs, the way they grow and develop, bowing. I can't imagine being a parent to  you know, either of these two guys not have gone through all of that that we've gone through and do this in the blind. You've been through what they're going to go through in their lives. So, you know, the challenges, you know, doctors, which is a blessing from God that they're here. My hope is that sharing our personal experiences as patients, as parents of how important this bill is and what impact it can have for families and individuals will help it to stand out for for our congressmen. All right. Here's to HR 49.  HR 4930, speak now for kids. All right, cheers. Will, can you do it? She can do it. Do it now. Do it. It's Congressman Olsen. There you go. Yay. Perfect. Oh, cake. Oh, Will. Oh, yeah, don't let him. He'll reach right in there. He'll be claiming each one. I don't know if Congressman Olsen knows how old my children are, but they can't vote yet. So bribing them with cupcakes. Ooh, pretty. Hey, you got to eat it in one bite.  is not going to keep him in office. Oh, yeah, you just made them the happiest grampers ever. They might be moving in. This is the sweeter side of politicking on the, uh... I know. This is the best part of the day, yeah. However, if he decides to run for, like, a 17th term, my kids will definitely be voting for him. Mommy! Are you silly? Is it good? You got icing all over your lips? Lips.  and after we got most of what we wanted to accomplish done, Congressman Olsen was nice enough to let Will sit in his chair, and Will seemed to fit in just fine. Oh, my goodness. That is awesome. I definitely got a kick out of seeing Will in the chair. Jeez. All right, Will, slow down, slow down, slow down, slow down. It didn't make much of a dent, but my son was trying really hard.  to do so. I'm glad that we didn't have to buy the congressman a desk. Thank you. Can you say thank you? Can you give him a fist bump? Blow it up. Alright!"
}