{
  "video_id": "y9XYO9d9H94",
  "transcription": " Thank you.  do  Cottonweb was started in the year 1998 with three friends, Vaseem, myself and Danyal. Since 1984, we had our  schooling together, our college together and once we were done with our university studies is when we thought let's carry on with this friendship and do our practical life also and we came up with this idea of starting up something in this textile business. I still remember the day we were sitting together and we were still in our last year of business education at LAMS. We all wanted to be entrepreneurs. I think the biggest strength I see in the company is our togetherness.  We started CottonWear because in terms of value addition we always thought that garments is the best field. First of all, you need less investment. It suited us, employs more people, it consumes less resources. We always thought that textile is a great business to be in Pakistan because it's one of the largest producers of cotton and fabric.  And value added sector was totally absent. We actually opted for a value added sector. We always wanted to be one of the top leaders in this, and finally we were able to make it.  I still remember myself and my partners in a training program and we were sitting quite far apart from each other and somebody asked us to write one word which explained our ideology and we all wrote reliability. Core ideology is derived from this fact that we make all the promises in a very, very professional manner and in a very disciplined manner so that it's a consistent phenomenon that is being followed straight from top till down.  Collectively we have come up with a vision for the company where we want to be in the next 10 years and that is that we want to be globally recognized as a first choice suppliers for our buyers and we maintain a consistent growth pattern on a sustainable basis and we act in a responsible manner. Our vision is to be a first choice for our customers and first choice because of our  product and first choice because of our practices and reliability.  We want the customer to believe that we take his success as a parameter of our success. We would be successful only if he's successful. So he shares his goals, his agendas with us in a belief that we would do our best to fulfill his goals.  for him and we would consider this relationship healthy only if we are able to help him in achieving his goals. That would make us his first choice supplier and I think we are pretty much there.  do  so  so  you  One of the major aspects of our vision is corporate social responsibility. So we strongly believe that we are living in the society, we owe it to the society and we have to give something back to the society. As a team of professionals, we believe that we have to give back to the society because it's not only beneficial for the society, but it's also a lot of motivation for the team who's working in this company, that they would be motivated to know  what they're doing good for the society itself. In that respect, we are contributing towards primary schooling of the children and technical education of the manpower. And that's purely on need basis. They're open to be trained over there and then they're not bound to come back to us and work with us.  you  so  you"
}