{
  "video_id": "YCa0O5lnWO0",
  "transcription": " So Mac 2018 just around the corner. Our feature for today, I'm with Alan Mucklow from Yamazaki UK. Alan, one of the machines that's going to be on your stand at Mac that we're going to be filming on the Monday is going to be this J600 5X. Can you tell our viewers a little bit about this model? Yeah, the Veroxis J600 5-axis AM machine is our next entry into additive technology. So the combination of subtractive, typical 5-axis,  applications with additives. So it's a kind of product where you can use for repair of high value parts, adding of different materials, adding of features. So it really gives that opportunity for some really exciting manufacturing challenges to be solved. A lot of people know a lot about subtractive, but on the additive side, what sort of materials can you add? Well, in the case we're showing here is aluminium. We're using a wire fed system, a cold metal transfer technology. So really you can utilise a host of materials, both different  substrates and additive materials depending on the application so steels, aluminiums, ink canals. And the sorts of demonstrations that you do on here, you mentioned to me earlier about a cylinder head or something, you were showing the repair of that. Yeah, we see the repair of high-value items as a real market opportunity for hybrid technology so taking what would normally be a scrapped part, machining away the damaged area, refilling, then remachining back to the net shape and revitalizing that part. Who should be coming to look at this machine at MAC 2018 Alan?  A whole host of industries from automotive through to marine, oil and gas, anywhere where you can really add value by utilising additive technology really does provide a showcase for this next generation of manufacturing productivity. Very, very exciting. So you can see MTD CNC filming live on Mazakstan. Just remind us of the stand location. We're in Hall 20, stands 760 and 790. And we'll be there on Monday the 9th of April.  you"
}