{
  "video_id": "YfC1vRyTci8",
  "transcription": " NVIDIA SHIELD BREW 500GB  40% bigger and a lot heavier.  great controller with the headphone jack, volume touch bar, built-in mic and USB charging board. Also we have the micro USB cable, user manual and finally the power adapter. So let's connect the device and see what we have here. We have the same launcher which is the best launcher on the TV box still now. We have some application can be installed like YouTube, Netflix, Amazon Video and Blix. You can download any application or games that you need and for the other application  you will not find it in the store, you can download it as abk files, after you download from the store the file manager and the side load launcher applications. On the bottom we have the device settings, network settings, shield accessories and power settings which you can choose between sleep now, restart and power off your device. The settings is still the same and the android version is 7.0. You still have the voice search using the built-in mic and the remote control or the controller. You can also activate google search and you can  You can use it without the need to press the shield button on the remote control or the controller by only saying hey Google. You can control the device LED light from the settings make it low, medium, higher or turn it off. The 500 GB is more than enough. I downloaded many applications in games and I still have 440 GB out of 455 GB. Nvidia Shield is known as the best TV box for gaming. You have access for many games especially if you subscribe to Nvidia Games membership.  membership. You can reorder the recommendation row as well as the application and games row from the settings home screen or you can just simply press and hold or any apps and games icons from the home screen to reorder. If you need to reset the device you have two options fast and full reset. I advise you to go with the fast reset. If you choose the full reset you have to wait more than two or three hours. So I will leave you now with the gaming test and I will show you how many games available on the device. I hope you enjoyed the video.  if you did please hit the like button, subscribe if you aren't yet and I will see you guys in the next video.  I  I  Protect your head!  You can always...  you"
}