{
  "video_id": "YttyCifTup0",
  "transcription": " Alright, let's try this again. So I have two eggs, potatoes, avocado, ham. I like to mush up my eggs. I have fried eggs. Maybe I should turn that off. Her ABCs is on. And then cheese galore. Ham, avocado, potatoes, two eggs, and we have green chili.  Now you know why, even though I jump rope every day. Tortilla pumpkin spice coffee. Mmm. Oh, this is good stuff. I just got that green chili from my auntie the other day. The best. So I mush up my eggs, put in my potatoes.  Sorry, I'm going to work late. I gotta work at 11.30 today.  Normally I don't have ham but again my auntie gave me all kinds of ham too. But normally I don't eat really eat meat with breakfast. Never really have bacon ham or sausage.  Sorry And I haven't had green chili in a while I usually have something hot. I'll either have like chili beans or Valentina sauce or  yellow peppers  food sushi like and she always like puts all her food in like this big ol' mmm like green banana leaf i guess it's called or sesame leaf i don't know just big green leaf and she stacks all her food in this big old green leaf  I love eating that kind of food but this is straight New Mexican food. I live in New Mexico. Oops, I didn't even get it. Avocado.  Oh, it was hot. I actually had green chili on. Probably a little green chili on the fork. Mmm, but yes, this is the best. I don't eat this every morning.  Mommy!  I forgot what I was saying.  so sour from Starbucks most mornings. I haven't been doing that lately but damn that coffee's good. I usually eat like an egg sandwich with lunch meat cheese and a little circle flatbread. More?  Eat your potato now. Now I'll give you more. I think my fork is hot. I'm enjoying. But she eats hot chips so... She's been eating hot Cheetos and hot fries since she was one.  has two older sisters and she sees them eating it and she just wants what they want so we tell her no and then she keeps asking so we give her a little piece. She goes ha ha ha ha and she comes back for another little piece. She's straight Mexican at two.  Eating chili. The hot chips are different than chili though. Daddy's on his way. This is so good.  But on my days off or days that I go in light, I do make potatoes, eggs, and cheese and tortilla. That's a given. I never have ham. Avocado once in a while, if I have any. Say hi.  Say hi. Tell him I'm eating potato. I ran a tortilla. But I'm not gonna get an early. I'm done with the ham too. And the chili. My mouth's on fire. But  Everyone knows you do not like sweet chili. Not even one bite. There you have it. Oops, all gone. Say bye. See you later guys. Later. Later. Say bye dude. Bye dude.  I"
}