{
  "video_id": "Z0CMOiXAnHU",
  "transcription": " So we're here at Rasta Aarde and we're gonna see if they're still open. The sign looks like it's been taken down. So I don't know. They go straight down to the sea. Straight down? Okay cool. Yeah. Okay. Yay! I'm excited.  animals or animal products. So I was really excited to eat here. I really thought there would be more Rasta places, but I mostly saw places for jerk chicken and oxtail. Not so cool. There was a lot of places on the street where you could buy a lot of different fresh fruit, which was super great. And we did buy some mangoes, which were really tasty. So take you inside the store.  And you can see all the fruit we had out and all the coconuts and pineapples and honey bananas. Here's the menu. Pop a picture of the menu so you can see it a little bit better. Here's the picture. I got the breakfast platter. It was so good. It says $12,000 Jamaican. It was really like $11 American. And here's outside. Just loved all the artwork and all the heart and love that he put into it.  to the restaurant. We are on Seven Mile Beach and it's just past the Margaritaville. You'll see Woodstock over to the right of it.  I don't really get drug tested. I just didn't want to smell  can't complain he makes everything fresh so it's well worth the wait. It's a breakfast platter. It's good. It's good, eh? Yeah. Vegetables and fruits. No meat, no dairy, no egg. No. No. All natural. Aki. There's aki. Right here, this is aki.  The aki was so good. If you go to Jamaica, you have to try it. Most of the time it comes with salt fish, which is not good. But, here I got it without salt fish. And at the resort, they made it for me without salt fish.  Bami bread. Made from the cassava. Cassava? Yeah, cassava. That's good. That's way good. They peel it and then they grate it and put it out to dry and then they make it into a flour like. It's good.  Fresh. Oh, Bami bread. Delicious. You're eating healthy. And this one is calhou? Like collard greens. Mm-hmm. My homemade collard greens. I don't taste the collard greens. Yeah, collard greens next to spinach. Yeah. Yeah. More Bami bread?  Plantain.  There were a lot of stray dogs in Jamaica most of them look really mangy though  She do not know that name So yeah, I ate the entire plate by myself Steve had a bite or so but honestly I'm thinking about some of his frozen fruit for dessert  So these are Sour Sots. It's a neat fruit and he's got a juice for them. So that's pretty cool.  That looks beautiful. Is that cacao? No, that's a little bit of granola on top. Oh, yeah. With some raisin and some crushed almond. This? Yeah, man, that's a sweet raisin. Sweet raisin, okay, cool. Cashew, yeah. Thank you. What is the shower sock? Okay, so let me tell you this. All right, brother, brother.  Cool Cool  fighting agents and sour saps become a very very popular and in-demand fruit. And my Rasta mango is I-tal 2000 feet above sea level in a Rasta venue. Wow! Yeah mon! Thanks for watching! I post new videos every Monday. Like, subscribe, comment down below. Where do you want to go on vacation next?"
}