{
  "video_id": "Z0Ct75njaD0",
  "transcription": " Reviews by Jamie  it's kind of expensive. But it's always exciting when a new company comes out with a new cosmetic line so I figured I definitely want to try it. So I pretty much pre-ordered it. The line is supposed to come out September 26th but I got some of the things early like this. So when it came I immediately Instagrammed the picture of the bag because it's adorable. I just love everything about it, like the colors and I just love it. And I'm usually, I'm not even that big of like a packaging person but I love this packaging. I think it's so  so cute. So open it up and then you have the first product that they sent me. Oh and they didn't send me everything I ordered yet. They're sending like one thing per day so it's like oh finally everything came and then it's like one item in a big box. So this right here is a lip and cheek tint. So they only had one color of this and it was called the Cat's Meow. The description of it said that it's a nice rosy pink color so I think that's a really versatile color that a lot of people will like to wear. Here is the gold. It's kind of reflecting on the light  right now, but you can see the Tory Burch symbol right there. And then here it is right here. So you can kind of get an idea. Oh, I meant to do my nails. Sorry. And then the color's right in here. And I tested it out a couple times, but I haven't worn it like a lot yet. But I did want to just kind of test out the color and see what it's like. So I got some on my finger, just kind of show you. And this is  supposed to be more of like a sheer kind of a dewy finish to it so it's not going to be super intense. Right now I do have foundation and powder on just because I like to set the normal base that I would for any kind of cheek color. So I'm just gonna take a little bit and it feels so nice. It's really like nice and smooth. It's not too thick. You can, it just seems like it'll blend well when you touch it.  It's also supposed to be a lip stain, so I'm going to try it out on my lips. And it feels really nice going on the lips. I purposely didn't wear any chapstick or anything just to see  what it would be like going on and since it's like such a sheer dewy formula it sits really nice on my lips and it's not like adding to the chappness. I don't know if it's moisturizing at all but it feels nice on and it doesn't and it doesn't feel like it's drying my lips out so I'm happy about that. I just grabbed for the lid of this to put it back on and by accident I took my lens cap and I was like this doesn't fit weird oh. So as far as the fragrance I actually really like it when I first smelled it  I thought that it was really nice. It's just a really light scent so I looked it up to see if it was scented I didn't even know if it was and it is it says it's lightly scented with some of the notes from their fragrance like Grapefruit and Mandarin and it is a really good scent and it's not strong like when I put it on my lips at first I could smell it a little and now it kind of went away, but it's a really good scent to it Mmm, so overall I really really enjoyed this product. I like how it looks on me  I love the color of it. I don't know if they're gonna come out with any more colors, but I felt like this was a really nice color for me. And you know, you couldn't really build it up that much I didn't feel like. I felt like I put it on and it was supposed to give that kind of sheer, dewy finish and it just wasn't intense. I like how it goes together. I think that's kind of cute. And it's also quick and especially like in the wintertime if I'm grabbing something, I could just grab this and go out. Know that it's not gonna dry me out or anything because I'm so dry. I'm dry in the sun.  summer, winter, any season. And winter is just worse. If you take this out and you're somewhere, you're going to look so cute. Thanks for watching and I'll do more of these makeup reviews on the Tory Burch line as soon as I get more of the makeup products one by one, day by day. But I gotta say I'm happy they came before the date said. It was supposed to ship the 26th so I think I got lucky.  Thank you guys for watching and I'll see you guys soon. Bye!"
}