{
  "video_id": "ZhnjgU5VyKY",
  "transcription": " Hi YouTube, I've got my parrot stuck on my back and he won't get off. Hold on. Get on. Sorry about that. Yeah, I'm gonna sing Next To Me by Emily Dyer. It's probably not gonna go too well but I'm gonna try. Next to me.  You'll find I'm drinking on the table. My eyes are staring out the way. You'll never find me being unfaithful.  And you'll find him, you'll find him next to me You'll find him trying to chase his arrow The mighty flame of power of the queen Can one ever find him where the rest go? And you'll find him, you'll find him next to me Next to me  Make believe, ooh ooh Make believe, ooh ooh And you'll find, and you'll find, it makes me When your mind is blank and all of my friends are blind And I can't seem to find no alpha or alpha 3 And I know I have no need for me to find  Cause I'm finding my finding next to me When the skies are grey and all the doors are closing And the rising pressure makes it hard to breathe Will I lose my head? Stop the tears from falling And I'm finding my finding next to me Next to me  And  And you'll find, and you'll find him next to me. Next to me. Next to me. Next to me. And you'll find, and you'll find him next to me. Next to me.  Let's do this, let's do this, let's do this, let's do this, let's do this, let's do this, let's do this, let's do this, let's do this, let's do this, let's do this, let's do this, let's do this, let's do this, let's do this, let's do this, let's do this, let's do this, let's do this, let's do this, let's do this, let's do this, let's do this, let's do this, let's do this, let's do this, let's do this, let's do this, let's do this, let's do this, let's do this, let's do this, let's do this, let's do this, let's do this, let's do this, let's do this, let's do this, let's do this, let's do this, let's do this, let's do this, let's do this, let's do this, let's do this, let's do this, let's do this, let's do this, let's do this, let's do this, let's do this, let's do this, let's do this, let's do this, let's do this, let's do this, let's do this, let's do this, let's do this, let's do this, let's do this, let's do this, let's do this, let's do this, let's do this, let's do this, let's do this, let's do this, let's do this, let's do this, let's do this, let's do this, let's do this, let's do this, let's do this, let's do this, let's do this, let's do this, let's do this, let's do this, let's do this, let's do this, let's do this, let's do this, let's do this, let's do this, let's do this, let's do this, let's do this  subscribe, please thumbs up and always leave a comment because I want to know what you think."
}