{
  "video_id": "ZlosBynTeh4",
  "transcription": " Yeah!  Hello again football fans, welcome to Friday Night Varsity Flashback. I'm Aaron Schoonmaker, joined by prep writer, Paul Latimer. Week 3 of the playoffs is now in the books. We had a couple good games tonight. The rain held off, which we were really hoping it was. I was checking the weather all day and during the worst we got the bad weather.  We got the best of the competition as well. We did a lot of traveling to bring you some highlights So I hope you enjoy them. The first game we got to is all the way up in Buleville East Duplin pal You were there tell us about it I was there East Duplin came in on a 10 game win streak to the number one seed in that in that bracket Taking on Tarboro on a 20 game win streak last year's state champions It's a defensive battle. You know, everybody's going back and forth Both teams left a lot of offense on the field mainly East Duplin three drives in the first half inside Tarboro's red zone  zone came away with three points in that first half. They should have had three touchdowns, came away with three points instead. You know, for a while in the third quarter, East Dubuque started coming back at them. Actually went up 10-7 at one point, but late in the game, Tarboro came back with a nice little touchdown run there, a nice little drive. 7-37 to go in the fourth quarter, Tarboro goes on top. East Dubuque misses a field goal as time expires to blow it.  Yeah, it's a tough loss. And I got to that game right around halftime. I was on the sidelines. I heard one of the assistant coaches come up and say, we left too many points on the field. We should be up 21 to 7 right now. Instead, it was 7 to 3. There were kind of a couple turnovers there in the third quarter. Justin Pickett did have a very nice touchdown run, but it wasn't enough. Absolutely. It just wasn't enough for these guys. Again, in that first half, they had a drive where Tyrone Matthews fumbled at the goal line. And that's a huge... I mean, Tarboro covers, runs out the  the clock at the end of the half. That's seven points off the board right there. Not the best offensive performance in that first half.  Wallace Rose Hill defense.  He finished the night with 129 yards on four carries. Omar Carr, he had one of two touchdowns right here with his carry off the left side tackle. Wallace Russell was in cruise control from there. They win that one going away 50 to 7. They finish with 449 yards of rushing on the night with nine different backs. Not the first dominating performance of Wallace. They've been rolling through that bracket always. No one's even come close to that.  to  six touchdowns of this game. They went up 42-14 at half. They got outscored 34-14 in the second half and ended up hanging on for that 56-48 win. Antonio Murchison, another great game. 20 carries for 149 and four touches. Daron Burney, 7 of 11 passing for 166 and two touches. Saquon Johnson had both of those receiving. He had three catches for 127 yards. And Xavier McCoy, he broke out a little bit tonight. 15 carries, or 157 yards on 10 catches.  carries and another touchdown.  the  Pinder was able to hold that to 8 points and put up 28. There's a great job by Pinder all around there. Absolutely, and now they get to take on Southwest Onslaught. That'll be a difficult one in Jacksonville, in Southwest Onslaught. So, the Stallions and Patriots, that it makes for a very good game. The one common opponent they have this year, Wallace Rose Hill, both of them lost, both of them played very tough games. So, we'll see how that one goes. And to wrap it up, we mentioned that Wallace Rose Hill will win. Come back, join us on Wednesday. We're going to preview. We've got three games.  three teams left in it. We opened with 16, got down to 8. We're down to 3 now. We're in the semi-finals, so Final 4 in just about every class. New Bern will play on Saturday. We'll get you an update on that one. We're already on the website. Keep looking around. Stats standing. Should be updated for you. I just got done doing it right before we taped this. Join us on Facebook, facebook.com slash starnewsvarsity. Pal, final word? That's about it. Well, keep checking it out, guys.  you"
}