{
  "video_id": "ZxjqBjryr6k",
  "transcription": " Hey everyone, what's up? It's me here Megan the makeup artist and welcome back to my channel today I am doing it just a colorful eyeglasses kind of like a how-to wear colorful eye makeup with your glasses  So if you guys, you know want to see how I got this then go ahead and keep on watching I do want to say hello to all of my new subscribers. I've gotten a lot of you guys Lately and I do want to say I'm sorry. I haven't been uploading as often I've been on the road a lot lately and I just Couldn't really find the time to film videos and edit and then on top of that I was super tired like I literally went to Indiana came home for  Maybe a week and then I went to Dallas, Texas for like six days came home for one day went to Illinois for three days, and then I've been working my butt off after that But I just want to let you guys know thanks for sticking with me, and I'm sorry that you know I Haven't been around but I've also been having a lot of things Going on that I'm super excited to announce to you guys when the time is right which should be soon, so I'm so excited for that  Yeah, these little projects that I've been working on are finally here, and I'll be able to show you guys in a little bit But yeah, so that is it. I'm feeling a lot better. I was very worn down from all of this travel, so And then I was able just to sit down and I just wanted to film a colorful look because there's a lot of festivals going on and I just you know not When I do I make up I tend to not do  a lot of color for my glasses and that's because I just don't want it to be too dark behind there but there is a way to do it and I'm gonna go ahead and show you guys that in this video so I just want to say again thank you guys so much for watching and I'll see you guys in my next video much love to get this started as you guys know I'm gonna go in with these two shades in the Jaclyn Hill palette of course right I mean it wouldn't be a Meghan Martin tutorial  without those two shades for my transition shade. So I'm just gonna sloppily just throw this in here, buff it out, make it look real blended. Same fluffy brush, I'm gonna go ahead and go in  this  fluffy brush and this is gonna go right here in the crease and onto the lid. I'm really just gonna keep it concentrated in this outer lid. Like I said we are doing this with our glasses on so I don't want it to get too crazy but I wanted to be able to put some fun you know summer vibes going on.  in here so next I'm taking a flat shader brush with the purple shade and we're gonna go ahead try to not get this all over our face but I'm gonna go ahead and pat this on the lid in the outer corner here taking the other side of the flat shader brush and I'm just gonna go in with this color right here believe this is it's called obsessed because I love this color so I would just I don't know remember it  Then this is gonna go on the lid to the inner corner. I'm gonna go in with a flat shader brush and Forever Lit from the Anastasia Nicole Guerrero palette. And I'm gonna go ahead and highlight my inner corners with this. It's gonna be so pretty. Alright you guys, so this is the finished look with your glasses. Alright you guys, so that is it for this makeup tutorial slash  How to wear colorful eye looks with your glasses I hope you guys loved it, and I will see you guys in my next video much love"
}